Tom50505050/esp32-ham-clock/src/main.cpp
#include <Arduino.h>

/*
 * ESP32-HAM-CLOCK - Odbiornik DX Cluster i stacji APRS-IS z interfejsem WWW i opcjonalnym wyświetlaczem TFT
 * 
 * - WiFi Manager (AP mode jeśli brak zapisanych danych)
 * - Połączenie z Telnet DX Cluster (TYLKO ODBIERANIE - nie wysyła spotów)
 * - Parsowanie i przechowywanie spotów DX
 * - Obliczanie odległości (Haversine)
 * - Interfejs WWW z polling (odświeżanie co 2 sekundy)
 * - Wyświetlacz TFT (ESP32-2432S028) - opcjonalnie ESP32 WROOM + TFT ILI9341 
 * 
 * UWAGA: Urządzenie działa TYLKO w trybie odbioru.
 * Tak samo z APRS.fi  - tylko odczyt.
*/

// Wczesne forward-deklaracje, aby auto-prototypowanie Arduino znało typy używane w sygnaturach
enum ScreenType : uint8_t;    // pełna definicja niżej
enum Screen6ViewMode : uint8_t;
enum TrKey : uint8_t;
struct DXSpot;                // pełna definicja niżej
struct APRSStation;           // pełna definicja niżej
struct AprsWxDecoded;         // pełna definicja niżej
struct PropagationData;       // pełna definicja niżej
struct WeatherData;           // pełna definicja niżej
namespace fs { class File; }

static const uint8_t WEATHER_DETAIL_COLS = 5;

// Forward declarations for UnlisHunter state used before global definitions.
extern bool unlisRunning;
extern bool unlisGameOver;

void normalizePolish(String &text);

// ========== KONFIGURACJA WYŚWIETLACZA TFT ==========
// Włącz TFT w platformio.ini (build_flags) lub Arduino IDE; guard to avoid redefinition warnings
#ifndef ENABLE_TFT_DISPLAY
#define ENABLE_TFT_DISPLAY
#endif

// Wersja firmware
#define FIRMWARE_VERSION "1.2b"

#include <WiFi.h>
#include <WiFiClient.h>
#include <WebServer.h>
#include <Preferences.h>
#include <time.h>
#include <ArduinoJson.h>
#include <esp_rom_sys.h>
#include <soc/rtc_cntl_reg.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <FS.h>
#include <LittleFS.h>
#include <math.h>
#include <ctype.h>
#include <WiFiClient.h>  

static const char* tr(TrKey key);
static void buildWeatherDetailHeaders(String headers[WEATHER_DETAIL_COLS]);
static uint16_t readBmp16(fs::File &f);
static uint32_t readBmp32(fs::File &f);
String getAPRSSymbolShort(const APRSStation &station);
void drawBootScreen();
void tftBootPrintLine(const String &line);
String formatDistanceOrCountry(const DXSpot &spot, size_t maxLen);
void drawHamClock();
void drawDxCluster();
void drawSunSpots();
void drawBandInfo();
void drawWeather();
void drawWeatherForecast();
void drawAprsIs();
void drawAprsRadar();
void drawPotaCluster();
void drawHamalertCluster();
void drawMatrixClock();
void drawQrzInfoScreen();
void handleQrzInfoTouch(uint16_t x, uint16_t y);

void drawHamburgerMenuButton3D(int x, int y);
void handleTouchCalibrationTouch(int16_t rawX, int16_t rawY, uint16_t x, uint16_t y, bool isNewTap);
static bool isAprsAlertCloseButtonHit(uint16_t x, uint16_t y);
static void dismissAprsAlertScreen();
void drawBrightnessMenu();
void handleBrightnessMenuTouch(uint16_t x, uint16_t y, bool isNewTap);
void unlisStopGame();
void unlisStartResetGame();
void unlisHandlePttPress(unsigned long nowMs);
void handleScreen1MenuTouch(uint16_t x, uint16_t y);
void handleScreen2MenuTouch(uint16_t x, uint16_t y);
void handleScreen6MenuTouch(uint16_t x, uint16_t y);
void handleScreen5MenuTouch(uint16_t x, uint16_t y);
void handleScreen7MenuTouch(uint16_t x, uint16_t y);
void handleScreen8MenuTouch(uint16_t x, uint16_t y);
void handlePskMapTouch(uint16_t x, uint16_t y);
void drawDxClusterFilterMenu();
void drawPotaFilterMenu();
void drawHamalertFilterMenu();
void drawAprsSortMenu();
void drawWeatherMenu();
void drawHamClockTimeMenu();
static bool isScreen6RadarZoomTopHit(uint16_t x, uint16_t y);
static void triggerScreen6RadarHint();
static bool isScreen6RadarZoomBottomHit(uint16_t x, uint16_t y);
void drawHamClockTimeMenu();
float calculateBearing(double lat1, double lon1, double lat2, double lon2);

// ========== DANE PSK REPORTER ==========
struct PskSpot {
  String callsign;
  float lat;
  float lon;
  int band;       // w metrach (40, 20, 80, etc.)
  String mode;
  unsigned long timestamp;
  int snr;        // opcjonalnie
};

const int PSK_MAX_SPOTS = 50;
PskSpot pskSpots[PSK_MAX_SPOTS];
int pskSpotCount = 0;
unsigned long lastPskFetchMs = 0;
const unsigned long PSK_FETCH_INTERVAL_MS = 60000; // co minutę

// Konfiguracja PSKReporter (zapisana w NVS)
String pskReceiverCallsign = "";  // znak odbiornika do filtrowania
int pskMaxSpots = 50;             // maksymalna liczba spotów
int pskHoursWindow = 1;           // okno czasowe w godzinach
String pskFilterBand = "";        // filtr pasmo (pusty = wszystkie)
String pskFilterMode = "";        // filtr tryb (pusty = wszystkie)
String pskCustomUrl = "";         // własny URL API (pusty = domyślny)

// HTTP Monitoring - monitorowanie znaku
String pskMonitorCallsign = "";
int pskReportDays = 0;
int pskAutoRefreshMinutes = 5;

// Menu PSK Map (tymczasowe ustawienia podczas edycji na ekranie)
bool pskMapMenuOpen = false;
String pskTempReceiver = "";
String pskTempBand = "";
String pskTempMode = "";
int pskTempMaxSpots = 50;
String pskKeyboardBuffer = "";  // Bufor dla klawiatury ekranowej
int pskKeyboardTarget = 0;        // 1=znak, 2=max
enum PskMenuField { PSK_FIELD_NONE, PSK_FIELD_CALL, PSK_FIELD_BAND, PSK_FIELD_MODE, PSK_FIELD_MAXSPOTS,
                    PSK_FIELD_KEYBOARD, PSK_FIELD_BAND_SELECT, PSK_FIELD_MODE_SELECT };
PskMenuField pskActiveField = PSK_FIELD_NONE;

// Ścieżka do pliku BMP z mapą
const char* PSK_MAP_BMP_PATH = "/Mapa swiata.bmp";

// Zakres współrzędnych dla mapy (dostosować do pliku BMP!)
const float MAP_LAT_MIN = -60.0f;  // min szerokość geograficzna
const float MAP_LAT_MAX = 75.0f;   // max szerokość geograficzna
const float MAP_LON_MIN = -180.0f; // min długość geograficzna
const float MAP_LON_MAX = 180.0f;  // max długość geograficzna
const int MAP_DISPLAY_X = 0;       // pozycja X mapy na ekranie
const int MAP_DISPLAY_Y = 32;    // pozycja Y (pod nagłówkiem)
const int MAP_DISPLAY_W = 480;     // szerokość mapy
const int MAP_DISPLAY_H = 256;   // wysokość mapy

// Forward declarations for Screen Saver functions
void resetScreenSaverActivity();
void checkScreenSaverTimeout();
void drawScreenSaverMenu();
void handleScreenSaverMenuTouch(uint16_t x, uint16_t y);

