Tom50505050/esp32-ham-clock/src/main.cpp
void savePreferences();
void locatorToLatLon(String locator, double &lat, double &lon);
bool fetchAirPollutionData(double lat, double lon);
static bool drawBmpFromFS(const String &filename, int16_t x, int16_t y);
void sendAPRSLogin();
static String getAprsTxCallsignWithSsid();
void sendAPRSFilter();


// ========== TYPY EKRANÓW (używane w prototypach) ==========
enum ScreenType : uint8_t {
  SCREEN_OFF = 0,
  SCREEN_HAM_CLOCK = 1,
  SCREEN_DX_CLUSTER = 2,
  SCREEN_SUN_SPOTS = 3,
  SCREEN_BAND_INFO = 4,
  SCREEN_WEATHER_DSP = 5,
  SCREEN_APRS_IS = 6,
  SCREEN_POTA_CLUSTER = 7,
  SCREEN_HAMALERT_CLUSTER = 8,
  SCREEN_APRS_RADAR = 9,
  SCREEN_MATRIX_CLOCK = 10,
  SCREEN_UNLIS_HUNTER = 11,
  SCREEN_WEATHER_FORECAST = 12,
  SCREEN_PSK_MAP = 13
};

#define LOG_VERBOSE false
#define LOGV_PRINT(x) do { if (LOG_VERBOSE) Serial.print(x); } while (0)
#define LOGV_PRINTLN(x) do { if (LOG_VERBOSE) Serial.println(x); } while (0)
#define LOGV_PRINTF(...) do {} while (0)

// ========== WYŚWIETLACZ TFT (ESP32 DevKit + zewnętrzny SPI TFT) ==========
#ifdef ENABLE_TFT_DISPLAY
// Wspólna konfiguracja dla szkicu i kompilowanej osobno biblioteki TFT_eSPI.
// Dzięki temu biblioteka nie wraca do własnego User_Setup.h z innym driverem/pinami.
#include "tft_setup.h"

#define TFT_UI_WIDTH 480
#define TFT_UI_HEIGHT 320

#include <TFT_eSPI.h>
#include <XPT2046_Touchscreen.h>

class HamClockTFT : public TFT_eSPI {
public:
  HamClockTFT() : TFT_eSPI() {}

  using TFT_eSPI::drawCentreString;
  using TFT_eSPI::drawString;
  using TFT_eSPI::fontHeight;
  using TFT_eSPI::pushImage;
  using TFT_eSPI::setCursor;
  using TFT_eSPI::textWidth;

  bool usesScaledUi() {
    return false;
  }

  int16_t width(void) {
    return usesScaledUi() ? logicalWidth() : TFT_eSPI::width();
  }

  int16_t height(void) {
    return usesScaledUi() ? logicalHeight() : TFT_eSPI::height();
  }

  void setCursor(int16_t x, int16_t y) {
    TFT_eSPI::setCursor(scaleX(x), scaleY(y));
  }

  void setTextSize(uint8_t size) {
    TFT_eSPI::setTextSize(scaleTextSize(size));
  }

  int16_t drawString(const String &string, int32_t x, int32_t y) {
    return unscaleX(TFT_eSPI::drawString(string, scaleX(x), scaleY(y)));
  }

  int16_t drawString(const char *string, int32_t x, int32_t y) {
    return drawString(String(string), x, y);
  }

  int16_t drawString(const String &string, int32_t x, int32_t y, uint8_t font) {
    return unscaleX(TFT_eSPI::drawString(string, scaleX(x), scaleY(y), font));
  }

  int16_t drawString(const char *string, int32_t x, int32_t y, uint8_t font) {
    return drawString(String(string), x, y, font);
  }

  int16_t drawCentreString(const String &string, int32_t x, int32_t y, uint8_t font) {
    return unscaleX(TFT_eSPI::drawCentreString(string, scaleX(x), scaleY(y), font));
  }

  int16_t drawCentreString(const char *string, int32_t x, int32_t y, uint8_t font) {
    return drawCentreString(String(string), x, y, font);
  }

  int16_t textWidth(const String &string) {
    return unscaleX(TFT_eSPI::textWidth(string));
  }

  int16_t textWidth(const char *string) {
    return textWidth(String(string));
  }

  int16_t fontHeight() {
    return unscaleY(TFT_eSPI::fontHeight());
  }

  void fillRect(int32_t x, int32_t y, int32_t w, int32_t h, uint32_t color) {
    TFT_eSPI::fillRect(scaleX(x), scaleY(y), scaleLenX(w), scaleLenY(h), color);
  }

  void drawRect(int32_t x, int32_t y, int32_t w, int32_t h, uint32_t color) {
    TFT_eSPI::drawRect(scaleX(x), scaleY(y), scaleLenX(w), scaleLenY(h), color);
  }

  void drawRoundRect(int32_t x, int32_t y, int32_t w, int32_t h, int32_t r, uint32_t color) {
    TFT_eSPI::drawRoundRect(scaleX(x), scaleY(y), scaleLenX(w), scaleLenY(h), scaleRadius(r), color);
  }

  void fillRoundRect(int32_t x, int32_t y, int32_t w, int32_t h, int32_t r, uint32_t color) {
    TFT_eSPI::fillRoundRect(scaleX(x), scaleY(y), scaleLenX(w), scaleLenY(h), scaleRadius(r), color);
  }

  void drawFastHLine(int32_t x, int32_t y, int32_t w, uint32_t color) {
    TFT_eSPI::drawFastHLine(scaleX(x), scaleY(y), scaleLenX(w), color);
  }

  void drawFastVLine(int32_t x, int32_t y, int32_t h, uint32_t color) {
    TFT_eSPI::drawFastVLine(scaleX(x), scaleY(y), scaleLenY(h), color);
  }

  void drawLine(int32_t x0, int32_t y0, int32_t x1, int32_t y1, uint32_t color) {
    TFT_eSPI::drawLine(scaleX(x0), scaleY(y0), scaleX(x1), scaleY(y1), color);
  }

  void fillTriangle(int32_t x0, int32_t y0, int32_t x1, int32_t y1, int32_t x2, int32_t y2, uint32_t color) {
    TFT_eSPI::fillTriangle(scaleX(x0), scaleY(y0), scaleX(x1), scaleY(y1), scaleX(x2), scaleY(y2), color);
  }

  void drawCircle(int32_t x, int32_t y, int32_t r, uint32_t color) {
    TFT_eSPI::drawCircle(scaleX(x), scaleY(y), scaleRadius(r), color);
  }

  void fillCircle(int32_t x, int32_t y, int32_t r, uint32_t color) {
    TFT_eSPI::fillCircle(scaleX(x), scaleY(y), scaleRadius(r), color);
  }

  void pushImage(int32_t x, int32_t y, int32_t w, int32_t h, uint16_t *data) {
    pushImageScaled(x, y, w, h, data);
  }

  void pushImage(int32_t x, int32_t y, int32_t w, int32_t h, const uint16_t *data) {
    pushImageScaled(x, y, w, h, data);
  }

private:
  int16_t logicalWidth() {
    return (TFT_eSPI::width() >= TFT_eSPI::height()) ? TFT_UI_WIDTH : TFT_UI_HEIGHT;
  }

  int16_t logicalHeight() {
    return (TFT_eSPI::width() >= TFT_eSPI::height()) ? TFT_UI_HEIGHT : TFT_UI_WIDTH;
  }

  int32_t scaleX(int32_t value) {
    return usesScaledUi() ? scaleValue(value, TFT_eSPI::width(), logicalWidth()) : value;
  }

  int32_t scaleY(int32_t value) {
    return usesScaledUi() ? scaleValue(value, TFT_eSPI::height(), logicalHeight()) : value;
  }

  int32_t scaleLenX(int32_t value) {
    return usesScaledUi() ? scaleSize(value, TFT_eSPI::width(), logicalWidth()) : value;
  }

  int32_t scaleLenY(int32_t value) {
    return usesScaledUi() ? scaleSize(value, TFT_eSPI::height(), logicalHeight()) : value;
  }

  int32_t scaleRadius(int32_t value) {
    if (!usesScaledUi()) {
      return value;
    }
    return min(scaleLenX(value), scaleLenY(value));
  }

  int16_t unscaleX(int16_t value) {
    return usesScaledUi() ? (int16_t)unscaleValue(value, logicalWidth(), TFT_eSPI::width()) : value;
  }

  int16_t unscaleY(int16_t value) {
    return usesScaledUi() ? (int16_t)unscaleValue(value, logicalHeight(), TFT_eSPI::height()) : value;
  }

