Tom50505050/esp32-ham-clock/src/main.cpp
  uint8_t scaleTextSize(uint8_t value) {
    if (!usesScaledUi() || value <= 1) {
      return value;
    }
    float scaleXf = (float)TFT_eSPI::width() / (float)logicalWidth();
    float scaleYf = (float)TFT_eSPI::height() / (float)logicalHeight();
    uint8_t scaled = (uint8_t)lroundf((float)value * min(scaleXf, scaleYf));
    return (scaled < 1) ? 1 : scaled;
  }

  static int32_t scaleValue(int32_t value, int32_t physical, int32_t logical) {
    return (int32_t)(((int64_t)value * (int64_t)physical + (logical / 2)) / (int64_t)logical);
  }

  static int32_t scaleSize(int32_t value, int32_t physical, int32_t logical) {
    if (value <= 0) {
      return 0;
    }
    int32_t scaled = scaleValue(value, physical, logical);
    return (scaled < 1) ? 1 : scaled;
  }

  static int32_t unscaleValue(int32_t value, int32_t logical, int32_t physical) {
    return (int32_t)(((int64_t)value * (int64_t)logical + (physical / 2)) / (int64_t)physical);
  }

  template <typename PixelPtr>
  void pushImageScaled(int32_t x, int32_t y, int32_t w, int32_t h, PixelPtr data) {
    const uint16_t *pixelData = data;
    if (!usesScaledUi()) {
      TFT_eSPI::pushImage(x, y, w, h, const_cast<uint16_t *>(pixelData));
      return;
    }

    int32_t scaledX = scaleX(x);
    int32_t scaledY = scaleY(y);

    // BMP-y ikon pogodowych są przesyłane po jednym wierszu, więc można je
    // bezpiecznie przeskalować w poziomie bez ruszania reszty kodu.
    if (h == 1 && w > 0) {
      int32_t scaledW = scaleLenX(w);
      uint16_t *scaledLine = (uint16_t *)malloc((size_t)scaledW * sizeof(uint16_t));
      if (scaledLine != nullptr) {
        for (int32_t i = 0; i < scaledW; i++) {
          int32_t srcX = (int32_t)(((int64_t)i * (int64_t)w) / (int64_t)scaledW);
          if (srcX >= w) srcX = w - 1;
          scaledLine[i] = pixelData[srcX];
        }
        TFT_eSPI::pushImage(scaledX, scaledY, scaledW, 1, scaledLine);
        free(scaledLine);
        return;
      }
    }

    TFT_eSPI::pushImage(scaledX, scaledY, w, h, const_cast<uint16_t *>(pixelData));
  }
};

HamClockTFT tft;

#define TFT_BL_PIN TFT_BL

#define BACKLIGHT_PWM_CHANNEL 0
#define BACKLIGHT_PWM_FREQ 5000
#define BACKLIGHT_PWM_RES_BITS 8
#define MIN_BACKLIGHT_PERCENT 10
#define TFT_BACKLIGHT 100
int backlightPercent = TFT_BACKLIGHT;

// ========== DOTYK (XPT2046) ==========
#ifndef TOUCH_CS
#define TOUCH_CS 21
#endif
#ifndef TOUCH_IRQ
#define TOUCH_IRQ 22
#endif
#ifndef TOUCH_MOSI
#define TOUCH_MOSI TFT_MOSI
#endif
#ifndef TOUCH_MISO
#define TOUCH_MISO TFT_MISO
#endif
#ifndef TOUCH_CLK
#define TOUCH_CLK TFT_SCLK
#endif

// Kalibracja dotyku (dopasuj jeśli pozycje są przesunięte)
#define TOUCH_X_MIN 200
#define TOUCH_X_MAX 3800
#define TOUCH_Y_MIN 200
#define TOUCH_Y_MAX 3800
#define TOUCH_SWAP_XY false
#define TOUCH_INVERT_X false
#define TOUCH_INVERT_Y false

int touchXMin = TOUCH_X_MIN;
int touchXMax = TOUCH_X_MAX;
int touchYMin = TOUCH_Y_MIN;
int touchYMax = TOUCH_Y_MAX;
bool touchSwapXY = TOUCH_SWAP_XY;
bool touchInvertX = TOUCH_INVERT_X;
bool touchInvertY = TOUCH_INVERT_Y;
uint8_t touchRotation = 1;
uint8_t tftRotation = 1;
#ifdef TFT_INVERSION_ON
bool tftInvertColors = true;
#else
bool tftInvertColors = false;
#endif

static bool sanitizeTftInvertSetting(bool requested) {
  (void)requested;
  return false;
}

bool tftInitialized = false;
SPIClass touchSPI(VSPI);
XPT2046_Touchscreen touch(TOUCH_CS, TOUCH_IRQ);

int bootLogY = 2;
const int BOOT_LOG_LINE_HEIGHT = 10;
bool bootSequenceActive = true;
bool littleFsReady = false;
bool splashPathLoaded = false;

// ========== SYSTEM MENU I NAWIGACJI ==========
const int SCREEN_PAGE_COUNT = 12;
const ScreenType DEFAULT_SCREEN_ORDER[SCREEN_PAGE_COUNT] = {
  SCREEN_HAM_CLOCK,
  SCREEN_DX_CLUSTER,
  SCREEN_APRS_IS,
  SCREEN_APRS_RADAR,
  SCREEN_BAND_INFO,
  SCREEN_SUN_SPOTS,
  SCREEN_WEATHER_DSP,
  SCREEN_WEATHER_FORECAST,
  SCREEN_POTA_CLUSTER,
  SCREEN_HAMALERT_CLUSTER,
  SCREEN_PSK_MAP,
  SCREEN_MATRIX_CLOCK
};

ScreenType screenOrder[SCREEN_PAGE_COUNT] = {
  SCREEN_HAM_CLOCK,
  SCREEN_DX_CLUSTER,
  SCREEN_APRS_IS,
  SCREEN_APRS_RADAR,
  SCREEN_BAND_INFO,
  SCREEN_SUN_SPOTS,
  SCREEN_WEATHER_DSP,
  SCREEN_WEATHER_FORECAST,
  SCREEN_POTA_CLUSTER,
  SCREEN_HAMALERT_CLUSTER,
  SCREEN_PSK_MAP,
  SCREEN_MATRIX_CLOCK
};
ScreenType currentScreen = SCREEN_OFF;  // Ustawiany po wczytaniu preferencji
bool inMenu = false;    // Czy jesteśmy w menu wewnętrznym strony
int menuOption = 0;     // Aktualna opcja w menu (jeśli inMenu == true)
const int DEFAULT_TFT_SWITCH_TIME_SEC = 30;
bool tftAutoSwitchEnabled = false;
int tftAutoSwitchTimeSec = DEFAULT_TFT_SWITCH_TIME_SEC;
unsigned long tftAutoSwitchLastMs = 0;
ScreenType tftAutoSwitchLastScreen = SCREEN_OFF;
unsigned long lastScreenUpdate = 0;
const unsigned long SCREEN_UPDATE_INTERVAL = 100; // Aktualizuj ekran co 100ms
const unsigned long DX_SCREEN_MIN_REDRAW_MS = 5000; // Ogranicz zapis tabeli DX do max 1 raz/5s

// ========== WYGASZACZ EKRANU (Matrix) ==========
const int DEFAULT_SCREEN_SAVER_TIMEOUT_MIN = 5;  // Domyślny czas w minutach
bool screenSaverEnabled = false;                  // Czy wygaszacz włączony
int screenSaverTimeoutMin = DEFAULT_SCREEN_SAVER_TIMEOUT_MIN;  // Czas w minutach
unsigned long screenSaverLastActivityMs = 0;      // Ostatnia aktywność
bool screenSaverActive = false;                   // Czy wygaszacz aktualnie działa
ScreenType screenSaverPrevScreen = SCREEN_OFF;    // Poprzedni ekran przed wygaszaczem
bool screenSaverMenuActive = false;               // Czy jesteśmy w menu wygaszacza
unsigned long lastScreen1UpdateMs = 0;

// Typy wygaszacza ekranu
enum ScreenSaverType {
  SAVER_ANALOG_CLOCK = 0,   // Analogowy zegar
  SAVER_DIGITAL_CLOCK = 1,  // Cyfrowy zegar (stary bouncing)
  SAVER_MATRIX = 2          // Efekt Matrix
};
const char* SAVER_TYPE_NAMES[] = {"ANALOG", "DIGITAL", "MATRIX"};
ScreenSaverType screenSaverType = SAVER_ANALOG_CLOCK;  // Domyślnie analogowy

// ========== QRZ POPUP ==========
bool qrzPopupActive = false;
String qrzPopupCallsign = "";
String qrzPopupGrid = "";
String qrzPopupCountry = "";
String qrzPopupName = "";
String qrzPopupQth = "";
String qrzPopupEmail = "";
float qrzPopupDistance = 0.0;
double qrzPopupLat = 0.0;
double qrzPopupLon = 0.0;
bool qrzPopupHasLatLon = false;
unsigned long qrzPopupFetchedAt = 0;
unsigned long lastScreen3UpdateMs = 0;
unsigned long lastScreen4UpdateMs = 0;
unsigned long lastScreen5UpdateMs = 0;
unsigned long lastScreen7UpdateMs = 0;
unsigned long lastScreen8UpdateMs = 0;
bool screen1HeaderNeedsRedraw = true;

const int TFT_TABLE_TOP = 32;
const int TFT_TABLE_BOTTOM = 320;
const int TFT_TABLE_WIDTH = 460;
const int TFT_TABLE_HEIGHT = TFT_TABLE_BOTTOM - TFT_TABLE_TOP;
// UnlisHunter constants must be visible before touch handling code uses them.
const int UNLIS_CENTER_X = 240;
const int UNLIS_CENTER_Y = 120;
const int UNLIS_OUTER_R = 115; // 2m
const int UNLIS_INNER_R = 60;  // 70cm
const int UNLIS_BTN_SIZE = 100;
const int UNLIS_DRAW_BTN_SIZE = UNLIS_BTN_SIZE / 2;
const int UNLIS_START_X = 0;
const int UNLIS_START_Y = 0;
const int UNLIS_PTT_X = 480 - UNLIS_BTN_SIZE;
const int UNLIS_PTT_Y = 320 - UNLIS_BTN_SIZE;
const int UNLIS_EXIT_X = 0;
const int UNLIS_EXIT_Y = 320 - UNLIS_BTN_SIZE;
const unsigned long UNLIS_FRAME_MS = 40UL;
const float UNLIS_BASE_SCAN_DEG_PER_SEC = 46.0f;
const float UNLIS_ACCEL_PER_CATCH_EARLY = 0.05f;
const float UNLIS_ACCEL_PER_CATCH_LATE = 0.03f;
const float UNLIS_TARGET_LIFE_ROTATIONS = 2.5f;
const unsigned long UNLIS_TARGET_RESPAWN_MIN_MS = 450UL;
const unsigned long UNLIS_TARGET_RESPAWN_MAX_MS = 1200UL;
const unsigned long UNLIS_SECOND_TARGET_DELAY_MS = 60000UL;
const unsigned long UNLIS_SECOND_TARGET_RESPAWN_MIN_MS = 3500UL;
const unsigned long UNLIS_SECOND_TARGET_RESPAWN_MAX_MS = 9500UL;
const unsigned long UNLIS_GREEN_STATION_LIFE_MS = 5000UL;
const unsigned long UNLIS_GREEN_STATION_RESPAWN_MIN_MS = 9000UL;
const unsigned long UNLIS_GREEN_STATION_RESPAWN_MAX_MS = 18000UL;
const unsigned long TABLE_NAV_FOOTER_VISIBLE_MS = 5000UL;
unsigned long tableNavFooterVisibleUntilMs = 0;
#ifndef TFT_TABLE_SPRITE_COLOR_DEPTH
#define TFT_TABLE_SPRITE_COLOR_DEPTH 16
#endif
const uint16_t TFT_TABLE_ALT_ROW_COLOR = 0x0841;
TFT_eSprite sharedTableSprite = TFT_eSprite(&tft);
bool sharedTableSpriteReady = false;
bool sharedTableSpriteInitTried = false;

