Tom50505050/esp32-ham-clock/src/main.cpp
static bool ensureSharedTableSprite() {
  if (tft.usesScaledUi()) {
    return false;
  }
  if (sharedTableSpriteReady) {
    return true;
  }
  if (sharedTableSpriteInitTried) {
    return false;
  }

  sharedTableSpriteInitTried = true;
  sharedTableSprite.setColorDepth(TFT_TABLE_SPRITE_COLOR_DEPTH);
  sharedTableSpriteReady = (sharedTableSprite.createSprite(TFT_TABLE_WIDTH, TFT_TABLE_HEIGHT) != nullptr);
  if (!sharedTableSpriteReady) {
    LOGV_PRINTLN("[TFT] Shared table sprite alloc failed, fallback to direct draw");
    return false;
  }
  return true;
}

static bool isTableFooterScreen(ScreenType screenNum) {
  return (screenNum == SCREEN_DX_CLUSTER ||
          screenNum == SCREEN_POTA_CLUSTER ||
          screenNum == SCREEN_HAMALERT_CLUSTER ||
          screenNum == SCREEN_APRS_IS ||
          screenNum == SCREEN_WEATHER_DSP ||
          screenNum == SCREEN_WEATHER_FORECAST);
}

static bool isTableNavFooterVisible(ScreenType screenNum) {
  return isTableFooterScreen(screenNum) && millis() < tableNavFooterVisibleUntilMs;
}

static int getTableMaxRowsForScreen(ScreenType screenNum) {
  return isTableNavFooterVisible(screenNum) ? 10 : 11;
}

static int getTableBottomForScreen(ScreenType screenNum) {
  return isTableNavFooterVisible(screenNum) ? TFT_TABLE_BOTTOM : 320;
}

extern uint16_t menuThemeColor;

static void drawSwitchScreenFooter() {
  // Strzałki nawigacyjne - duże, blisko krawędzi (takie same na wszystkich ekranach)
  int arrowY = 290;
  int arrowSize = 12;
  tft.fillTriangle(15, arrowY, 15 + arrowSize, arrowY - arrowSize, 15 + arrowSize, arrowY + arrowSize, menuThemeColor);
  tft.fillTriangle(465, arrowY, 465 - arrowSize, arrowY - arrowSize, 465 - arrowSize, arrowY + arrowSize, menuThemeColor);
  tft.setTextColor(0x52AA);
  tft.setTextSize(1);
  tft.setCursor(195, 286);
  tft.print("SWITCH SCREEN");
}

// Ustawienie trybu czasu dla ekranu 1
enum Screen1TimeMode {
  SCREEN1_TIME_UTC = 0,
  SCREEN1_TIME_LOCAL = 1
};
uint8_t screen1TimeMode = SCREEN1_TIME_UTC;

enum TftLang : uint8_t {
  TFT_LANG_PL = 0,
  TFT_LANG_EN = 1
};
uint8_t tftLanguage = TFT_LANG_PL;

enum DxTableSizeMode : uint8_t {
  DX_TABLE_SIZE_NORMAL = 0,
  DX_TABLE_SIZE_ENLARGED = 1
};
uint8_t dxTableSizeMode = DX_TABLE_SIZE_NORMAL;

// Font z polskimi znakami dla daty/dnia tygodnia
#define ROBOTO_FONT10_NAME "/fonts/Inter-Regular10"
#define ROBOTO_FONT10_FILE "/fonts/Inter-Regular10.vlw"
#define ROBOTO_FONT12_NAME "/fonts/Inter-Regular12"
#define ROBOTO_FONT12_FILE "/fonts/Inter-Regular12.vlw"
#define ROBOTO_FONT20_NAME "/fonts/Inter-Regular20"
#define ROBOTO_FONT20_FILE "/fonts/Inter-Regular20.vlw"
#define ROBOTO_FONT24_NAME "/fonts/Inter-Regular24"
#define ROBOTO_FONT24_FILE "/fonts/Inter-Regular24.vlw"

enum TrKey : uint8_t {
  TR_TIME_SHORT = 0,
  TR_CALL_SHORT,
  TR_COUNTRY,
  TR_WAITING_SPOTS,
  TR_WEATHER,
  TR_TEMPERATURE,
  TR_HUMIDITY,
  TR_PRESSURE,
  TR_WIND,
  TR_FORECAST_3H,
  TR_FORECAST_TOMORROW,
  TR_NO_DATA,
  TR_ERROR_PREFIX,
  TR_PAGE,
  TR_TFT_CALIBRATION_HINT,
  TR_TFT_CALIBRATE_BTN,
  TR_ROT_90_RIGHT,
  TR_ROT_90_LEFT,
  TR_DISPLAY_SETTINGS,
  TR_BRIGHTNESS,
  TR_THEME_COLOR,
  TR_HOLD_CAL_HINT,
  TR_SAVE,
  TR_DEFAULT,
  TR_CLOSE,
  TR_LANGUAGE,
  TR_KEY_COUNT
};

static const char* TR_PL[TR_KEY_COUNT] = {
  "Czas",
  "Znak",
  "KRAJ",
  "Oczekiwanie na spoty...",
  "POGODA",
  "TEMPERATURA",
  "WILGOTNOŚĆ",
  "CIŚNIENIE",
  "WIATR",
  "Prognoza na 3 godziny:",
  "Prognoza na jutro:",
  "Brak danych",
  "BŁĄD: ",
  "Strona",
  "Przytrzymaj 5 sek = Kalibracja",
  "TFT Kalibracja",
  "Obrót 90deg w prawo (rot90cw)",
  "Obrót 90deg w lewo (rot90ccw)",
  "USTAWIENIA TFT",
  "JASNOŚĆ:",
  "KOLOR MOTYWU:",
  "Przytrzymaj 3 sek = Kalibracja",
  "ZAPISZ",
  "DOMYŚLNE",
  "ZAMKNIJ",
  "JĘZYK"
};

static const char* TR_EN[TR_KEY_COUNT] = {
  "Time",
  "Call",
  "COUNTRY",
  "Waiting for spots...",
  "WEATHER",
  "TEMPERATURE",
  "HUMIDITY",
  "PRESSURE",
  "WIND",
  "Forecast (3 hours):",
  "Forecast for tomorrow:",
  "No data",
  "ERROR: ",
  "Page",
  "Hold 5 sec anywhere = Calibration:",
  "TFT Calibrate",
  "Rotate 90 deg right (rot90cw)",
  "Rotate 90 deg left (rot90ccw)",
  "DISPLAY SETTINGS",
  "BRIGHTNESS:",
  "THEME COLOR:",
  "Hold 3 sec anywhere = Calibration",
  "SAVE",
  "DEFAULT",
  "CLOSE",
  "LANGUAGE"
};

static const char* tr(TrKey key) {
  uint8_t idx = static_cast<uint8_t>(key);
  if (idx >= TR_KEY_COUNT) {
    return "";
  }
  return (tftLanguage == TFT_LANG_EN) ? TR_EN[idx] : TR_PL[idx];
}

static const char* tftLangToCode(uint8_t lang) {
  return (lang == TFT_LANG_EN) ? "en" : "pl";
}

static uint8_t tftLangFromCode(const String &code) {
  String up = code;
  up.toLowerCase();
  if (up == "en") {
    return TFT_LANG_EN;
  }
  return TFT_LANG_PL;
}

static const char* dxTableSizeToCode(uint8_t mode) {
  return (mode == DX_TABLE_SIZE_ENLARGED) ? "enlarged" : "normal";
}

static uint8_t dxTableSizeFromCode(const String &code) {
  String up = code;
  up.toLowerCase();
  if (up == "enlarged" || up == "large" || up == "big") {
    return DX_TABLE_SIZE_ENLARGED;
  }
  return DX_TABLE_SIZE_NORMAL;
}

static bool isDxTableEnlarged() {
  return dxTableSizeMode == DX_TABLE_SIZE_ENLARGED;
}

static int getDxTableMaxRows() {
  if (!isDxTableEnlarged()) {
    return getTableMaxRowsForScreen(SCREEN_DX_CLUSTER);
  }
  return isTableNavFooterVisible(SCREEN_DX_CLUSTER) ? 6 : 7;
}

static int getPotaTableMaxRows() {
  if (!isDxTableEnlarged()) {
    return getTableMaxRowsForScreen(SCREEN_POTA_CLUSTER);
  }
  return isTableNavFooterVisible(SCREEN_POTA_CLUSTER) ? 6 : 7;
}

static int getHamalertTableMaxRows() {
  if (!isDxTableEnlarged()) {
    return getTableMaxRowsForScreen(SCREEN_HAMALERT_CLUSTER);
  }
  return isTableNavFooterVisible(SCREEN_HAMALERT_CLUSTER) ? 6 : 7;
}

static int getAprsTableMaxRows() {
  if (!isDxTableEnlarged()) {
    return getTableMaxRowsForScreen(SCREEN_APRS_IS);
  }
  return isTableNavFooterVisible(SCREEN_APRS_IS) ? 6 : 7;
}

static uint16_t getAprsCallsignColorForEnlarged(const APRSStation &station) {
  String symbolShort = getAPRSSymbolShort(station);
  if (symbolShort == "HOUSE") return TFT_YELLOW;
  if (symbolShort == "HUMAN") return TFT_BLUE;
  if (symbolShort == "CAR") return TFT_RED;
  return TFT_WHITE;
}
#endif

// Funkcja zamieniająca polskie znaki na ASCII (dla wyświetlacza TFT)
String toAsciiPolish(const String& input) {
  String output = input;
  // Małe litery
  output.replace("ą", "a");
  output.replace("ć", "c");
  output.replace("ę", "e");
  output.replace("ł", "l");
  output.replace("ń", "n");
  output.replace("ó", "o");
  output.replace("ś", "s");
  output.replace("ź", "z");
  output.replace("ż", "z");
  // Duże litery
  output.replace("Ą", "A");
  output.replace("Ć", "C");
  output.replace("Ę", "E");
  output.replace("Ł", "L");
  output.replace("Ń", "N");
  output.replace("Ó", "O");
  output.replace("Ś", "S");
  output.replace("Ź", "Z");
  output.replace("Ż", "Z");
  return output;
}

