Tom50505050/esp32-ham-clock/src/main.cpp
// Kolorystyka motywu menu
#define DEFAULT_MENU_THEME_COLOR 0xFD20
#define DEFAULT_MENU_THEME_HUE 20
uint8_t menuThemeHue = DEFAULT_MENU_THEME_HUE;
uint16_t menuThemeColor = DEFAULT_MENU_THEME_COLOR;

// Filtry ekranu 2 (TFT)
enum Screen2FilterMode {
  FILTER_MODE_ALL = 0,
  FILTER_MODE_CW = 1,
  FILTER_MODE_SSB = 2,
  FILTER_MODE_DIGI = 3
};
Screen2FilterMode screen2FilterMode = FILTER_MODE_ALL;
int screen2FilterBandIndex = 0; // 0 = ALL
const char *SCREEN2_FILTER_BANDS[] = {"ALL", "240m", "80m", "40m", "20m", "17m", "15m", "12m", "10m"};
const int SCREEN2_FILTER_BANDS_COUNT = sizeof(SCREEN2_FILTER_BANDS) / sizeof(SCREEN2_FILTER_BANDS[0]);
const size_t COUNTRY_COL_MAX_LEN = 10;

// Filtry ekranu 7 (POTA)
Screen2FilterMode screen7FilterMode = FILTER_MODE_ALL;
int screen7FilterBandIndex = 0; // 0 = ALL

// Filtry ekranu 8 (HAMALERT)
Screen2FilterMode screen8FilterMode = FILTER_MODE_ALL;
int screen8FilterBandIndex = 0; // 0 = ALL
const char *SCREEN8_FILTER_BANDS[] = {"ALL", "240m", "80m", "40m", "20m", "17m", "15m", "12m", "10m", "VHF", "UHF", "SHF"};
const int SCREEN8_FILTER_BANDS_COUNT = sizeof(SCREEN8_FILTER_BANDS) / sizeof(SCREEN8_FILTER_BANDS[0]);

// Sortowanie ekranu 6 (APRS)
enum Screen6SortMode {
  APRS_SORT_TIME = 0,
  APRS_SORT_CALLSIGN = 1,
  APRS_SORT_DISTANCE = 2
};

enum Screen6ViewMode : uint8_t {
  APRS_VIEW_LIST = 0,
  APRS_VIEW_RADAR = 1
};

Screen6SortMode screen6SortMode = APRS_SORT_TIME;
Screen6ViewMode screen6ViewMode = APRS_VIEW_LIST;
bool screen6MenuBeaconingTemp = true;
bool screen6MenuAprsAlertTemp = true;
bool screen6MenuRangeAlertTemp = true;
bool screen6MenuLedAlertTemp = true;

const int SCREEN6_VIEW_BTN_ICON_X = 294;
const int SCREEN6_VIEW_BTN_ICON_Y = 7;
const int SCREEN6_VIEW_BTN_HIT_X = 276;
const int SCREEN6_VIEW_BTN_HIT_Y = 0;
const int SCREEN6_VIEW_BTN_HIT_W = 44;
const int SCREEN6_VIEW_BTN_HIT_H = 50;
const float SCREEN6_RADAR_ZOOM_MIN = 1.00f;
const float SCREEN6_RADAR_ZOOM_MAX = 3.00f;
const float SCREEN6_RADAR_ZOOM_STEP = 0.25f;
const unsigned long SCREEN6_RADAR_ZOOM_TAP_COOLDOWN_MS = 220UL;
float screen6RadarZoom = 1.00f;
unsigned long screen6RadarLastZoomTapMs = 0;
const unsigned long SCREEN6_RADAR_HINT_DURATION_MS = 3000UL;
unsigned long screen6RadarHintUntilMs = 0;

// Menu jasnosci (wywolywane dlugim przytrzymaniem)
bool brightnessMenuActive = false;
int brightnessMenuValue = 100;
ScreenType brightnessMenuPrevScreen = SCREEN_HAM_CLOCK;
bool brightnessMenuPrevInMenu = false;
uint8_t brightnessMenuPrevThemeHue = DEFAULT_MENU_THEME_HUE;
int brightnessMenuPrevBacklight = TFT_BACKLIGHT;
unsigned long brightnessMenuOpenedMs = 0;
unsigned long brightnessMenuTouchStartMs = 0;
bool brightnessMenuLongPressHandled = false;

bool touchCalActive = false;
uint8_t touchCalStep = 0;
int16_t touchCalRawX1 = 0;
int16_t touchCalRawY1 = 0;
int16_t touchCalRawX2 = 0;
int16_t touchCalRawY2 = 0;
int16_t touchCalRawX3 = 0;
int16_t touchCalRawY3 = 0;
int16_t touchCalRawX4 = 0;
int16_t touchCalRawY4 = 0;
int touchCalNewXMin = TOUCH_X_MIN;
int touchCalNewXMax = TOUCH_X_MAX;
int touchCalNewYMin = TOUCH_Y_MIN;
int touchCalNewYMax = TOUCH_Y_MAX;

// ========== KONFIGURACJA ==========
#define AP_SSID "ESP32-HAM-CLOCK"
#define AP_PASSWORD "1234567890"
#define DEFAULT_CLUSTER_HOST "dxspots.com"
#define DEFAULT_CLUSTER_PORT 7300
#define DEFAULT_POTA_CLUSTER_HOST ""
#define DEFAULT_POTA_CLUSTER_PORT 7300
#define DEFAULT_POTA_FILTER_COMMAND "accept/spot comment POTA"
#define DEFAULT_POTA_API_URL "https://api.pota.app/v1/spots"
#define DEFAULT_HAMALERT_HOST "hamalert.org"
#define DEFAULT_HAMALERT_PORT 7300
#define NTP_SERVER "pool.ntp.org"
#define MAX_SPOTS 50  // Bufor 50 ostatnich spotów
#define MAX_POTA_SPOTS 30  // Bufor 30 ostatnich spotów (TFT pokaże max 10)
#define GMT_OFFSET_SEC 0  // UTC
#define DEFAULT_TIMEZONE_HOURS 1  // UTC+1 dla Polski (zimowy), DST doda +1 latem
#define DEFAULT_CALLSIGN "SWL"
#define DEFAULT_OPENWEBRX_URL "http://okno.ddns.net:8078"
#define PROPAGATION_URL "https://www.hamqsl.com/solarxml.php"
const unsigned long PROPAGATION_FETCH_INTERVAL_MS = 60UL * 60UL * 1000UL; // 60 min
const unsigned long PROPAGATION_FETCH_RETRY_MS = 5UL * 60UL * 1000UL;      // 5 min retry on error
const unsigned long WEATHER_FETCH_INTERVAL_MS = 10UL * 60UL * 1000UL;      // 10 min
const unsigned long WEATHER_FETCH_RETRY_MS = 2UL * 60UL * 1000UL;          // 2 min retry on error
const unsigned long QRZ_LOOKUP_INTERVAL_DEFAULT_MS = 3000;                 // 3s bazowy interwał lookupów
const unsigned long QRZ_LOOKUP_INTERVAL_DX_MS = 2000;                      // 2s na ekranie DX (tak samo jak POTA)
const unsigned long QRZ_LOOKUP_INTERVAL_POTA_MS = 2000;                    // 2s na ekranie POTA
const unsigned long QRZ_RETRY_DELAY_MS = 5000;                             // 5s retry
const unsigned long QRZ_CACHE_TTL_MS = 15UL * 60UL * 1000UL;               // 15 min cache wpisu
const uint8_t QRZ_RETRY_LIMIT = 2;
const int QRZ_QUEUE_SIZE = 20;

// ========== STRUKTURA DANYCH ==========
struct DXSpot {
  String time;        // Czas UTC
  String spotter;     // Stacja zgłaszająca
  String callsign;    // Znak wywoławczy
  float frequency;    // Częstotliwość (kHz - jak w DX Cluster)
  String comment;     // Komentarz
  float distance;     // Odległość (km)
  String country;     // Kraj (z QRZ, jeśli dostępny)
  String name;        // Imię i nazwisko (z QRZ, jeśli dostępne)
  String locator;     // Maidenhead Locator (jeśli dostępny)
  float lat;          // Szerokosc geo (jesli znana)
  float lon;          // Dlugosc geo (jesli znana)
  bool hasLatLon;     // Czy lat/lon jest znane
  String band;        // Pasmo (240m, 80m, 40m, etc.)
  String mode;        // Modulacja (CW, SSB, FT8/FT4)
};

// Struktura dla stacji APRS
struct APRSStation {
  String time;        // Czas UTC (timestamp)
  String callsign;    // Znak wywoławczy nadawcy
  String symbol;      // Symbol APRS (raw)
  String symbolTable; // Table symbol (znak przed /)
  float lat;          // Szerokość geograficzna
  float lon;          // Długość geograficzna
  String comment;     // Komentarz
  float freqMHz;      // Częstotliwość z komentarza (MHz)
  float distance;     // Odległość w km (Haversine)
  bool hasLatLon;     // Czy pozycja jest znana
};

struct AprsWxDecoded {
  bool hasAny = false;
  bool hasWindDir = false;
  int windDirDeg = 0;
  bool hasWindSpeed = false;
  float windSpeedKmh = 0.0f;
  bool hasTempC = false;
  float tempC = 0.0f;
  bool hasHumidity = false;
  int humidityPct = 0;
  bool hasPressure = false;
  float pressureHpa = 0.0f;

  // Starszy ekran APRS weather używa tych nazw pól bezpośrednio.
  int windDir = 0;
  float windSpeed = 0.0f;
  float temp = 0.0f;
  int humidity = 0;
  float pressure = 0.0f;
};

// ========== ZMIENNE GLOBALNE ==========
WebServer* server = nullptr;
Preferences* preferences = nullptr;
WiFiClient telnetClient;
WiFiClient potaTelnetClient;
WiFiClient aprsClient;  // Klient dla APRS-IS

