Tom50505050/esp32-ham-clock/src/main.cpp
struct PropagationData {
  String sfi;
  String kindex;
  String aindex;
  String updated;
  String hfBandLabel[4];
  String hfBandFreq[4];
  String hfBandDay[4];
  String hfBandNight[4];
  bool valid = false;
  String lastError = "";
  unsigned long fetchedAtMs = 0;
};

PropagationData propagationData;
unsigned long lastPropagationFetchMs = 0;
bool lastPropagationFetchOk = true;

struct WeatherData {
  static const uint8_t DETAIL_COLS = WEATHER_DETAIL_COLS;
  String cityName;
  String description;
  String iconCode;  // OWM icon code (e.g., 01d/01n) to detect day/night
  int weatherId = 800; // OpenWeatherMap condition ID (default clear sky)
  float tempC = 0.0f;
  int humidity = 0;
  int pressure = 0;
  float windMs = 0.0f;
  float pm25 = 0.0f;  // PM2.5 w Âµg/mÂł
  float pm10 = 0.0f;  // PM10 w Âµg/mÂł
  // Prognozy
  float forecast3hTempC = 0.0f;
  float forecast3hWindMs = 0.0f;
  String forecast3hDesc;
  bool forecast3hValid = false;
  float forecastNextDayTempC = 0.0f;
  float forecastNextDayWindMs = 0.0f;
  String forecastNextDayDesc;
  bool forecastNextDayValid = false;
  float detailTempC[DETAIL_COLS] = {0, 0, 0, 0, 0};
  int detailHumidity[DETAIL_COLS] = {0, 0, 0, 0, 0};
  float detailWindMs[DETAIL_COLS] = {0, 0, 0, 0, 0};
  int detailWeatherId[DETAIL_COLS] = {800, 800, 800, 800, 800};
  String detailIconCode[DETAIL_COLS];
  bool detailValid[DETAIL_COLS] = {false, false, false, false, false};
  float nightTempC[2] = {0.0f, 0.0f};
  bool nightTempValid[2] = {false, false};
  String updated;
  bool valid = false;
  String lastError = "";
  unsigned long fetchedAtMs = 0;
};

WeatherData weatherData;
unsigned long lastWeatherFetchMs = 0;
bool lastWeatherFetchOk = true;

struct PendingQrzLookup {
  String callsign;
  unsigned long nextTryMs = 0;
  uint8_t attempts = 0;
};

PendingQrzLookup qrzQueue[QRZ_QUEUE_SIZE];
int qrzQueueLen = 0;
unsigned long lastQrzLookupMs = 0;

// Zwraca interwał dla kolejki QRZ zależnie od aktywnego ekranu
unsigned long getQrzLookupIntervalMs() {
#ifdef ENABLE_TFT_DISPLAY
  if (tftInitialized && !inMenu) {
    if (currentScreen == SCREEN_DX_CLUSTER) {
      return QRZ_LOOKUP_INTERVAL_DX_MS;
    }
    if (currentScreen == SCREEN_POTA_CLUSTER) {
      return QRZ_LOOKUP_INTERVAL_POTA_MS;
    }
  }
#endif
  return QRZ_LOOKUP_INTERVAL_DEFAULT_MS;
}

DXSpot spots[MAX_SPOTS];
int spotCount = 0;
DXSpot potaSpots[MAX_POTA_SPOTS];
int potaSpotCount = 0;
DXSpot hamalertSpots[MAX_POTA_SPOTS];
int hamalertSpotCount = 0;
SemaphoreHandle_t dxSpotsMutex = nullptr;

const size_t DX_TIME_MAX_LEN = 24;
const size_t DX_CALLSIGN_MAX_LEN = 16;
const size_t DX_SPOTTER_MAX_LEN = 16;
const size_t DX_COMMENT_MAX_LEN = 96;
const size_t DX_COUNTRY_MAX_LEN = 28;
const size_t DX_NAME_MAX_LEN = 32;
const size_t DX_LOCATOR_MAX_LEN = 8;
const size_t DX_BAND_MAX_LEN = 12;
const size_t DX_MODE_MAX_LEN = 8;

const size_t APRS_TIME_MAX_LEN = 24;
const size_t APRS_CALLSIGN_MAX_LEN = 16;
const size_t APRS_SYMBOL_MAX_LEN = 12;
const size_t APRS_COMMENT_MAX_LEN = 96;

static inline void clampStringLength(String &value, size_t maxLen) {
  if (value.length() > maxLen) {
    value.remove(maxLen);
  }
}

static void compactDxSpotStrings(DXSpot &spot) {
  clampStringLength(spot.time, DX_TIME_MAX_LEN);
  clampStringLength(spot.callsign, DX_CALLSIGN_MAX_LEN);
  clampStringLength(spot.spotter, DX_SPOTTER_MAX_LEN);
  clampStringLength(spot.comment, DX_COMMENT_MAX_LEN);
  clampStringLength(spot.country, DX_COUNTRY_MAX_LEN);
  clampStringLength(spot.name, DX_NAME_MAX_LEN);
  clampStringLength(spot.locator, DX_LOCATOR_MAX_LEN);
  clampStringLength(spot.band, DX_BAND_MAX_LEN);
  clampStringLength(spot.mode, DX_MODE_MAX_LEN);
}

static void compactAprsStationStrings(APRSStation &station) {
  clampStringLength(station.time, APRS_TIME_MAX_LEN);
  clampStringLength(station.callsign, APRS_CALLSIGN_MAX_LEN);
  clampStringLength(station.symbol, APRS_SYMBOL_MAX_LEN);
  clampStringLength(station.symbolTable, APRS_SYMBOL_MAX_LEN);
  clampStringLength(station.comment, APRS_COMMENT_MAX_LEN);
}

static inline void lockDxSpots() {
  if (dxSpotsMutex != nullptr) {
    xSemaphoreTake(dxSpotsMutex, portMAX_DELAY);
  }
}

static inline void unlockDxSpots() {
  if (dxSpotsMutex != nullptr) {
    xSemaphoreGive(dxSpotsMutex);
  }
}

// Forward declarations for timezone conversion
extern int timezoneHours;
bool isEuropeanDST(struct tm *timeinfo);

// Global cache for timezone calculation to avoid repeated time() calls
static int cachedTimezoneOffset = -999;  // -999 means not initialized
static unsigned long lastTimezoneCacheMs = 0;
static const unsigned long TIMEZONE_CACHE_MS = 60000; // Cache for 1 minute

static int getCachedTimezoneOffset() {
  unsigned long nowMs = millis();
  if (cachedTimezoneOffset == -999 || (nowMs - lastTimezoneCacheMs) > TIMEZONE_CACHE_MS) {
    int dstOffset = 0;
    time_t now = time(nullptr);
    if (now > 100000) {
      struct tm utcTm;
      gmtime_r(&now, &utcTm);
      dstOffset = isEuropeanDST(&utcTm) ? 1 : 0;
    }
    cachedTimezoneOffset = timezoneHours + dstOffset;
    lastTimezoneCacheMs = nowMs;
  }
  return cachedTimezoneOffset;
}

String formatSpotUtc(String raw) {
  raw.trim();

  // Obsługa ISO 8601 (np. 2024-12-12T12:34Z)
  int tPos = raw.indexOf('T');
  if (tPos >= 0 && (tPos + 5) <= (int)raw.length()) {
    raw = raw.substring(tPos + 1);
  }

  // Usuń ewentualne końcowe "Z"
  if (raw.endsWith("Z") || raw.endsWith("z")) {
    raw.remove(raw.length() - 1);
  }

  int hour = 0, minute = 0;
  bool parsed = false;
  
  // Jeśli już jest dwukropek, przytnij do HH:MM
  if (raw.length() >= 5 && raw.charAt(2) == ':') {
    hour = raw.substring(0, 2).toInt();
    minute = raw.substring(3, 5).toInt();
    parsed = true;
  } else if (raw.length() >= 4) {
    // Brak dwukropka: spróbuj wstawić między HH a MM (np. "1234" -> "12:34")
    hour = raw.substring(0, 2).toInt();
    minute = raw.substring(2, 4).toInt();
    parsed = true;
  } else if (raw.length() >= 2) {
    // Awaryjnie: tylko godzina
    hour = raw.substring(0, 2).toInt();
    minute = 0;
    parsed = true;
  }
  
