Tom50505050/esp32-ham-clock/src/main.cpp
  if (!parsed) {
    return raw; // Nie udało się sparsować
  }

  // Konwersja na czas lokalny (użyj cache'owanego offsetu)
  int offset = getCachedTimezoneOffset();
  int localHour = hour + offset;
  
  // Obsługa przejścia przez północ
  if (localHour < 0) localHour += 24;
  else if (localHour >= 24) localHour -= 24;
  
  // Formatuj wynik używając statycznego bufora (bez alokacji String)
  char result[6];
  snprintf(result, sizeof(result), "%02d:%02d", localHour, minute);
  return String(result);
}

// POTA API (HTTP)
const unsigned long POTA_API_FETCH_INTERVAL_MS = 180UL * 1000UL; // 180s
unsigned long lastPotaApiFetchMs = 0;

// HAMALERT Telnet
const unsigned long HAMALERT_FETCH_INTERVAL_MS = 60UL * 1000UL; // 60s
unsigned long lastHamalertFetchMs = 0;

// APRS-IS konfiguracja (domyślne wartości)
#define DEFAULT_APRS_IS_HOST "rotate.aprs2.net"
#define DEFAULT_APRS_IS_PORT 14580
#define DEFAULT_APRS_CALLSIGN "nocall"
#define DEFAULT_APRS_PASSCODE 00000
#define DEFAULT_APRS_SSID 0
#define DEFAULT_APRS_FILTER_RADIUS 50  // Promień w km (domyślnie 50, zakres 1-50)
#define MAX_APRS_STATIONS 20  // Maksymalna liczba stacji do wyświetlenia (bufor dla WWW)
#define MAX_APRS_DISPLAY_LCD 11  // Maksymalna liczba stacji na ekranie LCD

// Zmienne konfiguracyjne APRS-IS
String aprsIsHost = DEFAULT_APRS_IS_HOST;
int aprsIsPort = DEFAULT_APRS_IS_PORT;
String aprsCallsign = DEFAULT_APRS_CALLSIGN;
int aprsPasscode = DEFAULT_APRS_PASSCODE;
int aprsSsid = DEFAULT_APRS_SSID;
int aprsFilterRadius = DEFAULT_APRS_FILTER_RADIUS;  // PromieÄąâ€ž w km (0-30)
// Uwaga: APRS uÄąÄ˝ywa wspÄ‚łÄąâ€šrzĂ„â„˘dnych z sekcji "Moja Stacja" (userLat, userLon)


AprsWxDecoded currentWX;
String lastWxStation = "N/A";
const unsigned long APRS_POSITION_FIRST_DELAY_MS = 60UL * 1000UL; // pierwszy beacon po 1 minucie
const char* aprsServer = "rotate.aprs2.net";
const int aprsPort = 14580;
const char* aprsPass = "12345"; // TWÓJ PASSCODE
const char* aprsFilter = "t/m/t/w"; // Filtruj tylko wiadomości i stacje pogodowe (WX)
const int DEFAULT_APRS_INTERVAL_MIN = 29; // kolejne co 29 minut (domyślnie)
const char *NVS_KEY_APRS_INTERVAL_MIN = "aprs_int_min";
const int DEFAULT_APRS_ALERT_MIN_SEC = 300;
const char *NVS_KEY_APRS_ALERT_MIN_SEC = "aprs_alrt_sec";
const int DEFAULT_APRS_ALERT_SCREEN_SEC = 5;
const char *NVS_KEY_APRS_ALERT_SCREEN_SEC = "alrt_scr_s";
const float DEFAULT_APRS_ALERT_DISTANCE_KM = 1.0f;
const char *NVS_KEY_APRS_ALERT_DISTANCE_KM = "alrt_dst_km";
const char *NVS_KEY_APRS_ALERT_WX_ENABLED = "alrt_wx_en";
const bool DEFAULT_ENABLE_LED_ALERT = true;
const int DEFAULT_LED_ALERT_DURATION_MS = 5000;
const int DEFAULT_LED_ALERT_BLINK_MS = 500;
const char *NVS_KEY_ENABLE_LED_ALERT = "led_al_en";
const char *NVS_KEY_LED_ALERT_DURATION_MS = "led_al_dur";
const char *NVS_KEY_LED_ALERT_BLINK_MS = "led_al_blk";
unsigned long aprsPositionIntervalMs = (unsigned long)DEFAULT_APRS_INTERVAL_MIN * 60UL * 1000UL;
unsigned long lastAPRSPositionTxMs = 0;
unsigned long nextAPRSPositionDueMs = 0;
int aprsIntervalMinutes = DEFAULT_APRS_INTERVAL_MIN;
const char DEFAULT_APRS_SYMBOL_TABLE = '/';
const char DEFAULT_APRS_SYMBOL_CODE = '-';
String aprsSymbolTwoChar = "/-";
char aprsSymbolTable = DEFAULT_APRS_SYMBOL_TABLE;
char aprsSymbolCode = DEFAULT_APRS_SYMBOL_CODE;
String aprsUserComment = "";
String aprsAlertCsv = "";
bool aprsAlertEnabled = true;
int aprsAlertMinSeconds = DEFAULT_APRS_ALERT_MIN_SEC;
int aprsAlertScreenSeconds = DEFAULT_APRS_ALERT_SCREEN_SEC;
bool aprsAlertNearbyEnabled = true;
bool aprsAlertWxEnabled = false;
float aprsAlertDistanceKm = DEFAULT_APRS_ALERT_DISTANCE_KM;
bool enableLedAlert = DEFAULT_ENABLE_LED_ALERT;
int ledAlertDurationMs = DEFAULT_LED_ALERT_DURATION_MS;
int ledAlertBlinkMs = DEFAULT_LED_ALERT_BLINK_MS;
int aprsBeaconTxCount = 0;
const char *APRS_POSITION_COMMENT = "https://github.com/SP3KON/ESP32-HAM-CLOCK";
bool aprsBeaconEnabled = true;
const unsigned long APRS_ALERT_FRAME_PULSE_MS = 500UL;
const int APRS_ALERT_CLOSE_BTN_X = 449;
const int APRS_ALERT_CLOSE_BTN_Y = 7;
const int APRS_ALERT_CLOSE_BTN_W = 26;
const int APRS_ALERT_CLOSE_BTN_H = 26;
const int APRS_ALERT_CLOSE_HIT_W = 50;
const int APRS_ALERT_CLOSE_HIT_H = 50;
bool aprsAlertScreenActive = false;
unsigned long aprsAlertScreenUntilMs = 0;
unsigned long aprsAlertFrameLastToggleMs = 0;
bool aprsAlertFramePulseOn = true;
APRSStation aprsAlertScreenStation;
volatile bool aprsAlertDrawPending = false;
APRSStation aprsAlertPendingStation;
portMUX_TYPE aprsAlertPendingMux = portMUX_INITIALIZER_UNLOCKED;

struct AprsAlertCooldownEntry {
  String callsign;
  unsigned long lastAlertMs = 0;
};

AprsAlertCooldownEntry aprsAlertCooldown[MAX_APRS_STATIONS];
int aprsAlertCooldownReplaceIdx = 0;

APRSStation aprsStations[MAX_APRS_STATIONS];
int aprsStationCount = 0;
bool aprsConnected = false;
bool aprsLoginSent = false;
unsigned long lastAPRSAttempt = 0;
unsigned long lastAPRSRxMs = 0;
String aprsBuffer = "";
const unsigned long APRS_INACTIVITY_RECONNECT_MS = 5UL * 60UL * 1000UL; // 5 minut

void parseAPRSWeather(String line) {
  // Szukamy początku danych pogodowych (znak '_')
  int wxIdx = line.indexOf('_');
  if (wxIdx == -1) return;

  // Pobranie znaku stacji (na początku linii przed '>')
  int callEnd = line.indexOf('>');
  if (callEnd != -1) {
    lastWxStation = line.substring(0, callEnd);
  }

  // Wycinanie danych (format APRS jest stały po znaku '_')
  // Przykład: _MMDDHHmmcCCsSSgGGtTTThHHbBBBBB
  String data = line.substring(wxIdx + 1);

  // Kierunek i prędkość wiatru (c...s...)
  if (data.indexOf('c') != -1 && data.indexOf('s') != -1) {
    currentWX.windDir = data.substring(data.indexOf('c')+1, data.indexOf('c')+4).toInt();
    int miph = data.substring(data.indexOf('s')+1, data.indexOf('s')+4).toInt();
    currentWX.windSpeed = miph * 0.44704; // mph -> m/s
  }

  // Temperatura (t...) - w Fahrenheitach
  int tIdx = data.indexOf('t');
  if (tIdx != -1) {
    int tempF = data.substring(tIdx + 1, tIdx + 4).toInt();
    currentWX.temp = (tempF - 32) * 5.0 / 9.0; // F -> C
  }

  // Wilgotność (h...)
  int hIdx = data.indexOf('h');
  if (hIdx != -1) {
    currentWX.humidity = data.substring(hIdx + 1, hIdx + 3).toInt();
  }

