Tom50505050/esp32-ham-clock/src/main.cpp
  // Ciśnienie (b...) - w dziesiątych hPa
  int bIdx = data.indexOf('b');
  if (bIdx != -1) {
    float baro = data.substring(bIdx + 1, bIdx + 6).toFloat();
    currentWX.pressure = baro / 10.0;
  }
  
  Serial.printf("WX od %s: %.1fC, %d%%, %.1f hPa\n", lastWxStation.c_str(), currentWX.temp, currentWX.humidity, currentWX.pressure);
}

void updateAPRS() {
  if (!aprsClient.connected()) {
    if (aprsClient.connect(aprsServer, aprsPort)) {
      String loginCall = aprsCallsign.length() ? aprsCallsign : String(DEFAULT_APRS_CALLSIGN);
      String login = "user " + loginCall + " pass " + String(aprsPasscode) + " vers ESP32HamClock 1.0 filter " + aprsFilter;
      aprsClient.println(login);
    }
    return;
  }

  while (aprsClient.available()) {
    String line = aprsClient.readStringUntil('\n');
    if (line.indexOf("_") != -1 && line.indexOf("t") != -1) {
      parseAPRSWeather(line);
      if (currentScreen == SCREEN_WEATHER_DSP) lastScreenUpdate = 0;
    }
  }
}
void drawWeatherScreen() {
  tft.fillRect(0, 0, 480, 40, 0x03E0); // Ciemnozielony nagłówek
  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(2);
  tft.drawCentreString("APRS WEATHER STATION", 240, 10, 1);

  // 1. Temperatura (Duży odczyt)
  tft.setTextSize(4);
  tft.setTextColor(currentWX.temp > 0 ? TFT_ORANGE : TFT_CYAN);
  String tStr = String(currentWX.temp, 1) + " C";
  tft.drawCentreString(tStr, 240, 70, 1);

  // 2. Pozostałe parametry (Siatka 2x2)
  tft.setTextSize(2);
  tft.setTextColor(TFT_YELLOW);
  
  // Wilgotność
  tft.drawString("HUMIDITY:", 50, 240);
  tft.setTextColor(TFT_WHITE);
  tft.drawString(String(currentWX.humidity) + " %", 200, 240);

  // Ciśnienie
  tft.setTextColor(TFT_YELLOW);
  tft.drawString("BARO:", 280, 240);
  tft.setTextColor(TFT_WHITE);
  tft.drawString(String(currentWX.pressure, 1) + " hPa", 380, 240);

  // Wiatr
  tft.setTextColor(TFT_YELLOW);
  tft.drawString("WIND:", 50, 210);
  tft.setTextColor(TFT_WHITE);
  String wStr = String(currentWX.windSpeed, 1) + " m/s (" + String(currentWX.windDir) + "*)";
  tft.drawString(wStr, 200, 210);

  // 3. Info o stacji
  tft.drawFastHLine(20, 260, 440, TFT_DARKGREY);
  tft.setTextSize(1);
  tft.setTextColor(TFT_LIGHTGREY);
  tft.drawCentreString("Last station: " + lastWxStation, 240, 280, 1);
}

// Konfiguracja WiFi i Cluster
String wifiSSID = "";
String wifiPassword = "";
String wifiSSID2 = "";
String wifiPassword2 = "";
String clusterHost = DEFAULT_CLUSTER_HOST;
int clusterPort = DEFAULT_CLUSTER_PORT;
String potaClusterHost = DEFAULT_POTA_CLUSTER_HOST;
int potaClusterPort = DEFAULT_POTA_CLUSTER_PORT;
String potaFilterCommand = DEFAULT_POTA_FILTER_COMMAND;
String potaApiUrl = DEFAULT_POTA_API_URL;
String hamalertHost = DEFAULT_HAMALERT_HOST;
int hamalertPort = DEFAULT_HAMALERT_PORT;
String hamalertLogin = "";
String hamalertPassword = "";
String userCallsign = "";
String userLocator = "";
double userLat = 0.0;
double userLon = 0.0;
bool userLatLonValid = false;
int timezoneHours = DEFAULT_TIMEZONE_HOURS;
String qrzUsername = "";
String qrzPassword = "";
String qrzStatus = "Callook.info: ready";
String weatherApiKey = "";
String openWebRxUrl = DEFAULT_OPENWEBRX_URL;

// Konfiguracja filtrÄ‚łw CC-Cluster (dxspots.com)
bool clusterNoAnnouncements = true;      // set/noann - wyłącz ogłoszenia
bool clusterNoWWV = true;                // set/nowwv - wyłącz WWV
bool clusterNoWCY = true;                // set/nowcy - wyłącz WCY
bool clusterUseFilters = false;           // Czy używać filtrów (set/filter)
String clusterFilterCommands = "";        // Dodatkowe komendy filtrÄ‚łw (np. "set/filter k,ve/pass")

// Status poÄąâ€šĂ„â€¦czenia
bool wifiConnected = false;
bool telnetConnected = false;
unsigned long lastTelnetAttempt = 0;
unsigned long lastNTPUpdate = 0;
unsigned long lastWiFiReconnectAttempt = 0;
unsigned long lastPotaAttempt = 0;

const uint8_t RGB_LED_RED_PIN = 4;
const uint8_t RGB_LED_GREEN_PIN = 16;
const uint8_t RGB_LED_BLUE_PIN = 17;
const unsigned long RGB_RED_DISCONNECTED_BLINK_MS = 1000UL;
bool rgbLedPrevWifiConnected = false;
unsigned long rgbRedBlinkLastToggleMs = 0;
bool rgbRedBlinkStateOn = false;
bool rgbBlueAprsAlertActive = false;
unsigned long rgbBlueAprsAlertUntilMs = 0;
unsigned long rgbBlueAprsLastToggleMs = 0;
bool rgbBlueAprsStateOn = false;

// ========== KONFIGURACJA PŁYTKI TP4056 I AKUMULATORA 18650 ==========
// Płytka ładowania 5V 1A z modułem TP4056 i ochroną baterii 18650
// - Wejście: 5V (micro USB/USB-C)
// - Wyjście: 4.2V (bateria naładowana) lub 5V (zasilanie zewnętrzne)
// - Pomiar napięcia przez dzielnik 100k/100k na pin ADC

#define BATTERY_MONITORING_ENABLED  // Włącz pomiar napięcia baterii
#define BATTERY_ADC_PIN 34          // Pin ADC1_CH6 (GPIO34) - pomiar napięcia baterii
#define BATTERY_ADC_RESOLUTION 12   // Rozdzielczość ADC (12 bit = 0-4095)
#define BATTERY_VOLTAGE_DIVIDER 2.0f // Dzielnik napięcia 100k/100k (1:2)
#define BATTERY_ADC_VREF 3.3f       // Napięcie referencyjne ADC (3.3V)

// Zakresy napięcia akumulatora 18650 (dla płytki z ochroną DW01A)
#define BATTERY_VOLTAGE_MAX 3.8f      // 100% naładowana (dostosowane do Twojej baterii)
#define BATTERY_VOLTAGE_NOM 3.7f    // 80% nominalna
#define BATTERY_VOLTAGE_LOW 3.5f    // 20% niski poziom (pomarańczowy)
#define BATTERY_VOLTAGE_MIN 3.3f    // 5% krytyczny (czerwony)
#define BATTERY_VOLTAGE_CUTOFF 3.0f // 0% ochrona wyłącza (DW01A)

// Interwały pomiaru i ostrzegania
#define BATTERY_CHECK_INTERVAL_MS 1000UL   // Sprawdzaj co 1 sekundę
#define BATTERY_WARN_INTERVAL_MS 60000UL   // Ostrzegaj co 60 sekund przy niskim poziomie

unsigned long lastBatteryCheckMs = 0;
float batteryVoltage = 0.0f;
int batteryPercentage = 0;
bool batteryLowWarningShown = false;
bool batteryCharging = false;  // Rozpoznawanie ładowania (napięcie > 4.25V)

// Funkcja odczytu napięcia baterii z ADC
float readBatteryVoltage() {
  // Dokładniejszy odczyt - średnia z 8 próbek
  long adcSum = 0;
  const int samples = 8;
  for (int i = 0; i < samples; i++) {
    adcSum += analogRead(BATTERY_ADC_PIN);
    delayMicroseconds(100);
  }
  float adcAvg = adcSum / (float)samples;
  float voltageAtPin = (adcAvg / 4095.0f) * BATTERY_ADC_VREF;
  return voltageAtPin * BATTERY_VOLTAGE_DIVIDER;
}

// Funkcja obliczania procentu naładowania (przybliżona krzywa Li-ion)
int calculateBatteryPercentage(float voltage) {
  if (voltage >= BATTERY_VOLTAGE_MAX) return 100;
  if (voltage <= BATTERY_VOLTAGE_CUTOFF) return 0;
  if (voltage >= BATTERY_VOLTAGE_NOM) {
    // Górna część krzywej (3.7V - 4.2V)
    return (int)(80 + (voltage - BATTERY_VOLTAGE_NOM) / (BATTERY_VOLTAGE_MAX - BATTERY_VOLTAGE_NOM) * 20);
  } else {
    // Dolna część krzywej (3.0V - 3.7V) - nieliniowa
    float factor = (voltage - BATTERY_VOLTAGE_CUTOFF) / (BATTERY_VOLTAGE_NOM - BATTERY_VOLTAGE_CUTOFF);
    return (int)(factor * factor * 80);  // Kwadratowa aproksymacja
  }
}

