Tom50505050/esp32-ham-clock/src/main.cpp
// Sprawdź stan baterii i zwróć true jeśli była aktualizacja
bool updateBatteryStatus() {
  unsigned long now = millis();
  if (now - lastBatteryCheckMs < BATTERY_CHECK_INTERVAL_MS) {
    return false;
  }
  lastBatteryCheckMs = now;
  
  batteryVoltage = readBatteryVoltage();
  batteryPercentage = calculateBatteryPercentage(batteryVoltage);
  
  // Wykrywanie ładowania (napięcie > 4.25V wskazuje na podłączone 5V)
  batteryCharging = (batteryVoltage > 4.25f);
  
  return true;
}

// Zwraca kolor dla poziomu baterii (do wyświetlania na TFT)
uint16_t getBatteryColor() {
  if (batteryCharging) return 0x07E0;  // Zielony podczas ładowania
  if (batteryVoltage <= BATTERY_VOLTAGE_MIN) return TFT_RED;
  if (batteryVoltage <= BATTERY_VOLTAGE_LOW) return 0xFDA0;  // Pomarańczowy
  return 0x07E0;  // Zielony
}

// Funkcja rysująca ikonę baterii na TFT
void drawBatteryIcon(int x, int y, int w, int h) {
  if (!tftInitialized) return;
  
  uint16_t color = getBatteryColor();
  int level = batteryPercentage;
  
  // Obrys baterii
  tft.drawRect(x, y, w, h, TFT_WHITE);
  // Plusik (kontakt) baterii
  tft.fillRect(x + w, y + h/4, 3, h/2, TFT_WHITE);
  
  // Wypełnienie poziomem naładowania
  int fillW = (w - 4) * level / 100;
  if (fillW < 0) fillW = 0;
  if (fillW > w - 4) fillW = w - 4;
  
  tft.fillRect(x + 2, y + 2, fillW, h - 4, color);
  // Wyczyść pozostałą część (gdy poziom spada)
  tft.fillRect(x + 2 + fillW, y + 2, (w - 4) - fillW, h - 4, TFT_BLACK);
}

// Funkcja wyświetlająca status baterii na ekranie (w nagłówku)
void drawBatteryStatus(int x, int y) {
  if (!tftInitialized) return;
  
  // Aktualizuj stan baterii
  updateBatteryStatus();
  
  // Rysuj ikonę baterii (30x16 pikseli)
  drawBatteryIcon(x, y, 30, 14);
  
  // Tekst z procentami i napięciem
  tft.setTextSize(1);
  tft.setTextColor(TFT_WHITE);
  char buf[16];
  snprintf(buf, sizeof(buf), "%d%% %.1fV", batteryPercentage, batteryVoltage);
  tft.setCursor(x + 36, y + 4);
  tft.print(buf);
  
  // Indykator ładowania
  if (batteryCharging) {
    tft.setTextColor(0x07E0);  // Zielony
    tft.setCursor(x + 36, y - 8);
    tft.print("[ładowanie]");
  }
}

// Szybka aktualizacja tylko ikony baterii (bez odświeżania całego nagłówka)
// Używana w loop() aby uniknąć watchdog resetu
void drawBatteryQuickUpdate(bool skipScreenCheck = false) {
  if (!tftInitialized) return;
  if (!skipScreenCheck && (currentScreen != SCREEN_HAM_CLOCK || inMenu)) return;
  if (brightnessMenuActive || screenSaverMenuActive) return;  // Nie rysuj podczas menu
  
  // Sprawdź czy dzielnik jest podłączony
  if (batteryVoltage < 1.5f || batteryVoltage > 5.0f) return;
  
  int x = 8, y = 10, w = 26, h = 12;
  
  // Wyczyść obszar ikony baterii przed narysowaniem (unika pasków/śmieci)
  tft.fillRect(x - 2, y - 2, w + 6, h + 4, TFT_BLACK);
  
  // Rysuj ikonę baterii
  uint16_t color = getBatteryColor();
  int level = batteryPercentage;
  
  tft.drawRect(x, y, w, h, TFT_WHITE);
  tft.fillRect(x + w, y + h/4, 3, h/2, TFT_WHITE);
  
  int fillW = (w - 4) * level / 100;
  if (fillW < 0) fillW = 0;
  if (fillW > w - 4) fillW = w - 4;
  
  tft.fillRect(x + 2, y + 2, fillW, h - 4, color);
  tft.fillRect(x + 2 + fillW, y + 2, (w - 4) - fillW, h - 4, TFT_BLACK);
  
  // Tekst z napięciem i procentem - wyczyść tło przed napisaniem
  tft.fillRect(x + 32, y + 3, 55, 8, TFT_BLACK);  // Wyczyść obszar tekstu
  tft.setTextSize(1);
  tft.setTextColor(TFT_WHITE);
  char batBuf[16];
  snprintf(batBuf, sizeof(batBuf), "%.1fV %d%%", batteryVoltage, batteryPercentage);
  tft.setCursor(x + 32, y + 3);
  tft.print(batBuf);
}

// ========== Restart (np. po zapisaniu konfiguracji)
bool restartRequested = false;
unsigned long restartAtMs = 0;

// Stan sesji DX Cluster (Telnet)
bool clusterLoginSent = false;
bool clusterLoginScheduled = false;
unsigned long clusterSendLoginAtMs = 0;
unsigned long lastClusterKeepAliveMs = 0;
unsigned long lastTelnetRxMs = 0;
const unsigned long TELNET_INACTIVITY_RECONNECT_MS = 5UL * 60UL * 1000UL; // 5 minut

// Stan sesji POTA Cluster (Telnet)
bool potaTelnetConnected = false;
bool potaLoginSent = false;
bool potaLoginScheduled = false;
unsigned long potaSendLoginAtMs = 0;
unsigned long lastPotaKeepAliveMs = 0;
unsigned long lastPotaRxMs = 0;
const unsigned long POTA_TELNET_INACTIVITY_RECONNECT_MS = 5UL * 60UL * 1000UL; // 5 minut

// Bufor dla danych Telnet
String telnetBuffer = "";
String pendingTelnetLine = "";
unsigned long pendingTelnetDropped = 0;

// Bufor dla danych POTA Telnet
String potaTelnetBuffer = "";
String pendingPotaLine = "";
unsigned long pendingPotaDropped = 0;

// QRZ cache (żeby nie pytać w kółko o te same znaki)
struct QrzCacheEntry {
  String callsign;
  String grid;
  String country;
  String name;
  String email;
  String qth;
  float lat;
  float lon;
  bool hasLatLon;
  unsigned long fetchedAtMs;
};
const int QRZ_CACHE_SIZE = 20;
QrzCacheEntry qrzCache[QRZ_CACHE_SIZE];

// Forward declarations
void drawUnlisHunter();
void drawPskMap();

// ========== INICJALIZACJA TFT (ESP32-2432S028) ==========
#ifdef ENABLE_TFT_DISPLAY
void setupBacklightPwm() {
#if (TFT_BL_PIN >= 0)
  pinMode(TFT_BL_PIN, OUTPUT);
  digitalWrite(TFT_BL_PIN, TFT_BL_INVERTED ? LOW : HIGH);
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  // Arduino ESP32 core 3.x LEDC API
  ledcAttach(TFT_BL_PIN, BACKLIGHT_PWM_FREQ, BACKLIGHT_PWM_RES_BITS);
#else
  // Arduino ESP32 core 2.x LEDC API
  ledcSetup(BACKLIGHT_PWM_CHANNEL, BACKLIGHT_PWM_FREQ, BACKLIGHT_PWM_RES_BITS);
  ledcAttachPin(TFT_BL_PIN, BACKLIGHT_PWM_CHANNEL);
#endif
#endif
}

void setBacklightPercent(int percent) {
  if (percent < MIN_BACKLIGHT_PERCENT) percent = MIN_BACKLIGHT_PERCENT;
  if (percent > 100) percent = 100;
  backlightPercent = percent;
#if (TFT_BL_PIN >= 0)
  uint32_t dutyMax = (1U << BACKLIGHT_PWM_RES_BITS) - 1U;
  uint32_t duty = (percent * dutyMax) / 100U;
  if (TFT_BL_INVERTED) {
    duty = dutyMax - duty;
  }
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  ledcWrite(TFT_BL_PIN, duty);
#else
  ledcWrite(BACKLIGHT_PWM_CHANNEL, duty);
#endif
#endif
}

void applyTouchRotation() {
  Serial.print("*** Applying touch.setRotation(");
  Serial.print(touchRotation);
  Serial.println(") ***");
  touch.setRotation(touchRotation);
}

