Tom50505050/esp32-ham-clock/src/main.cpp
void applyTftRotation() {
  Serial.print("*** Applying tft.setRotation(");
  Serial.print(tftRotation);
  Serial.println(") ***");
  tft.setRotation(tftRotation);
}

void applyTftInversion() {
  tftInvertColors = sanitizeTftInvertSetting(tftInvertColors);
  Serial.print("*** Applying tft.invertDisplay(");
  Serial.print(tftInvertColors ? "true" : "false");
  Serial.println(") ***");
  tft.invertDisplay(tftInvertColors);
}

void initTFT() {
  Serial.println("=== Inicjalizacja TFT ===");
  Serial.printf("TFT setup info=%s\n", USER_SETUP_INFO);
  Serial.printf("TFT profile=%s SCLK=%d MOSI=%d MISO=%d CS=%d DC=%d RST=%d BL=%d\n",
                "ILI9488",
                TFT_SCLK, TFT_MOSI, TFT_MISO, TFT_CS, TFT_DC, TFT_RST, TFT_BL_PIN);
  
  // Podświetlenie ustawiamy jawnie, żeby łatwo odróżnić problem BL od problemu SPI/drivera.
  setupBacklightPwm();
  setBacklightPercent(backlightPercent);
  Serial.println("TFT begin()...");
  tft.begin();
  Serial.println("TFT begin() OK");
  
  applyTftRotation();
  applyTftInversion();
  // Dla rotacji 1: szerokości 480, wysokości 320
  tft.fillScreen(TFT_WHITE);

  // Inicjalizacja dotyku (XPT2046, osobny SPI)
  touchSPI.begin(TOUCH_CLK, TOUCH_MISO, TOUCH_MOSI, TOUCH_CS);
  touch.begin(touchSPI);
  applyTouchRotation();
  
  tftInitialized = true;
  inMenu = false;
  menuOption = 0;
  
  Serial.println("=== TFT zainicjalizowany OK ===");
  
  // Wyświetl ekran startowy (boot log)
  drawBootScreen();
  tftBootPrintLine("=== Inicjalizacja TFT ===");
  tftBootPrintLine("TFT begin()...");
  tftBootPrintLine("TFT begin() OK");
  tftBootPrintLine("=== TFT zainicjalizowany OK ===");
}

void drawBootScreen() {
  if (!tftInitialized) {
    return;
  }
  tft.fillScreen(TFT_BLACK);
  tft.setTextColor(TFT_GREEN);
  tft.setTextSize(1);
  bootLogY = 2;
  tft.setCursor(2, bootLogY);
}

void tftBootPrintLine(const String &line) {
  if (!tftInitialized) {
    return;
  }
  tft.setTextColor(TFT_GREEN);
  tft.setTextSize(1);
  tft.setCursor(2, bootLogY);
  tft.print(line);
  bootLogY += BOOT_LOG_LINE_HEIGHT;
  if (bootLogY > 230) {
    tft.fillScreen(TFT_BLACK);
    bootLogY = 2;
  }
}

void drawWelcomeScreenYellow() {
  if (!tftInitialized) {
    return;
  }
  tft.fillScreen(TFT_BLACK);
  tft.setTextSize(2);
  const int centerX = 240;
  const int startY = 60;
  const int lineGap = 30;
  String lines[] = {
    "ESP32-HAM-CLOCK",
    "version 1.2b",
    "Original: SP3KON",
    "Modified by: SP9TNV",
    "License: MIT",
    "sp3kon@gmail.com"
  };
  for (int i = 0; i < 6; i++) {
    int textWidth = tft.textWidth(lines[i]);
    int x = centerX - (textWidth / 2);
    tft.setTextColor(TFT_YELLOW);
    tft.setCursor(x, startY + i * lineGap);
    tft.print(lines[i]);
  }
}

void drawWelcomeScreenGreen() {
  if (!tftInitialized) {
    return;
  }
  tft.fillScreen(TFT_BLACK);
  tft.setTextColor(TFT_GREEN);
  tft.setTextSize(3);
  const int centerX = 240;
  const int startY = 140;
  String line = "FOLLOW THE PROPAGATION...";
  int textWidth = tft.textWidth(line);
  int x = centerX - (textWidth / 2);
  tft.setCursor(x, startY);
  tft.print(line);
}

// Ekran startowy z grafiką SP9TNV
void drawSplashScreen() {
  if (!tftInitialized) {
    return;
  }
  
  tft.fillScreen(TFT_BLACK);
  
  const int centerX = 240;
  
  // Spróbuj załadować plik BMP z różnych lokalizacji
  String splashPath = "";
  bool bmpLoaded = false;
  if (littleFsReady) {
    if (LittleFS.exists("/icon50/splash.bmp")) {
      splashPath = "/icon50/splash.bmp";
    } else if (LittleFS.exists("/data/splash.bmp")) {
      splashPath = "/data/splash.bmp";
    } else if (LittleFS.exists("/splash.bmp")) {
      splashPath = "/splash.bmp";
    }
    
    if (splashPath != "") {
      Serial.println("[Splash] Loading: " + splashPath);
      // Wyczyść obszar obrazu przed załadowaniem (na wypadek gdyby BMP miał inne wymiary)
      tft.fillRect(0, 0, 480, 320, TFT_BLACK);
      bmpLoaded = drawBmpFromFS(splashPath.c_str(), 0, 0);
      if (bmpLoaded) {
        // BMP loaded successfully, skip fallback graphics
        splashPathLoaded = true;
      } else {
        Serial.println("[Splash] BMP load failed, will draw fallback");
        splashPathLoaded = false;
      }
    }
  }
  
  // Fallback - czarny ekran (bez grafiki)
  if (!littleFsReady || splashPath == "" || !LittleFS.exists(splashPath) || !splashPathLoaded) {
    Serial.println("[Splash] No BMP found, showing black screen");
    tft.fillScreen(TFT_BLACK);
  }
  
  // Tekst "Kliknij aby kontynuować"
  tft.setTextSize(1);
  tft.setTextColor(TFT_LIGHTGREY);
  tft.setCursor(centerX - 80, 310);
  tft.print("Kliknij ekran aby kontynuowac...");
}

// Aktualizuj wyÄąâ€şwietlacz z aktualnym adresem IP
void updateTFT_IP() {
  if (!tftInitialized) {
    return;
  }
  
  IPAddress ip;
  String modeStr = "";
  
  // SprawdÄąĹź czy jesteÄąâ€şmy w trybie STA czy AP
  if (wifiConnected && WiFi.status() == WL_CONNECTED) {
    ip = WiFi.localIP();
    modeStr = "WiFi";
  } else if (WiFi.getMode() & WIFI_AP) {
    ip = WiFi.softAPIP();
    modeStr = "AP Mode";
  } else {
    // Brak IP - wyświetl komunikat
    tft.fillRect(10, 40, 300, 20, TFT_WHITE);
    tft.setTextColor(TFT_RED, TFT_WHITE);
    tft.setTextSize(1);
    tft.setCursor(10, 45);
    tft.print("No connection");
    return;
  }
  
  // WyczyÄąâ€şĂ„â€ˇ obszar IP (dla rotacji 1: szerokoÄąâ€şĂ„â€ˇ 480)
  tft.fillRect(10, 40, 300, 20, TFT_BLACK);
  
  // WyÄąâ€şwietl tryb i IP w jednej linii (oszczędność miejsca)
  tft.setTextColor(TFT_BLACK, TFT_WHITE);
  tft.setTextSize(1);
  tft.setCursor(10, 45);
  tft.print(modeStr);
  tft.print(": ");
  
  // Wyświetl IP
  tft.setTextColor(TFT_GREEN, TFT_BLACK);
  tft.print(ip.toString());
}

// Aktualizuj wyÄąâ€şwietlacz z tabelą spotów (podobnie jak na stronie WWW)
void updateTFT_Spots() {
  static unsigned long lastTFTPrint = 0;
  static int tftCallCount = 0;
  tftCallCount++;
  
  if (!tftInitialized) {
    return;
  }
  
  // Print co 10 wywołań (dla debugowania)
  unsigned long now = millis();
  if (now - lastTFTPrint > 10000) { // Co 10 sekund
    Serial.print("[TFT] updateTFT_Spots wywoÄąâ€šane ");
    Serial.print(tftCallCount);
    Serial.print(" razy, spotCount=");
    Serial.println(spotCount);
    lastTFTPrint = now;
    tftCallCount = 0;
  }
  
  // WyczyÄąâ€şĂ„â€ˇ obszar tabeli (zostaw nagÄąâ€šÄ‚łwek i IP)
  // Dla rotacji 1 (krajobraz): szerokoÄąâ€şĂ„â€ˇ 480, wysokoÄąâ€şĂ„â€ˇ 320
  // Zostaw miejsce na nagÄąâ€šÄ‚łwek (0-45) i tabelĂ„â„˘ (65-320)
  tft.fillRect(0, 65, 480, 175, TFT_WHITE);
  
  // WyÄąâ€şwietl nagÄąâ€šÄ‚łwek tabeli
  tft.setTextColor(TFT_BLACK, TFT_WHITE);
  tft.setTextSize(1);
  
  // Nagłówki kolumn (dla szerokoÄąâ€şci 480px)
  int yPos = 65;
  tft.setCursor(5, yPos);
  tft.print(tr(TR_TIME_SHORT));
  tft.setCursor(55, yPos);
  tft.print(tr(TR_CALL_SHORT));
  tft.setCursor(130, yPos);
  tft.print("MHz");
  tft.setCursor(200, yPos);
  tft.print("Mode");
  tft.setCursor(260, yPos);
  tft.print("km");
  
  yPos += 15;
  
  // Wyświetl maksymalnie 10 spotÄ‚łw na wyÄąâ€şwietlaczu TFT (ÄąÄ˝eby zmieścić się na ekranie)
  int maxDisplaySpots = min(spotCount, 10);
  
