Tom50505050/esp32-ham-clock/src/main.cpp
  for (int i = 0; i < maxDisplaySpots; i++) {
    if (yPos >= 230) break; // Nie wchodź poza ekran
    
    // Znak wywoławczy - rozmiar 2 (większy)
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.setTextSize(2);
    tft.setCursor(5, yPos);
    String callStr = spots[i].callsign;
    callStr.toUpperCase();
    if (callStr.length() > 8) callStr = callStr.substring(0, 8);
    tft.print(callStr);
    
    // Częstotliwość (MHz) - rozmiar 2
    tft.setTextColor(TFT_YELLOW, TFT_BLACK);
    tft.setCursor(140, yPos);
    float freqMHz = spots[i].frequency / 1000.0;
    tft.print(freqMHz, 3);
    
    // Mode - rozmiar 2
    tft.setTextColor(TFT_GREEN, TFT_BLACK);
    tft.setCursor(260, yPos);
    String modeStr = spots[i].mode;
    if (modeStr.length() > 4) modeStr = modeStr.substring(0, 4);
    tft.print(modeStr);
    
    // Czas i kraj - rozmiar 1
    tft.setTextSize(1);
    tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
    tft.setCursor(350, yPos + 5);
    String timeStr = spots[i].time;
    if (timeStr.length() > 5) timeStr = timeStr.substring(0, 5);
    tft.print(timeStr);
    
    tft.setTextColor(TFT_ORANGE, TFT_BLACK);
    tft.setCursor(400, yPos + 5);
    String countryText = formatDistanceOrCountry(spots[i], 6);
    tft.print(countryText);
    
    yPos += 20;
  }
  
  // Jeśli brak spotów, wyświetl komunikat
  if (spotCount == 0) {
    tft.setTextColor(TFT_RED, TFT_WHITE);
    tft.setTextSize(1);
    tft.setCursor(10, 90);
    tft.println(tr(TR_WAITING_SPOTS));
  }
}

// ========== SYSTEM MENU I EKRANÄ‚â€śW ==========

extern TaskHandle_t uiTaskHandle;
static void requestUiScreenRedraw(uint8_t pendingScreenId);

// GÄąâ€šÄ‚łwna funkcja rysujĂ„â€¦ca ekrany
void drawScreen(ScreenType screenNum) {
  if (!tftInitialized) {
    return;
  }

  if (uiTaskHandle != nullptr && xTaskGetCurrentTaskHandle() != uiTaskHandle) {
    requestUiScreenRedraw((uint8_t)screenNum);
    return;
  }

  static ScreenType lastDrawnScreen = SCREEN_OFF;
  if (screenNum != lastDrawnScreen) {
    if (isTableFooterScreen(screenNum)) {
      tableNavFooterVisibleUntilMs = millis() + TABLE_NAV_FOOTER_VISIBLE_MS;
    }
    if (screenNum == SCREEN_APRS_RADAR) {
      // On first enter to radar screen, show zoom/info hints for a short time.
      screen6RadarHintUntilMs = millis() + SCREEN6_RADAR_HINT_DURATION_MS;
    }
    lastDrawnScreen = screenNum;
  }

  if (aprsAlertScreenActive) {
    return;
  }
  
  tft.fillScreen(TFT_BLACK);
  
  switch (screenNum) {
    case SCREEN_HAM_CLOCK:
      drawHamClock();
      break;
    case SCREEN_DX_CLUSTER:
      drawDxCluster();
      break;
    case SCREEN_SUN_SPOTS:
      drawSunSpots();
      break;
    case SCREEN_BAND_INFO:
      drawBandInfo();
      break;
    case SCREEN_WEATHER_DSP:
      drawWeather();
      break;
    case SCREEN_WEATHER_FORECAST:
      drawWeatherForecast();
      break;
    case SCREEN_APRS_IS:
      drawAprsIs();
      break;
    case SCREEN_APRS_RADAR:
      drawAprsRadar();
      break;
    case SCREEN_POTA_CLUSTER:
      drawPotaCluster();
      break;
    case SCREEN_HAMALERT_CLUSTER:
      drawHamalertCluster();
      break;
    case SCREEN_MATRIX_CLOCK:
      drawMatrixClock();
      break;
    case SCREEN_UNLIS_HUNTER:
      drawUnlisHunter();
      break;
    case SCREEN_PSK_MAP:
      drawPskMap();
      break;
    case SCREEN_OFF:
    default:
      drawHamClock();
      break;
  }
}

// Ekran 1: Startowy - Info
uint16_t rgb565(uint8_t r, uint8_t g, uint8_t b) {
  return (uint16_t)(((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3));
}

uint16_t colorWheel(uint8_t pos) {
  pos = 255 - pos;
  if (pos < 85) {
    return rgb565(255 - pos * 3, 0, pos * 3);
  }
  if (pos < 170) {
    pos -= 85;
    return rgb565(0, pos * 3, 255 - pos * 3);
  }
  pos -= 170;
  return rgb565(pos * 3, 255 - pos * 3, 0);
}

void applyMenuThemeFromHue() {
  menuThemeColor = colorWheel(menuThemeHue);
}

// Definicja koloru "Radio Orange" - dynamiczny motyw
#define TFT_RADIO_ORANGE menuThemeColor

// Kolory i tÄąâ€šo "Matrix" dla ekranu 10
#define MATRIX_DARKGREEN 0x0480
#define MATRIX_BRIGHTGREEN 0x07E0
#define MATRIX_WHITEGREEN 0xAFE5

uint16_t lerpColor565(uint16_t from, uint16_t to, uint8_t t) {
  uint8_t r1 = (from >> 11) & 0x1F;
  uint8_t g1 = (from >> 5) & 0x3F;
  uint8_t b1 = from & 0x1F;
  uint8_t r2 = (to >> 11) & 0x1F;
  uint8_t g2 = (to >> 5) & 0x3F;
  uint8_t b2 = to & 0x1F;
  uint8_t r = r1 + ((r2 - r1) * t) / 255;
  uint8_t g = g1 + ((g2 - g1) * t) / 255;
  uint8_t b = b1 + ((b2 - b1) * t) / 255;
  return (r << 11) | (g << 5) | b;
}

struct MatrixDrop {
  int x;
  int y;
  int speed;
  int len;
  char headChar;
  bool introParticipates;
  int introStartY;
  int introDelayMs;
  float introSpeedPxPerMs;
  bool introActive;
};

const int SCREEN10_WIDTH = 480;
const int SCREEN10_HEIGHT = 320;
const int MATRIX_COL_SPACING = 7;
const int numDrops = SCREEN10_WIDTH / MATRIX_COL_SPACING; // Tyle kolumn, ile się mieści
const char MATRIX_HEAD_TEXT[] = "ESP32   HAM   CLOCK   by   SP3KON";
const int MATRIX_HEAD_TEXT_LEN = (int)(sizeof(MATRIX_HEAD_TEXT) - 1);
MatrixDrop drops[numDrops];
bool matrixInitialized = false;

static inline char getMatrixHeadCharForColumn(int columnIdx) {
  if (MATRIX_HEAD_TEXT_LEN <= 0) {
    return ' ';
  }
  if (numDrops <= MATRIX_HEAD_TEXT_LEN) {
    return MATRIX_HEAD_TEXT[columnIdx];
  }

  const int freeCols = numDrops - MATRIX_HEAD_TEXT_LEN;
  const int leftPad = freeCols / 2;
  const int rightStart = leftPad + MATRIX_HEAD_TEXT_LEN;

  if (columnIdx < leftPad || columnIdx >= rightStart) {
    return ' ';
  }

  return MATRIX_HEAD_TEXT[columnIdx - leftPad];
}

const int SCREEN10_HEADER_H = 0;
const int SCREEN10_BODY_TOP = 0;  // Pełny ekran matrix
const int SCREEN10_BODY_BOTTOM = 320;
const int SCREEN10_BODY_H = SCREEN10_BODY_BOTTOM - SCREEN10_BODY_TOP;
const int CLOCK_TEXT_SIZE = 6;
const int CLOCK_CHAR_W = 6;
const int CLOCK_CHAR_H = 8;
const unsigned long MATRIX_UPDATE_INTERVAL_MS = 120;
const unsigned long MATRIX_INTRO_ALIGN_MS = 3400UL;

unsigned long lastScreen10UpdateMs = 0;
unsigned long lastMatrixUpdateMs = 0;
bool screen10NeedsRedraw = true;
bool matrixIntroActive = false;
unsigned long matrixIntroStartMs = 0;
int clockMaskX = 0;
int clockMaskY = 0;
int clockMaskW = 0;
int clockMaskH = 0;
String lastClockText = "";
bool clockNeedsRedraw = true;

// ========== WYGASZACZ Z PORUSZAJĄCYM SIĘ ZEGAREM ==========
float bounceClockX = 240;  // Pozycja X zegara (środek ekranu)
float bounceClockY = 160;  // Pozycja Y zegara (środek ekranu)
float bounceClockVX = 2.5; // Prędkość X (piksele na klatkę)
float bounceClockVY = 2.0; // Prędkość Y
const int BOUNCE_CLOCK_TEXT_SIZE = 4;  // Rozmiar tekstu zegara
const int BOUNCE_CLOCK_CHAR_W = 6 * BOUNCE_CLOCK_TEXT_SIZE;  // Szerokość znaku
const int BOUNCE_CLOCK_CHAR_H = 8 * BOUNCE_CLOCK_TEXT_SIZE;   // Wysokość znaku
int bounceClockW = 0;  // Szerokość tekstu zegara (obliczana dynamicznie)
int bounceClockH = BOUNCE_CLOCK_CHAR_H;
uint16_t bounceClockColor = TFT_RADIO_ORANGE;
unsigned long lastBounceClockUpdateMs = 0;
const unsigned long BOUNCE_CLOCK_UPDATE_MS = 16; // ~60 FPS
String lastBounceClockText = "";

// Sprite dla zegara Matrix - eliminuje migotanie
TFT_eSprite clockSprite = TFT_eSprite(&tft);

static void resetMatrixDropRandom(int i) {
  drops[i].y = random(-SCREEN10_BODY_H, 0);
  drops[i].speed = random(5, 15);
  drops[i].len = random(4, 17);
  drops[i].headChar = (char)random(33, 126);
  drops[i].introActive = false;
}

static void prepareMatrixIntro() {
  const int charStep = 8;
  const int alignHeadY = SCREEN10_BODY_TOP + (SCREEN10_BODY_H / 2);

