Tom50505050/esp32-ham-clock/src/main.cpp
  for (int i = 0; i < numDrops; i++) {
    drops[i].headChar = getMatrixHeadCharForColumn(i);
    drops[i].introParticipates = (drops[i].headChar != ' ');
    drops[i].introStartY = random(-140, -40);
    drops[i].introDelayMs = random(0, 1900);
    drops[i].introActive = drops[i].introParticipates;

    int targetDropY = (alignHeadY - SCREEN10_BODY_TOP) - ((drops[i].len - 1) * charStep);
    int travelMs = (int)MATRIX_INTRO_ALIGN_MS - drops[i].introDelayMs;
    if (travelMs < 250) {
      travelMs = 250;
    }

    drops[i].introSpeedPxPerMs = (float)(targetDropY - drops[i].introStartY) / (float)travelMs;
    if (drops[i].introSpeedPxPerMs < 0.03f) {
      drops[i].introSpeedPxPerMs = 0.03f;
    }
  }

  matrixIntroActive = true;
  matrixIntroStartMs = millis();
}

String getUtcTimeString() {
  struct tm timeinfo;
  if (getLocalTime(&timeinfo, 1)) {
    char timeBuffer[9];
    strftime(timeBuffer, 9, "%H:%M:%S", &timeinfo);
    return String(timeBuffer);
  }
  return "--:--:--";
}

// Sprawdza czy obowiązuje czas letni w Europie (ostatnia niedziela marca - ostatnia niedziela października)
bool isEuropeanDST(struct tm *timeinfo) {
  int month = timeinfo->tm_mon + 1;  // 1-12
  int day = timeinfo->tm_mday;       // 1-31
  int wday = timeinfo->tm_wday;      // 0=niedziela
  
  // Styczeń, luty, listopad, grudzień - zima
  if (month < 3 || month > 10) return false;
  // Kwiecień-wrzesień - lato
  if (month > 3 && month < 10) return true;
  
  // Marzec - sprawdź ostatnią niedzielę
  if (month == 3) {
    int lastSunday = 31 - ((31 - day + wday) % 7);
    return day > lastSunday || (day == lastSunday && timeinfo->tm_hour >= 1);
  }
  
  // Październik - sprawdź ostatnią niedzielę
  if (month == 10) {
    int lastSunday = 31 - ((31 - day + wday) % 7);
    return day < lastSunday || (day == lastSunday && timeinfo->tm_hour < 1);
  }
  
  return false;
}

bool getTimeWithTimezone(struct tm *outTm) {
  time_t now = time(nullptr);
  if (now < 100000) {
    return false;
  }
  // Pobierz czas UTC aby sprawdzić DST
  struct tm utcTm;
  gmtime_r(&now, &utcTm);
  int dstOffset = isEuropeanDST(&utcTm) ? 1 : 0;  // +1h w czasie letnim
  now += (time_t)(timezoneHours + dstOffset) * 3600;
  gmtime_r(&now, outTm);
  return true;
}

String getTimezoneTimeString(const char *fmt, size_t bufSize) {
  struct tm timeinfo;
  if (!getTimeWithTimezone(&timeinfo)) {
    return "--:--";
  }
  char timeBuffer[16];
  strftime(timeBuffer, bufSize, fmt, &timeinfo);
  return String(timeBuffer);
}

String formatAprsTimeWithTimezone(String timeStr) {
  if (timeStr.endsWith("Z")) {
    timeStr.remove(timeStr.length() - 1);
  }
  if (timeStr.length() < 4) {
    return timeStr;
  }
  int hour = timeStr.substring(0, 2).toInt();
  int minute = timeStr.substring(2, 4).toInt();
  int hourLocal = hour + timezoneHours;
  while (hourLocal < 0) hourLocal += 24;
  while (hourLocal >= 24) hourLocal -= 24;
  String hh = (hourLocal < 10 ? "0" : "") + String(hourLocal);
  String mm = (minute < 10 ? "0" : "") + String(minute);
  return hh + ":" + mm;
}

String sanitizePolishToAscii(const String &input) {
  String out;
  out.reserve(input.length());
  const char *s = input.c_str();
  size_t len = input.length();
  for (size_t i = 0; i < len; i++) {
    uint8_t c = (uint8_t)s[i];
    if (c < 0x80) {
      out += (char)c;
      continue;
    }
    if (i + 1 >= len) {
      continue;
    }
    uint8_t c2 = (uint8_t)s[i + 1];
    // UTF-8 Polish letters
    if (c == 0xC4 && c2 == 0x84) { out += 'a'; i++; continue; } // Ą
    if (c == 0xC4 && c2 == 0x85) { out += 'a'; i++; continue; } // Ą
    if (c == 0xC4 && c2 == 0x86) { out += 'c'; i++; continue; } // Ć
    if (c == 0xC4 && c2 == 0x87) { out += 'c'; i++; continue; } // Ć
    if (c == 0xC4 && c2 == 0x98) { out += 'e'; i++; continue; } // Ę
    if (c == 0xC4 && c2 == 0x99) { out += 'e'; i++; continue; } // Ę
    if (c == 0xC5 && c2 == 0x81) { out += 'l'; i++; continue; } // Ł
    if (c == 0xC5 && c2 == 0x82) { out += 'l'; i++; continue; } // ł
    if (c == 0xC5 && c2 == 0x83) { out += 'n'; i++; continue; } // Ń
    if (c == 0xC5 && c2 == 0x84) { out += 'n'; i++; continue; } // ń
    if (c == 0xC3 && c2 == 0x93) { out += 'o'; i++; continue; } // Ó
    if (c == 0xC3 && c2 == 0xB3) { out += 'o'; i++; continue; } // ó
    if (c == 0xC5 && c2 == 0x9A) { out += 'S'; i++; continue; } // Ś
    if (c == 0xC5 && c2 == 0x9B) { out += 's'; i++; continue; } // ś
    if (c == 0xC5 && c2 == 0xB9) { out += 'z'; i++; continue; } // Ź
    if (c == 0xC5 && c2 == 0xBA) { out += 'z'; i++; continue; } // ź
    if (c == 0xC5 && c2 == 0xBB) { out += 'z'; i++; continue; } // Ż
    if (c == 0xC5 && c2 == 0xBC) { out += 'z'; i++; continue; } // ż
    // Unknown multibyte - skip
  }
  return out;
}

String getPolishDateStringFull() {
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, 1)) {
    return "Brak daty";
  }

  static const char* weekdaysFull[] = {
    "Niedziela", "Poniedzialek", "Wtorek",
    "Sroda", "Czwartek", "Piatek", "Sobota"
  };

  String dateBuf = String(timeinfo.tm_mday < 10 ? "0" : "") + String(timeinfo.tm_mday) +
                   "." +
                   String((timeinfo.tm_mon + 1) < 10 ? "0" : "") + String(timeinfo.tm_mon + 1) +
                   "." + String(1900 + timeinfo.tm_year);

  String full = String(weekdaysFull[timeinfo.tm_wday]) + " " + dateBuf;
  return full;  // Zwracamy oryginalny tekst z polskimi znakami
}

String getEnglishDateStringFull() {
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, 1)) {
    return "No date";
  }

  static const char* weekdaysFullEn[] = {
    "Sunday", "Monday", "Tuesday", "Wednesday",
    "Thursday", "Friday", "Saturday"
  };

  String dateBuf = String(timeinfo.tm_mday < 10 ? "0" : "") + String(timeinfo.tm_mday) +
                   "." +
                   String((timeinfo.tm_mon + 1) < 10 ? "0" : "") + String(timeinfo.tm_mon + 1) +
                   "." + String(1900 + timeinfo.tm_year);

  String full = String(weekdaysFullEn[timeinfo.tm_wday]) + " " + dateBuf;
  return full;
}

String getPolishDateStringFullWithTimezone() {
  struct tm timeinfo;
  if (!getTimeWithTimezone(&timeinfo)) {
    return "Brak daty";
  }

  static const char* weekdaysFull[] = {
    "Niedziela", "Poniedzialek", "Wtorek",
    "Sroda", "Czwartek", "Piatek", "Sobota"
  };

  String dateBuf = String(timeinfo.tm_mday < 10 ? "0" : "") + String(timeinfo.tm_mday) +
                   "." +
                   String((timeinfo.tm_mon + 1) < 10 ? "0" : "") + String(timeinfo.tm_mon + 1) +
                   "." + String(1900 + timeinfo.tm_year);

  String full = String(weekdaysFull[timeinfo.tm_wday]) + " " + dateBuf;
  return full;  // Zwracamy oryginalny tekst z polskimi znakami
}

String getEnglishDateStringFullWithTimezone() {
  struct tm timeinfo;
  if (!getTimeWithTimezone(&timeinfo)) {
    return "No date";
  }

  static const char* weekdaysFullEn[] = {
    "Sunday", "Monday", "Tuesday", "Wednesday",
    "Thursday", "Friday", "Saturday"
  };

  String dateBuf = String(timeinfo.tm_mday < 10 ? "0" : "") + String(timeinfo.tm_mday) +
                   "." +
                   String((timeinfo.tm_mon + 1) < 10 ? "0" : "") + String(timeinfo.tm_mon + 1) +
                   "." + String(1900 + timeinfo.tm_year);

  String full = String(weekdaysFullEn[timeinfo.tm_wday]) + " " + dateBuf;
  return full;
}

// Funkcja zwracająca imieniny dla danego dnia (polskie imieniny)
String getPolishNameDay() {
  struct tm timeinfo;
  if (!getTimeWithTimezone(&timeinfo)) {
    return "";
  }
  
  // Tablica imienin dla każdego dnia roku (miesiąc 0-11, dzień 1-31)
  // Styczeń
  static const char* nameDays[12][31] = {
    {"Mieszko, Mieczysław", "Izydor, Grzegorz", "Danuta, Genowefa", "Angelika, Aniela", "Edward, Szymon",
     "Kacper, Melchior, Baltazar", "Lucjan, Julian", "Seweryn, Marcin", "Marcelina, Julianna", "Danuta, Piotr",
     "Agata, Małgorzata", "Arkadiusz, Benedykt", "Bogumiła, Wojciech", "Feliks, Nina", "Paweł, Arnold",
     "Marcel, Włodzimierz", "Antoni, Jan", "Małgorzata, Piotr", "Henryk, Marta", "Fabian, Sebastian",
     "Agnieszka, Jarosław", "Anastazy, Wincenty", "Ildefons, Rajmund", "Felicja, Tymoteusz", "Paweł, Michał",
     "Paula, Wanda", "Aniela, Jerzy", "Walery, Karol", "Franciszek, Józef", "Maciej, Martyna",
     "Joanna, Marceli"
    },
    // Luty
    {"Brygida, Ignacy", "Maria, Mirosław", "Błażej, Oskar", "Andrzej, Józef", "Agata, Jakub",
     "Dorota, Paweł", "Ryszard, Teodor", "Hieronim, Sebastian", "Apolonia, Cyryl", "Elwira, Scholastyka",
     "Lucjan, Olgierd", "Eulalia, Radosław", "Grzegorz, Leszek", "Krystyna, Liliana", "Jowita, Faustyn",
     "Danuta, Juliana", "Aleksy, Zbigniew", "Szymon, Konstancja", "Arnold, Konrad", "Leon, Ludomir",
     "Eleonora, Feliks", "Marta, Małgorzata", "Roman, Damian", "Maciej, Marek", "Cezary, Donat",
     "Michał, Tytus", "Aleksander, Gabriel", "Antoni, Romuald", "Baltazar, Kochany", "Marta, Geralda"
    },
    // Marzec
    {"Albina, Antonina", "Helena, Halszka", "Tomasz, Maryna", "Lucja, Kazimierz", "Adrian, Adriana",
     "Róża, Eugeniusz", "Tomasz, Felicyta", "Beatrycze, Wincenty", "Franciszka, Brunon", "Cyprian, Aleksander",
     "Ludwik, Konstantyn", "Grzegorz, Alojzy", "Bożena, Patrycja", "Matylda, Lazarz", "Longin, Klemens",
     "Izabela, Oktawia", "Patryk, Zbigniew", "Cyryl, Edward", "Józef, Bogdan", "Klaudia, Eufemia",
     "Lubomir, Benedykt", "Katarzyna, Bogusław", "Pelagia, Oktawian", "Gabriel, Marek", "Mariola, Więnczysław",
     "Teodor, Olga", "Ernest, Lidia", "Aniela, Sykstus", "Wiktoryna, Jan", "Amelia, Dobromierz",
     "Beniamin, Leon"
    },
    // Kwiecień
    {"Grażyna, Teodor", "Władysław, Franciszek", "Ryszard, Pankracy", "Izydor, Wojciech", "Katarzyna, Irena",
     "Izabela, Wilhelm", "Rufin, Celestyn", "Juliusz, Dionizy", "Maria, Dymitr", "Michał, Makary",
     "Filip, Leon", "Juliusz, Lubosław", "Przemysław, Hermenegild", "Berenika, Tiburcy", "Wiktoryn, Anastazja",
     "Ksenia, Erwin", "Aniceta, Robert", "Alicja, Bogusław", "Waleriana, Tytus", "Czesław, Agnieszka",
     "Anselm, Jarosław", "Kaja, Leon", "Jerzy, Wojciech", "Grzegorz, Paweł", "Erwina, Marek",
     "Marzena, Klaudiusz", "Zygmunt, Florian", "Piotr, Waleria", "Rita, Bogna", "Katarzyna, Marian",
     "Lidia, Trzebomysł"
    },
    // Maj
    {"Józef, Jeremiasz", "Zygmunt, Anatolia", "Maria, Mariola", "Monika, Florian", "Włodzimierz, Iryda",
     "Judyta, Filip", "Benedykt, Gizela", "Stanisław, Lizbona",     "Łukasz, Bożena", "Antonin, Izydor",
     "Iga, Maja", "Joanna, Pankracy", "Glora, Roberta", "Maciej, Bonifacy", "Zofia, Izydora",
     "Jędrzej, Jędrzej", "Brunon, Sławomir", "Aleksandra, Eryk", "Iwa, Piotr", "Bernard, Aleksandra",
     "Jerzy, Jan", "Wiktoria, Julia", "Emilia, Michał", "Joanna, Zuzanna", "Grzegorz, Małgorzata",
     "Filip, Paulina", "Augustyn, Julian", "Jaromir, Justyna", "Magdalena, Zdisława", "Ferdynand, Karolina",
     "Aniela, Petronela"
    },
    // Czerwiec
    {"Justyn, Konrad", "Erazm, Marzenna", "Leszek, Tamara", "Katarzyna, Franciszek", "Walter, Bonifacy",
     "Natalia, Saba", "Antoni, Robert", "Maksym, Seweryn", "Feliks, Pelagia", "Bogdan, Małgorzata",
     "Barnaba, Radomił", "Janina, Jan", "Antoni, Lucylla", "Eliza, Walenty", "Witold, Jolanta",
     "Alina, Benon", "Albert, Ignacy", "Marek, Elżbieta", "Gerwazy, Protazy", "Dina, Bogna",
     "Alicja, Alojzy", "Paulina, Tomasz", "Wanda, Zenon", "Jan, Danuta", "Władysław, Dorota",
     "Piotr, Paweł", "Maryla, Władysława", "Leon, Ireneusz", "Piotr, Paweł", "Emilia, Lucyna",
     "Oktawia, Oktawian"
    },
    // Lipiec
    {"Halina, Marian", "Jagoda, Maria", "Anatol, Tomasz", "Elżbieta, Odon", "Antoni, Maria",
     "Dominika, Gotard", "Cyryl, Metody", "Edgar, Elżbieta", "Łucjan, Weronika", "Sylwia, Witalis",
     "Olga, Kalina", "Jan, Brunon", "Henryk, Kinga", "Bonawentura, Kamil", "Dawid, Henryk",
     "Eustachy, Maria", "Aneta, Bogdan", "Emil, Erwin", "Wincenty, Wodzisław", "Czesław, Eliasz",
     "Piotr, Wiktor", "Magdalena, Władysława", "Ilona, Stefan", "Kinga, Krystyna", "Walentyna, Krzysztof",
     "Anna, Mirosława", "Aurelia, Malwina", "Lilia, Innocenty", "Olaf, Marta", "Julita, Ludmiła",
     "Ignacy, Lubomir"
    },
    // Sierpień
    {"Nadzieja, Piotr", "Karina, Gustaw", "Lidia, Nikodem", "Dominik, Protus", "Emil, Karol",
     "Sławomir, Jan", "Kajetan, Albert", "Cyprian, Emiliana", "Roman, Ryszard", "Borys, Wawrzyniec",
     "Klara, Zuzanna", "Lech, Euzebiusz", "Hildegarda, Diana", "Alfred, Euzebiusz", "Maria, Napoleon",
     "Roch, Stefan", "Anita, Eliza", "Klara, Helena",     "Jan, Bolesław", "Bernard, Samuel",
     "Joanna, Franciszek", "Maria, Cezary", "Róża, Apolinary", "Jerzy, Bartosz", "Luiza, Ludwik",
     "Maria, Zefiryn", "Józef, Klaudiusz", "Patrycja, Wyszomir", "Beata, Jan", "Róża, Szczęsny",
     "Ramona, Rajmund"
    },
    // Wrzesień
    {"Ida, Bronisław", "Stefan, Wilhelm", "Grzegorz, Izabela", "Ida, Julian", "Dorota, Wawrzyniec",
     "Beata, Eugeniusz", "Regina, Melchior", "Mariam, Adriana", "Piotr, Sergiusz", "Elżbieta, Gordian",
     "Jacek, Protus", "Gwido, Maria", "Eugenia, Aureliusz", "Bernard, Roksana", "Albin, Nikodem",
     "Edyta, Kornel", "Franciszek, Hildegarda", "Irma, Stanisław", "Jan, Konstancja", "Filipina, Eustachy",
     "Jonasz, Mateusz", "Tomasz, Maurycy", "Tekla, Bogusław", "Gerard, Herman", "Aurelia, Ladysław",
     "Władysław, Ewa", "Damian, Kosma", "Wacław, Laurencjusz", "Michał, Rafał, Gabriela", "Hieronim, Remigiusz"
    },
    // Październik
    {"Danuta, Remigiusz", "Teofil, Dionizy", "Teresa, Heliodor", "Edwin, Franciszek", "Igor, Placyd",
     "Artur, Brunon", "Maria, Marek", "Pelagia, Brygida", "Arnold, Dionizy", "Paulina, Franciszek",
     "Emil, Aldona", "Maksymilian, Eustachy", "Edward, Gerald", "Łukasz, Manfred", "Teresa, Jadwiga",
     "Gall, Florian", "Ignacy, Rudolfa", "Łukasz, Julian", "Ziemowit, Jadwiga", "Irena, Jan",
     "Urszula, Hilaria", "Filip, Marek", "Marlena, Seweryn", "Rafał, Marcin", "Beata, Daria",
     "Łucjan, Ewaryst", "Iwona, Sabina", "Szymon, Juda", "Euzebia, Wioletta", "Zenobia, Przemysław",
     "Urbain, Saturnin"
    },
    // Listopad
    {"Seweryn, Wiktoryna", "Bohdan, Bożydar", "Sylwia, Marcin", "Karol, Wiktor", "Elżbieta, Zachariasz",
     "Feliks, Leonard", "Antoni, Ernest", "Seweryn, Bogdan", "Aleksander, Ludwik", "Lena, Marcin",
     "Szczęsny, Leon", "Marcin, Witold", "Mikołaj, Stanisław", "Emilian, Wawrzyniec", "Albert, Leopold",
     "Gertruda, Edmund", "Grzegorz, Salomea", "Klaudyna, Karolina", "Elżbieta, Seweryn", "Anatol, Rafał",
     "Albertina, Janusz", "Cecylia, Felicyta", "Adela, Klemens", "Flora, Emma", "Katarzyna, Erazm",
     "Delfina, Sylwester", "Wirgiliusz, Walery", "Jakub, Zdzisław", "Fryderyk, Zygmunt", "Andrzej, Seweryn",
     ""
    },
    // Grudzień
    {"Eligiusz, Natalia", "Bibiana, Balbina", "Franciszek, Ksawery", "Barbara, Krystian", "Norbert, Wawrzyniec",
     "Jadwiga, Jan", "Marcin, Ambroży", "Maria, Świętosława", "Wiesław, Leokadia", "Daniel, Bogdan",
     "Damaszek, Waldemar", "Dagmara, Aleksandra", "Łucja, Otylia", "Alfred, Izydor", "Nina, Celina",
     "Albina, Olimpia", "Lazarz, Florian", "Gracjan, Bogusław", "Michał, Dariusz", "Bogumiła, Dominik",
     "Tomisław, Honorata", "Zenon, Honorata", "Wiktor, Seweryn", "Ewa, Adam", "Anastazja, Eugenia",
     "Dionizy, Szczepan", "Jan, Zenobiusz", "Teofila, Godzisław", "Marta, Tomasz", "Rainer, Eugeniusz",
     "Sylwester, Melania"
    }
  };
  
  int month = timeinfo.tm_mon;  // 0-11
  int day = timeinfo.tm_mday - 1;  // 0-30
  
  if (month >= 0 && month < 12 && day >= 0 && day < 31) {
    String nameDay = nameDays[month][day];
    if (nameDay.length() > 0) {
      return String("Imieniny: ") + nameDay;
    }
  }
  return "";
}

// Rysuje linię daty/tygodnia wyśrodkowaną - zaktualizowana dla 480x320
void drawDateLine(const String &dateText) {
  const int screenW = 480;
  const int timeY = 130;  // Taka sama jak w drawHamClock
  const int dateY = timeY + 65;  // Taka sama jak w drawHamClock

  // Czyść obszar daty (szeroki prostokąt na całej szerokości)
  tft.fillRect(30, dateY - 2, 420, 24, TFT_BLACK);
  
  // Rysuj datę wyśrodkowaną - POWIĘKSZONA (TextSize 3 jak w drawHamClock)
  tft.setTextSize(3);
  tft.setTextColor(TFT_WHITE);
  int dateWidth = dateText.length() * 18; // ~18px na znak przy TextSize 3
  int dateX = (screenW - dateWidth) / 2;
  tft.setCursor(dateX > 10 ? dateX : 10, dateY);
  tft.print(dateText);
}

// Funkcja rysująca paski sygnału WiFi (belki jak w telefonie)
// x, y - pozycja lewego górnego rogu
// strength - siła sygnału 0-4 (0=brak, 4=max)
void drawWifiSignalBars(int x, int y, int strength = -1) {
  // Automatyczna detekcja siły sygnału jeśli nie podano
  if (strength < 0) {
    if (!wifiConnected || WiFi.status() != WL_CONNECTED) {
      strength = 0;
    } else {
      int rssi = WiFi.RSSI();
      if (rssi > -50) strength = 4;
      else if (rssi > -60) strength = 3;
      else if (rssi > -70) strength = 2;
      else if (rssi > -80) strength = 1;
      else strength = 0;
    }
  }
  
