Tom50505050/esp32-ham-clock/src/main.cpp
  // Kolory: zielony gdy jest zasięg, czerwony gdy brak zasięgu
  uint16_t activeColor = TFT_GREEN;   // Zasięg dostępny
  uint16_t noSignalColor = TFT_RED;   // Brak zasięgu
  uint16_t emptyColor = TFT_DARKGREY; // Puste belki (gdy jest sygnał, ale nie max)
  
  // 4 belki o rosnącej wysokości (jak w telefonie)
  // Belka 1 (najniższa)
  if (strength >= 1) {
    tft.fillRect(x, y + 12, 6, 4, activeColor);
  } else if (strength == 0) {
    tft.fillRect(x, y + 12, 6, 4, noSignalColor); // Czerwona gdy brak sygnału
  } else {
    tft.drawRect(x, y + 12, 6, 4, emptyColor);
  }
  
  // Belka 2
  if (strength >= 2) {
    tft.fillRect(x + 8, y + 8, 6, 8, activeColor);
  } else if (strength == 0) {
    tft.fillRect(x + 8, y + 8, 6, 8, noSignalColor);
  } else {
    tft.drawRect(x + 8, y + 8, 6, 8, emptyColor);
  }
  
  // Belka 3
  if (strength >= 3) {
    tft.fillRect(x + 16, y + 4, 6, 12, activeColor);
  } else if (strength == 0) {
    tft.fillRect(x + 16, y + 4, 6, 12, noSignalColor);
  } else {
    tft.drawRect(x + 16, y + 4, 6, 12, emptyColor);
  }
  
  // Belka 4 (najwyższa)
  if (strength >= 4) {
    tft.fillRect(x + 24, y, 6, 16, activeColor);
  } else if (strength == 0) {
    tft.fillRect(x + 24, y, 6, 16, noSignalColor);
  } else {
    tft.drawRect(x + 24, y, 6, 16, emptyColor);
  }
}

void updateScreen1HeaderClock() {
  if (!tftInitialized || currentScreen != SCREEN_HAM_CLOCK || inMenu) {
    return;
  }

  const int screenW = 480;
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, 1)) {
    return;
  }

  static char lastTimeBuffer[6] = "";
  char timeBuffer[6];
  strftime(timeBuffer, 6, "%H:%M", &timeinfo);
  
  // Aktualizuj tylko jeśli czas się zmienił
  if (strcmp(timeBuffer, lastTimeBuffer) == 0) {
    return;
  }
  strcpy(lastTimeBuffer, timeBuffer);
  
  String timeStr = String(timeBuffer);
  tft.setTextSize(2);
  int timeWidth = tft.textWidth(timeStr);
  int timeX = screenW - 50 - timeWidth; // Lewo od ikony WiFi
  int timeY = 12;
  
  // Wyczyść tło pod zegarem
  tft.fillRect(timeX - 2, timeY - 2, timeWidth + 4, 20, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);
  tft.setCursor(timeX, timeY);
  tft.print(timeStr);
}

void updateDxClusterClock() {
  if (!tftInitialized || currentScreen != SCREEN_DX_CLUSTER || inMenu) {
    return;
  }

  struct tm timeinfo;
  if (!getTimeWithTimezone(&timeinfo)) {
    return;
  }

  static char lastTimeBuffer[6] = "";
  char timeBuffer[6];
  strftime(timeBuffer, 6, "%H:%M", &timeinfo);

  if (strcmp(timeBuffer, lastTimeBuffer) == 0) {
    return;
  }
  strcpy(lastTimeBuffer, timeBuffer);

  tft.fillRect(400, 0, 80, 32, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  int timeWidth = tft.textWidth(timeBuffer);
  tft.setCursor(460 - timeWidth, 8);
  tft.print(timeBuffer);
}

void updateWeatherClock() {
  if (!tftInitialized || currentScreen != SCREEN_WEATHER_DSP || inMenu) {
    return;
  }

  struct tm timeinfo;
  if (!getTimeWithTimezone(&timeinfo)) {
    return;
  }

  static char lastTimeBuffer[6] = "";
  char timeBuffer[6];
  strftime(timeBuffer, 6, "%H:%M", &timeinfo);

  if (strcmp(timeBuffer, lastTimeBuffer) == 0) {
    return;
  }
  strcpy(lastTimeBuffer, timeBuffer);

  tft.fillRect(400, 0, 80, 32, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  int timeWidth = tft.textWidth(timeBuffer);
  tft.setCursor(460 - timeWidth, 8);
  tft.print(timeBuffer);
}

void updateWeatherForecastClock() {
  if (!tftInitialized || currentScreen != SCREEN_WEATHER_FORECAST || inMenu) {
    return;
  }

  struct tm timeinfo;
  if (!getTimeWithTimezone(&timeinfo)) {
    return;
  }

  static char lastTimeBuffer[6] = "";
  char timeBuffer[6];
  strftime(timeBuffer, 6, "%H:%M", &timeinfo);

  if (strcmp(timeBuffer, lastTimeBuffer) == 0) {
    return;
  }
  strcpy(lastTimeBuffer, timeBuffer);

  tft.fillRect(400, 0, 80, 32, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  int timeWidth = tft.textWidth(timeBuffer);
  tft.setCursor(460 - timeWidth, 8);
  tft.print(timeBuffer);
}

void updateBandInfoClock() {
  if (!tftInitialized || currentScreen != SCREEN_BAND_INFO || inMenu) {
    return;
  }

  struct tm timeinfo;
  if (!getTimeWithTimezone(&timeinfo)) {
    return;
  }

  static char lastTimeBuffer[6] = "";
  char timeBuffer[6];
  strftime(timeBuffer, 6, "%H:%M", &timeinfo);

  if (strcmp(timeBuffer, lastTimeBuffer) == 0) {
    return;
  }
  strcpy(lastTimeBuffer, timeBuffer);

  tft.fillRect(400, 0, 80, 32, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  int timeWidth = tft.textWidth(timeBuffer);
  tft.setCursor(460 - timeWidth, 8);
  tft.print(timeBuffer);
}

void updateHamalertClock() {
  if (!tftInitialized || currentScreen != SCREEN_HAMALERT_CLUSTER || inMenu) {
    return;
  }

  struct tm timeinfo;
  if (!getTimeWithTimezone(&timeinfo)) {
    return;
  }

  static char lastTimeBuffer[6] = "";
  char timeBuffer[6];
  strftime(timeBuffer, 6, "%H:%M", &timeinfo);

  if (strcmp(timeBuffer, lastTimeBuffer) == 0) {
    return;
  }
  strcpy(lastTimeBuffer, timeBuffer);

  tft.fillRect(400, 0, 80, 32, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  int timeWidth = tft.textWidth(timeBuffer);
  tft.setCursor(460 - timeWidth, 8);
  tft.print(timeBuffer);
}

void updatePotaClusterClock() {
  if (!tftInitialized || currentScreen != SCREEN_POTA_CLUSTER || inMenu) {
    return;
  }

  struct tm timeinfo;
  if (!getTimeWithTimezone(&timeinfo)) {
    return;
  }

  static char lastTimeBuffer[6] = "";
  char timeBuffer[6];
  strftime(timeBuffer, 6, "%H:%M", &timeinfo);

  if (strcmp(timeBuffer, lastTimeBuffer) == 0) {
    return;
  }
  strcpy(lastTimeBuffer, timeBuffer);

  tft.fillRect(400, 0, 80, 32, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  int timeWidth = tft.textWidth(timeBuffer);
  tft.setCursor(460 - timeWidth, 8);
  tft.print(timeBuffer);
}

void updateScreen1Header() {
  if (!tftInitialized || currentScreen != SCREEN_HAM_CLOCK || inMenu) {
    return;
  }

  if (!screen1HeaderNeedsRedraw) {
    return;
  }

  const int headerY = 0;
  const int headerH = 40;
  const int screenW = 480;
  
