Tom50505050/esp32-ham-clock/src/main.cpp
  // 1. TŁO I RAMKA LOGO
  tft.fillRect(0, headerY, screenW, headerH, TFT_RADIO_ORANGE);
  // Ciemniejsza krawędź na dole dla efektu 3D
  tft.drawFastHLine(0, headerH - 1, screenW, 0x8410); 

  // 2. FORMATOWANIE "LOGO" - "ESP32" w czarnej obwódce, "-HAM-CLOCK" normalnie
  String logoPart1 = "ESP32";
  String logoPart2 = "-HAM-CLOCK";
  tft.setTextSize(2);
  int charW = 12; // ~12px na znak przy TextSize 2
  int textH = 16; // ~16px wysokość tekstu przy TextSize 2
  
  // Szerokości części napisu
  int part1W = logoPart1.length() * charW;
  int part2W = logoPart2.length() * charW;
  int totalW = part1W + part2W;
  int startX = (screenW - totalW) / 2;
  int textY = 12;
  int paddingX = 6;  // Odstęp poziomy w obwódce
  int paddingY = 3;  // Odstęp pionowy w obwódce
  
  // Czarna obwódka tylko dla "ESP32"
  tft.fillRect(startX - paddingX, textY - paddingY, 
               part1W + (2 * paddingX), textH + (2 * paddingY), 
               TFT_BLACK);
  
  // "ESP32" w kolorze pomarańczowym (kolor paska)
  tft.setTextColor(TFT_RADIO_ORANGE);
  tft.setCursor(startX, textY);
  tft.print(logoPart1);
  
  // "-HAM-CLOCK" w kolorze czarnym (tak jak było)
  tft.setTextColor(TFT_BLACK);
  tft.setCursor(startX + part1W, textY);
  tft.print(logoPart2);

  // 3. IKONA WiFi W PRAWYM GÓRNYM ROGU - BELKI JAK W TELEFONIE
  drawWifiSignalBars(screenW - 45, 8);

  // 4. ZEGAR W PRAWYM GÓRNYM ROGU NAGŁÓWKA
  struct tm timeinfo;
  if (getLocalTime(&timeinfo, 1)) {
    char timeBuffer[6];
    strftime(timeBuffer, 6, "%H:%M", &timeinfo);
    String timeStr = String(timeBuffer);
    tft.setTextSize(2);
    int timeWidth = tft.textWidth(timeStr);
    int timeX = screenW - 50 - timeWidth; // Lewo od ikony WiFi
    int timeY = 12;
    // Wyczyść tło pod zegarem
    tft.fillRect(timeX - 2, timeY - 2, timeWidth + 4, 20, TFT_RADIO_ORANGE);
    tft.setTextColor(TFT_BLACK);
    tft.setCursor(timeX, timeY);
    tft.print(timeStr);
  }

  screen1HeaderNeedsRedraw = false;
}

void drawHamClock() {
  // Ciemne tło - profesjonalny wygląd i mniejsze zmęczenie oczu
  tft.fillScreen(TFT_BLACK);
  screen1HeaderNeedsRedraw = true;
  
  const int screenW = 480;
  const int screenH = 320;
  
  // 1. NAGŁÓWEK - Pomarańczowa belka z wyśrodkowanym napisem i ikoną WiFi
  updateScreen1Header();

  // 2. RAMKA WOKÓŁ ZNAKU, ZEGARA I DATY - powiększona
  int clockFrameX = 30;     // Odstęp od lewej
  int clockFrameW = 420;    // Szerokość ramki (szersza)
  int clockFrameY = 45;     // Góra ramki
  int clockFrameH = 220;    // Wysokość ramki (powiększona dla większego zegara i imienin)
  tft.drawRoundRect(clockFrameX, clockFrameY, clockFrameW, clockFrameH, 10, TFT_DARKGREY);

  // 3. CALLSIGN - Wyśrodkowany w ramce (dokładne obliczenia)
  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(5);
  String callsign = (userCallsign.length() > 0) ? userCallsign : DEFAULT_CALLSIGN;
  callsign.toUpperCase();
  int callWidth = tft.textWidth(callsign);
  int callX = (screenW - callWidth) / 2;
  int callY = 55;
  tft.setCursor(max(10, callX), callY);
  tft.print(callsign);

  // Napis "OPERATOR STATION" - pod callsign (wyśrodkowany)
  tft.setTextSize(1);
  tft.setTextColor(TFT_RADIO_ORANGE);
  String opText = "OPERATOR STATION";
  int opWidth = tft.textWidth(opText);
  int opX = (screenW - opWidth) / 2;
  tft.setCursor(opX, callY + 40);
  tft.print(opText);

  // 4. ZEGAR - Dokładnie wyśrodkowany
  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(7);
  String timeStr = (screen1TimeMode == SCREEN1_TIME_LOCAL)
                     ? getTimezoneTimeString("%H:%M:%S", 9)
                     : getUtcTimeString();
  int timeWidth = tft.textWidth(timeStr);
  int timeX = (screenW - timeWidth) / 2;
  int timeY = 130;
  tft.setCursor(max(10, timeX), timeY);
  tft.print(timeStr);

  // Etykieta czasu (UTC/Local)
  tft.setTextSize(1);
  const char *timeLabel = "UTC";
  if (screen1TimeMode == SCREEN1_TIME_LOCAL) {
    timeLabel = (tftLanguage == TFT_LANG_EN) ? "Local Time" : "Czas Lokalny";
  }
  int labelWidth = tft.textWidth(timeLabel);
  int labelX = (screenW - labelWidth) / 2;
  tft.setTextColor(TFT_LIGHTGREY);
  tft.setCursor(labelX, timeY + 50);
  tft.print(timeLabel);

  // 5. DATA - Dokładnie wyśrodkowana
  String dateText;
  if (screen1TimeMode == SCREEN1_TIME_LOCAL) {
    dateText = (tftLanguage == TFT_LANG_EN)
                 ? getEnglishDateStringFullWithTimezone()
                 : getPolishDateStringFullWithTimezone();
  } else {
    dateText = (tftLanguage == TFT_LANG_EN)
                 ? getEnglishDateStringFull()
                 : getPolishDateStringFull();
  }
  
  // Data - używamy fontu VLW jeśli dostępny, inaczej standardowy
  int dateY = timeY + 65;  // Pozycja Y daty - używana też w imieninach
  if (littleFsReady && LittleFS.exists(ROBOTO_FONT20_FILE)) {
    tft.loadFont(ROBOTO_FONT20_NAME, LittleFS);
    tft.setTextColor(TFT_WHITE);
    int dateWidth = tft.textWidth(dateText);
    int dateX = (screenW - dateWidth) / 2;
    tft.setCursor(max(10, dateX), dateY);
    tft.print(dateText);
    tft.unloadFont();
  } else {
    tft.setTextSize(3);
    tft.setTextColor(TFT_WHITE);
    int dateWidth = tft.textWidth(sanitizePolishToAscii(dateText));
    int dateX = (screenW - dateWidth) / 2;
    tft.setCursor(max(10, dateX), dateY);
    tft.print(sanitizePolishToAscii(dateText));
  }

  // 6. IMIENINY - pod datą (tylko dla języka polskiego lub domyślnie)
  if (tftLanguage != TFT_LANG_EN) {
    String nameDayText = getPolishNameDay();
    if (nameDayText.length() > 0) {
      int nameDayY = dateY + 35;  // Pozycja pod datą
      
      // Używamy fontu VLW jeśli dostępny (obsługuje polskie znaki)
      if (littleFsReady && LittleFS.exists(ROBOTO_FONT12_FILE)) {
        tft.loadFont(ROBOTO_FONT12_NAME, LittleFS);
        tft.setTextColor(TFT_RADIO_ORANGE);
        int nameDayWidth = tft.textWidth(nameDayText);
        int nameDayX = (screenW - nameDayWidth) / 2;
        if (nameDayX < 10) nameDayX = 10;
        tft.setCursor(nameDayX, nameDayY);
        tft.print(nameDayText);
        tft.unloadFont();
      } else {
        // Fallback - standardowe fonty bez polskich znaków
        tft.setTextSize(2);
        tft.setTextColor(TFT_RADIO_ORANGE);
        String nameDayAscii = sanitizePolishToAscii(nameDayText);
        int nameDayWidth = nameDayAscii.length() * 12;
        int nameDayX = (screenW - nameDayWidth) / 2;
        if (nameDayX < 10) {
          tft.setTextSize(1);
          nameDayWidth = nameDayAscii.length() * 6;
          nameDayX = (screenW - nameDayWidth) / 2;
        }
        if (nameDayX < 10) nameDayX = 10;
        tft.setCursor(nameDayX, nameDayY);
        tft.print(nameDayAscii);
      }
    }
  }

  // 7. DOLNY PASEK - Adres IP
  IPAddress ip;
  bool connected = false;
  if (wifiConnected && WiFi.status() == WL_CONNECTED) {
    ip = WiFi.localIP();
    connected = true;
  } else if (WiFi.getMode() & WIFI_AP) {
    ip = WiFi.softAPIP();
    connected = true;
  }

  if (connected) {
    tft.setTextColor(TFT_LIGHTGREY);
    tft.setTextSize(2);
    String ipStr = ip.toString();
    int ipWidth = ipStr.length() * 12;
    int ipX = (screenW - ipWidth) / 2;
    tft.setCursor(ipX, screenH - 20);
    tft.print(ipStr);
  } else {
    tft.setTextColor(TFT_RED);
    tft.setTextSize(2);
    String noConn = "NO CONNECTION";
    int ncWidth = noConn.length() * 12;
    int ncX = (screenW - ncWidth) / 2;
    tft.setCursor(ncX, screenH - 20);
    tft.print(noConn);
  }
  
