Tom50505050/esp32-ham-clock/src/main.cpp
  // 8. STRZAŁKI NAWIGACYJNE
  int arrowY = screenH - 30;
  int arrowSize = 12;
  tft.fillTriangle(15, arrowY, 15 + arrowSize, arrowY - arrowSize, 15 + arrowSize, arrowY + arrowSize, TFT_RADIO_ORANGE);
  tft.fillTriangle(screenW - 15, arrowY, screenW - 15 - arrowSize, arrowY - arrowSize, screenW - 15 - arrowSize, arrowY + arrowSize, TFT_RADIO_ORANGE);
  
  // 9. IKONA BATERII - od razu przy starcie (skipScreenCheck = true)
#ifdef BATTERY_MONITORING_ENABLED
  drawBatteryQuickUpdate(true);
#endif
}

void updateScreen1Clock() {
  if (!tftInitialized || currentScreen != SCREEN_HAM_CLOCK || inMenu) {
    return;
  }

  const int screenW = 480;
  const int timeY = 130;  // Zaktualizowana pozycja Y dla większego zegara

  String timeStr = (screen1TimeMode == SCREEN1_TIME_LOCAL)
                     ? getTimezoneTimeString("%H:%M:%S", 9)
                     : getUtcTimeString();
  
  // Wyśrodkowanie na całym ekranie, TextSize 7 (powiększony)
  int timeWidth = timeStr.length() * 42;  // ~42px na znak przy TextSize 7
  int timeX = (screenW - timeWidth) / 2;
  if (timeX < 10) timeX = 10;
  
  // Stała szerokość paddingu dla stabilnego czyszczenia (max 8 znaków * 42px)
  const int fixedPaddingWidth = 8 * 42 + 10; // 336 + 10 margin
  
  // Narysuj zegar z tłem (bez czyszczenia - eliminuje migotanie)
  tft.setTextColor(TFT_WHITE, TFT_BLACK); // Tekst z tłem
  tft.setTextSize(7);  // POWIĘKSZONY zegar
  tft.setTextPadding(fixedPaddingWidth); // Stały padding dla stabilności
  tft.setCursor(timeX, timeY);
  tft.print(timeStr);
  tft.setTextPadding(0); // Reset
}

void updateScreen1Date() {
  if (!tftInitialized || currentScreen != SCREEN_HAM_CLOCK || inMenu) {
    return;
  }

  struct tm timeinfo;
  bool gotTime = false;
  if (screen1TimeMode == SCREEN1_TIME_LOCAL) {
    gotTime = getTimeWithTimezone(&timeinfo);
  } else {
    gotTime = getLocalTime(&timeinfo, 1);
  }
  if (!gotTime) {
    return;
  }

  static int lastDay = -1;
  static int lastMonth = -1;
  static int lastYear = -1;
  if (timeinfo.tm_mday == lastDay &&
      timeinfo.tm_mon == lastMonth &&
      timeinfo.tm_year == lastYear) {
    return;
  }
  lastDay = timeinfo.tm_mday;
  lastMonth = timeinfo.tm_mon;
  lastYear = timeinfo.tm_year;

  String dateText;
  if (screen1TimeMode == SCREEN1_TIME_LOCAL) {
    dateText = (tftLanguage == TFT_LANG_EN)
                 ? getEnglishDateStringFullWithTimezone()
                 : getPolishDateStringFullWithTimezone();
  } else {
    dateText = (tftLanguage == TFT_LANG_EN)
                 ? getEnglishDateStringFull()
                 : getPolishDateStringFull();
  }
  drawDateLine(dateText);
}

void updateScreen2Clock() {
  if (!tftInitialized || currentScreen != SCREEN_DX_CLUSTER || inMenu) {
    return;
  }

  static unsigned long lastClockRedrawMs = 0;
  unsigned long now = millis();
  if (lastClockRedrawMs != 0 && (now - lastClockRedrawMs) < DX_SCREEN_MIN_REDRAW_MS) {
    return;
  }

  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, 1)) {
    return;
  }

  char timeBuffer[10];
  strftime(timeBuffer, 10, "%H:%M Z", &timeinfo);
  int timeWidth = strlen(timeBuffer) * 12;
  int timeX = 475 - timeWidth;

  // Wyczyść tylko obszar godziny w nagłówku (pomarańczowy pasek)
  tft.fillRect(timeX - 2, 4, timeWidth + 6, 24, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  tft.setCursor(timeX, 8);
  tft.print(timeBuffer);
  lastClockRedrawMs = now;
}

bool spotMatchesScreen2Filters(const DXSpot &spot) {
  if (screen2FilterMode != FILTER_MODE_ALL) {
    if (screen2FilterMode == FILTER_MODE_CW && spot.mode != "CW") return false;
    if (screen2FilterMode == FILTER_MODE_SSB && spot.mode != "SSB") return false;
    if (screen2FilterMode == FILTER_MODE_DIGI && !(spot.mode == "FT8" || spot.mode == "FT4")) return false;
  }
  if (screen2FilterBandIndex > 0 && screen2FilterBandIndex < SCREEN8_FILTER_BANDS_COUNT) {
    String selectedBand = SCREEN8_FILTER_BANDS[screen2FilterBandIndex];
    float freqMHz = spot.frequency;

    if (selectedBand == "VHF") {
      if (!(freqMHz >= 30.0f && freqMHz < 300.0f)) return false;
    } else if (selectedBand == "UHF") {
      if (!(freqMHz >= 300.0f && freqMHz < 3000.0f)) return false;
    } else if (selectedBand == "SHF") {
      if (!(freqMHz >= 3000.0f && freqMHz < 30000.0f)) return false;
    } else {
      if (spot.band != selectedBand) return false;
    }
  }
  return true;
}

bool spotMatchesScreen7Filters(const DXSpot &spot) {
  if (screen7FilterMode != FILTER_MODE_ALL) {
    if (screen7FilterMode == FILTER_MODE_CW && spot.mode != "CW") return false;
    if (screen7FilterMode == FILTER_MODE_SSB && spot.mode != "SSB") return false;
    if (screen7FilterMode == FILTER_MODE_DIGI && !(spot.mode == "FT8" || spot.mode == "FT4")) return false;
  }
  if (screen7FilterBandIndex > 0 && screen7FilterBandIndex < SCREEN2_FILTER_BANDS_COUNT) {
    if (spot.band != SCREEN2_FILTER_BANDS[screen7FilterBandIndex]) return false;
  }
  return true;
}

bool spotMatchesScreen8Filters(const DXSpot &spot) {
  if (screen8FilterMode != FILTER_MODE_ALL) {
    if (screen8FilterMode == FILTER_MODE_CW && spot.mode != "CW") return false;
    if (screen8FilterMode == FILTER_MODE_SSB && spot.mode != "SSB") return false;
    if (screen8FilterMode == FILTER_MODE_DIGI && !(spot.mode == "FT8" || spot.mode == "FT4")) return false;
  }
  if (screen8FilterBandIndex > 0 && screen8FilterBandIndex < SCREEN8_FILTER_BANDS_COUNT) {
    String selectedBand = SCREEN8_FILTER_BANDS[screen8FilterBandIndex];
    float freqMHz = spot.frequency;

    if (selectedBand == "VHF") {
      if (!(freqMHz >= 30.0f && freqMHz < 300.0f)) return false;
    } else if (selectedBand == "UHF") {
      if (!(freqMHz >= 300.0f && freqMHz < 3000.0f)) return false;
    } else if (selectedBand == "SHF") {
      if (!(freqMHz >= 3000.0f && freqMHz < 30000.0f)) return false;
    } else {
      if (spot.band != selectedBand) return false;
    }
  }
  return true;
}

float getAprsSortDistance(const APRSStation &s) {
  if (s.hasLatLon && s.distance > 0) {
    return s.distance;
  }
  return 1.0e9f;
}

bool aprsSortLess(int a, int b) {
  if (screen6SortMode == APRS_SORT_CALLSIGN) {
    String ca = aprsStations[a].callsign;
    String cb = aprsStations[b].callsign;
    ca.toUpperCase();
    cb.toUpperCase();
    if (ca == cb) {
      return a < b;
    }
    return ca < cb;
  }
  if (screen6SortMode == APRS_SORT_DISTANCE) {
    float da = getAprsSortDistance(aprsStations[a]);
    float db = getAprsSortDistance(aprsStations[b]);
    if (da == db) {
      String ca = aprsStations[a].callsign;
      String cb = aprsStations[b].callsign;
      ca.toUpperCase();
      cb.toUpperCase();
      return ca < cb;
    }
    return da < db;
  }
  // APRS_SORT_TIME = aktualna kolejność
  return a < b;
}

