Tom50505050/esp32-ham-clock/src/main.cpp
void buildAprsDisplayOrder(int *order, int &count) {
  count = min(aprsStationCount, MAX_APRS_DISPLAY_LCD);
  for (int i = 0; i < count; i++) {
    order[i] = i;
  }
  if (screen6SortMode == APRS_SORT_TIME) {
    return;
  }
  for (int i = 0; i < count - 1; i++) {
    int best = i;
    for (int j = i + 1; j < count; j++) {
      if (aprsSortLess(order[j], order[best])) {
        best = j;
      }
    }
    if (best != i) {
      int tmp = order[i];
      order[i] = order[best];
      order[best] = tmp;
    }
  }
}

uint32_t computeScreen2Signature() {
  // Prosty hash treści tabeli (10 lub 11 wierszy zależnie od paska nawigacji)
  const uint32_t fnvPrime = 16777619u;
  uint32_t hash = 2166136261u;

  lockDxSpots();
  hash ^= (uint32_t)spotCount;
  hash *= fnvPrime;
  hash ^= (uint32_t)screen2FilterMode;
  hash *= fnvPrime;
  hash ^= (uint32_t)screen2FilterBandIndex;
  hash *= fnvPrime;
  hash ^= (uint32_t)dxTableSizeMode;
  hash *= fnvPrime;
  hash ^= isTableNavFooterVisible(SCREEN_DX_CLUSTER) ? 1u : 0u;
  hash *= fnvPrime;

  int maxRows = getDxTableMaxRows();
  int displayCount = 0;
  for (int i = 0; i < spotCount && displayCount < maxRows; i++) {
    const DXSpot &s = spots[i];
    if (!spotMatchesScreen2Filters(s)) {
      continue;
    }
    for (size_t j = 0; j < s.time.length(); j++) {
      hash ^= (uint8_t)s.time[j];
      hash *= fnvPrime;
    }
    for (size_t j = 0; j < s.callsign.length(); j++) {
      hash ^= (uint8_t)s.callsign[j];
      hash *= fnvPrime;
    }
    hash ^= (uint32_t)(s.frequency * 100);
    hash *= fnvPrime;
    for (size_t j = 0; j < s.mode.length(); j++) {
      hash ^= (uint8_t)s.mode[j];
      hash *= fnvPrime;
    }
    for (size_t j = 0; j < s.country.length(); j++) {
      hash ^= (uint8_t)s.country[j];
      hash *= fnvPrime;
    }
    hash ^= (uint32_t)s.distance;
    hash *= fnvPrime;
    displayCount++;
  }

  unlockDxSpots();

  return hash;
}

void updateScreen2Data() {
  if (!tftInitialized || currentScreen != SCREEN_DX_CLUSTER || inMenu) {
    return;
  }

  // 1) Zaktualizuj czas w nagłówku (bez pełnego odświeżania)
  updateScreen2Clock();

  // 2) Odśwież tabelę tylko gdy dane się zmieniły
  static uint32_t lastSig = 0;
  static unsigned long lastTableRedrawMs = 0;
  uint32_t currentSig = computeScreen2Signature();
  if (currentSig == lastSig) {
    return;
  }

  unsigned long now = millis();
  if (lastTableRedrawMs != 0 && (now - lastTableRedrawMs) < DX_SCREEN_MIN_REDRAW_MS) {
    return;
  }

  lastSig = currentSig;
  lastTableRedrawMs = now;

  // 3) Renderuj tabelę do bufora i wypchnij jednym ruchem (bez migotania)
  const bool navVisible = isTableNavFooterVisible(SCREEN_DX_CLUSTER);
  const bool enlarged = isDxTableEnlarged();
  const int maxRows = getDxTableMaxRows();
  const int tableTop = TFT_TABLE_TOP;
  const int tableBottom = getTableBottomForScreen(SCREEN_DX_CLUSTER);
  const int tableHeight = tableBottom - tableTop;
  TFT_eSprite *tableSprite = (navVisible && ensureSharedTableSprite()) ? &sharedTableSprite : nullptr;

  if (tableSprite != nullptr) {
    tableSprite->fillSprite(TFT_BLACK);

    int yPos = 8;
    tableSprite->setTextColor(TFT_DARKGREY);
    tableSprite->setTextSize(1);
    if (enlarged) {
      tableSprite->setCursor(5, yPos);   tableSprite->print("UTC");
      tableSprite->setCursor(74, yPos);  tableSprite->print("CALL");
      tableSprite->setCursor(204, yPos); tableSprite->print("MHz");
      tableSprite->setCursor(282, yPos); tableSprite->print("MODE");
    } else {
      tableSprite->setCursor(5, yPos);   tableSprite->print("UTC");
      tableSprite->setCursor(50, yPos);  tableSprite->print("CALLSIGN");
      tableSprite->setCursor(125, yPos); tableSprite->print("MHz");
      tableSprite->setCursor(190, yPos); tableSprite->print("MODE");
      tableSprite->setCursor(260, yPos); tableSprite->print(sanitizePolishToAscii(String(tr(TR_COUNTRY))));
    }
    tableSprite->drawFastHLine(0, yPos + 10, 480, TFT_DARKGREY);
    yPos += enlarged ? 20 : 18;

    int displayCount = 0;
    lockDxSpots();
    for (int i = 0; i < spotCount && displayCount < maxRows; i++) {
      if (!spotMatchesScreen2Filters(spots[i])) {
        continue;
      }
      if (yPos >= (tableHeight - 2)) {
        break;
      }
      if (enlarged) {
        if (displayCount % 2 == 0) {
          tableSprite->fillRect(0, yPos - 5, 480, 24, TFT_TABLE_ALT_ROW_COLOR);
        }

        tableSprite->setTextSize(2);
        tableSprite->setTextColor(TFT_LIGHTGREY);
        tableSprite->setCursor(5, yPos);
        tableSprite->print(formatSpotUtc(spots[i].time));

        tableSprite->setTextColor(TFT_WHITE);
        tableSprite->setCursor(74, yPos);
        String callText = spots[i].callsign;
        if (callText.length() > 8) callText = callText.substring(0, 8);
        tableSprite->print(callText);

        tableSprite->setTextColor(TFT_YELLOW);
        tableSprite->setCursor(204, yPos);
        tableSprite->print(spots[i].frequency / 1000.0, 3);

        tableSprite->setTextColor(TFT_GREEN);
        tableSprite->setCursor(282, yPos);
        String modeText = spots[i].mode;
        if (modeText.length() > 4) modeText = modeText.substring(0, 4);
        tableSprite->print(modeText);

        yPos += 27;
      } else {
        if (displayCount % 2 == 0) {
          tableSprite->fillRect(0, yPos - 2, 480, 16, TFT_TABLE_ALT_ROW_COLOR);
        }

        tableSprite->setTextSize(1);

        tableSprite->setTextColor(TFT_LIGHTGREY);
        tableSprite->setCursor(5, yPos);
        tableSprite->print(formatSpotUtc(spots[i].time));

        tableSprite->setTextColor(TFT_WHITE, TFT_BLACK);
        tableSprite->setTextSize(1);
        tableSprite->setCursor(50, yPos);
        String callText = spots[i].callsign;
        callText.toUpperCase();
        if (callText.length() > 10) callText = callText.substring(0, 10);
        tableSprite->print(callText);

        tableSprite->setTextColor(TFT_YELLOW);
        tableSprite->setCursor(125, yPos);
        tableSprite->print(spots[i].frequency / 1000.0, 3);

        tableSprite->setTextColor(TFT_GREEN);
        tableSprite->setCursor(190, yPos);
        tableSprite->print(spots[i].mode);

