Tom50505050/esp32-ham-clock/src/main.cpp
        tableSprite->setTextColor(TFT_RADIO_ORANGE);
        tableSprite->setCursor(260, yPos);
        String countryText = formatDistanceOrCountry(spots[i], COUNTRY_COL_MAX_LEN);
        tableSprite->print(countryText);

        yPos += 17;
      }
      displayCount++;
    }
    unlockDxSpots();

    if (displayCount == 0) {
      tableSprite->setTextColor(TFT_RED);
      tableSprite->setTextSize(2);
      tableSprite->setCursor(40, 120 - tableTop);
      tableSprite->print("WAITING FOR SPOTS...");
    }

    tableSprite->pushSprite(0, tableTop);
    return;
  }

  // Fallback bez sprite (np. gdy zabraknie RAM)
  tft.fillRect(0, tableTop, 480, tableHeight, TFT_BLACK);

  int yPos = 40;
  tft.setTextColor(TFT_DARKGREY);
  tft.setTextSize(1);
  if (enlarged) {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(74, yPos);  tft.print("CALL");
    tft.setCursor(204, yPos); tft.print("MHz");
    tft.setCursor(330, yPos); tft.print("MODE");
  } else {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(50, yPos);  tft.print("CALLSIGN");
    tft.setCursor(125, yPos); tft.print("MHz");
    tft.setCursor(190, yPos); tft.print("MODE");
    tft.setCursor(260, yPos); tft.print(sanitizePolishToAscii(String(tr(TR_COUNTRY))));
  }
  tft.drawFastHLine(0, yPos + 10, 480, TFT_DARKGREY);
  yPos += enlarged ? 20 : 18;

  int displayCount = 0;
  lockDxSpots();
  for (int i = 0; i < spotCount && displayCount < maxRows; i++) {
    if (!spotMatchesScreen2Filters(spots[i])) {
      continue;
    }
    if (yPos >= (tableBottom - 2)) {
      break;
    }
    if (enlarged) {
      if (displayCount % 2 == 0) {
        tft.fillRect(0, yPos - 5, 480, 24, TFT_TABLE_ALT_ROW_COLOR);
      }

      tft.setTextSize(2);
      tft.setTextColor(TFT_LIGHTGREY);
      tft.setCursor(5, yPos);
      tft.print(formatSpotUtc(spots[i].time));

      tft.setTextColor(TFT_WHITE);
      tft.setCursor(74, yPos);
      String callText = spots[i].callsign;
      if (callText.length() > 8) callText = callText.substring(0, 8);
      tft.print(callText);

      tft.setTextColor(TFT_YELLOW);
      tft.setCursor(204, yPos);
      tft.print(spots[i].frequency / 1000.0, 3);

      tft.setTextColor(TFT_GREEN);
      tft.setCursor(330, yPos);
      String modeText = spots[i].mode;
      if (modeText.length() > 4) modeText = modeText.substring(0, 4);
      tft.print(modeText);

      yPos += 27;
    } else {
      if (displayCount % 2 == 0) {
        tft.fillRect(0, yPos - 2, 480, 16, TFT_TABLE_ALT_ROW_COLOR);
      }

      tft.setTextSize(1);

      tft.setTextColor(TFT_LIGHTGREY);
      tft.setCursor(5, yPos);
      tft.print(formatSpotUtc(spots[i].time));

      tft.setTextColor(TFT_WHITE);
      tft.setCursor(50, yPos);
      String callStr = spots[i].callsign;
      callStr.toUpperCase();
      tft.print(callStr);

      tft.setTextColor(TFT_YELLOW);
      tft.setCursor(125, yPos);
      tft.print(spots[i].frequency / 1000.0, 3);

      tft.setTextColor(TFT_GREEN);
      tft.setCursor(190, yPos);
      String modeStr = spots[i].mode;
      if (modeStr.length() > 4) modeStr = modeStr.substring(0, 4);
      tft.print(modeStr);

      tft.setTextColor(TFT_RADIO_ORANGE);
      tft.setCursor(260, yPos);
      String countryText = formatDistanceOrCountry(spots[i], COUNTRY_COL_MAX_LEN);
      tft.print(countryText);

      yPos += 17;
    }
    displayCount++;
  }
  unlockDxSpots();

  if (displayCount == 0) {
    tft.setTextColor(TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(40, 120);
    tft.print("WAITING FOR SPOTS...");
  }
  
  // Strzałki nawigacyjne - ZAWSZE rysuj po odświeżeniu tabeli
  drawSwitchScreenFooter();
}

// Ekran 7: POTA Cluster (SSB only, 10 spotów)
void drawPotaCluster() {
  // Użyj tych samych współrzędnych co w drawHamClock() - ograniczenie do obszaru ramki

  tft.fillRect(0, 0, 480, 32, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);

  drawHamburgerMenuButton3D(5, 7);

  // Napis POTA.app
  tft.setTextSize(2);
  String potaText = "POTA.app";
  int potaX = 45;
  tft.setCursor(potaX, 8);
  tft.print(potaText);

  // ZEGAR w prawym górnym rogu - USUNIĘTY
  // struct tm timeinfo;
  // if (getLocalTime(&timeinfo, 1)) {
  //   char timeBuffer[10];
  //   strftime(timeBuffer, 10, "%H:%M Z", &timeinfo);
  //   int timeWidth = strlen(timeBuffer) * 12;
  //   tft.setCursor(460 - timeWidth, 8);
  //   tft.print(timeBuffer);
  // }

  int yPos = 40;
  const bool enlarged = isDxTableEnlarged();
  tft.setTextColor(TFT_DARKGREY);
  tft.setTextSize(1);

  if (enlarged) {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(74, yPos);  tft.print("CALL");
    tft.setCursor(204, yPos); tft.print("MHz");
    tft.setCursor(330, yPos); tft.print("MODE");
  } else {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(50, yPos);  tft.print("CALLSIGN");
    tft.setCursor(140, yPos); tft.print("MHz");
    tft.setCursor(260, yPos); tft.print("MODE");
    tft.setCursor(360, yPos); tft.print(sanitizePolishToAscii(String(tr(TR_COUNTRY))));
  }
  tft.drawFastHLine(0, yPos + 10, 480, TFT_DARKGREY);
  yPos += enlarged ? 20 : 18;

  int maxRows = getPotaTableMaxRows();
  int displayCount = 0;
  for (int i = 0; i < potaSpotCount && displayCount < maxRows; i++) {
    if (!spotMatchesScreen7Filters(potaSpots[i])) continue;
    if (enlarged) {
      if (displayCount % 2 == 0) tft.fillRect(0, yPos - 5, 480, 24, TFT_TABLE_ALT_ROW_COLOR);

      tft.setTextSize(2);
      tft.setTextColor(TFT_LIGHTGREY);
      tft.setCursor(5, yPos);
      tft.print(formatSpotUtc(potaSpots[i].time));

      tft.setTextColor(TFT_WHITE);
      tft.setCursor(74, yPos);
      String callText = potaSpots[i].callsign;
      if (callText.length() > 8) callText = callText.substring(0, 8);
      tft.print(callText);

      tft.setTextColor(TFT_YELLOW);
      tft.setCursor(204, yPos);
      tft.print(potaSpots[i].frequency, 3);

      tft.setTextColor(TFT_GREEN);
      tft.setCursor(330, yPos);
      String modeText = potaSpots[i].mode;
      if (modeText.length() > 4) modeText = modeText.substring(0, 4);
      tft.print(modeText);

      yPos += 27;
    } else {
      if (displayCount % 2 == 0) tft.fillRect(0, yPos - 2, 480, 16, TFT_TABLE_ALT_ROW_COLOR);

      tft.setTextSize(1);
      tft.setTextColor(TFT_LIGHTGREY);
      tft.setCursor(5, yPos);
      String timeStr = potaSpots[i].time;
      // Obsłuż ISO 8601 z datą: wyciągnij HH:MM
      int tPos = timeStr.indexOf('T');
      if (tPos > 0 && tPos + 5 < (int)timeStr.length()) {
        timeStr = timeStr.substring(tPos + 1, tPos + 6);
      }
      if (timeStr.length() > 5) timeStr = timeStr.substring(0, 5);
      tft.print(timeStr);

      tft.setTextColor(TFT_WHITE, TFT_BLACK);
      tft.setTextSize(1);
      tft.setCursor(50, yPos);
      String callStr = potaSpots[i].callsign;
      callStr.toUpperCase();
      tft.print(callStr);

