Tom50505050/esp32-ham-clock/src/main.cpp
      tft.setTextColor(TFT_YELLOW);
      tft.setCursor(125, yPos);
      tft.print(potaSpots[i].frequency, 3); // frequency już w MHz

      tft.setTextColor(TFT_GREEN);
      tft.setCursor(240, yPos);
      tft.print(potaSpots[i].mode);

      tft.setTextColor(TFT_RADIO_ORANGE);
      tft.setCursor(220, yPos);
      String countryText = formatDistanceOrCountry(potaSpots[i], COUNTRY_COL_MAX_LEN);
      tft.print(countryText);

      yPos += 17;
    }
    displayCount++;
  }

  if (isTableNavFooterVisible(SCREEN_POTA_CLUSTER)) {
    // Strzałki nawigacyjne - duże, blisko krawędzi (takie same na wszystkich ekranach)
    int arrowY = 290;
    int arrowSize = 12;
    tft.fillTriangle(15, arrowY, 15 + arrowSize, arrowY - arrowSize, 15 + arrowSize, arrowY + arrowSize, menuThemeColor);
    tft.fillTriangle(465, arrowY, 465 - arrowSize, arrowY - arrowSize, 465 - arrowSize, arrowY + arrowSize, menuThemeColor);
  }

  if (displayCount == 0) {
    tft.setTextColor(TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(40, 120);
    tft.print("WAITING FOR SPOTS...");
  }
}

void updateScreen7Clock() {
  if (!tftInitialized || currentScreen != 7 || inMenu) {
    return;
  }

  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, 1)) {
    return;
  }

  char timeBuffer[10];
  strftime(timeBuffer, 10, "%H:%M Z", &timeinfo);
  int timeWidth = strlen(timeBuffer) * 12;
  int timeX = 315 - timeWidth;

  tft.fillRect(timeX - 2, 4, timeWidth + 6, 24, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  tft.setCursor(timeX, 8);
  tft.print(timeBuffer);
}

uint32_t computeScreen7Signature() {
  const uint32_t fnvPrime = 16777619u;
  uint32_t hash = 2166136261u;

  hash ^= (uint32_t)potaSpotCount;
  hash *= fnvPrime;
  hash ^= (uint32_t)screen7FilterMode;
  hash *= fnvPrime;
  hash ^= (uint32_t)screen7FilterBandIndex;
  hash *= fnvPrime;
  hash ^= (uint32_t)dxTableSizeMode;
  hash *= fnvPrime;
  hash ^= isTableNavFooterVisible(SCREEN_POTA_CLUSTER) ? 1u : 0u;
  hash *= fnvPrime;

  int maxDisplaySpots = min(potaSpotCount, getPotaTableMaxRows());
  int displayCount = 0;
  for (int i = 0; i < potaSpotCount && displayCount < maxDisplaySpots; i++) {
    const DXSpot &s = potaSpots[i];
    if (!spotMatchesScreen7Filters(s)) continue;
    for (size_t j = 0; j < s.time.length(); j++) {
      hash ^= (uint8_t)s.time[j];
      hash *= fnvPrime;
    }
    for (size_t j = 0; j < s.callsign.length(); j++) {
      hash ^= (uint8_t)s.callsign[j];
      hash *= fnvPrime;
    }

    hash ^= (uint32_t)(s.frequency * 100);
    hash *= fnvPrime;
    for (size_t j = 0; j < s.mode.length(); j++) {
      hash ^= (uint8_t)s.mode[j];
      hash *= fnvPrime;
    }
    for (size_t j = 0; j < s.country.length(); j++) {
      hash ^= (uint8_t)s.country[j];
      hash *= fnvPrime;
    }
    displayCount++;
  }

  return hash;
}

void updateScreen7Data() {
  if (!tftInitialized || currentScreen != 7 || inMenu) {
    return;
  }

  // Wyłączono - używamy tylko updatePotaClusterClock dla zegara w prawym rogu
  // updateScreen7Clock();

  static uint32_t lastSig = 0;
  uint32_t currentSig = computeScreen7Signature();
  if (currentSig == lastSig) {
    return;
  }
  lastSig = currentSig;

  const bool navVisible = isTableNavFooterVisible(SCREEN_POTA_CLUSTER);
  const bool enlarged = isDxTableEnlarged();
  const int maxRows = getPotaTableMaxRows();
  const int tableTop = TFT_TABLE_TOP;
  const int tableBottom = getTableBottomForScreen(SCREEN_POTA_CLUSTER);
  const int tableHeight = tableBottom - tableTop;
  TFT_eSprite *tableSprite = (navVisible && ensureSharedTableSprite()) ? &sharedTableSprite : nullptr;

  if (tableSprite != nullptr) {
    tableSprite->fillSprite(TFT_BLACK);

    int yPos = 8;
    tableSprite->setTextColor(TFT_DARKGREY);
    tableSprite->setTextSize(1);
    if (enlarged) {
      tableSprite->setCursor(5, yPos);   tableSprite->print("UTC");
      tableSprite->setCursor(74, yPos);  tableSprite->print("CALL");
      tableSprite->setCursor(204, yPos); tableSprite->print("MHz");
      tableSprite->setCursor(282, yPos); tableSprite->print("MODE");
    } else {
      tableSprite->setCursor(5, yPos);   tableSprite->print("UTC");
      tableSprite->setCursor(50, yPos);  tableSprite->print("CALLSIGN");
      tableSprite->setCursor(125, yPos); tableSprite->print("MHz");
      tableSprite->setCursor(190, yPos); tableSprite->print("MODE");
      tableSprite->setCursor(260, yPos); tableSprite->print(sanitizePolishToAscii(String(tr(TR_COUNTRY))));
    }
    tableSprite->drawFastHLine(0, yPos + 10, 480, TFT_DARKGREY);
    yPos += enlarged ? 20 : 18;

    int displayCount = 0;
    for (int i = 0; i < potaSpotCount && displayCount < maxRows; i++) {
      if (!spotMatchesScreen7Filters(potaSpots[i])) continue;
      if (yPos >= (tableHeight - 2)) {
        break;
      }
      if (enlarged) {
        if (displayCount % 2 == 0) {
          tableSprite->fillRect(0, yPos - 5, 480, 24, TFT_TABLE_ALT_ROW_COLOR);
        }

        tableSprite->setTextSize(2);

        tableSprite->setTextColor(TFT_LIGHTGREY);
        tableSprite->setCursor(5, yPos);
        tableSprite->print(formatSpotUtc(potaSpots[i].time));

        tableSprite->setTextColor(TFT_WHITE);
        tableSprite->setCursor(74, yPos);
        String callText = potaSpots[i].callsign;
        if (callText.length() > 8) callText = callText.substring(0, 8);
        tableSprite->print(callText);

        tableSprite->setTextColor(TFT_YELLOW);
        tableSprite->setCursor(204, yPos);
        tableSprite->print(potaSpots[i].frequency, 3);

        tableSprite->setTextColor(TFT_GREEN);
        tableSprite->setCursor(282, yPos);
        String modeText = potaSpots[i].mode;
        if (modeText.length() > 4) modeText = modeText.substring(0, 4);
        tableSprite->print(modeText);

        yPos += 27;
      } else {
        if (displayCount % 2 == 0) {
          tableSprite->fillRect(0, yPos - 2, 480, 16, TFT_TABLE_ALT_ROW_COLOR);
        }

        tableSprite->setTextSize(1);

        tableSprite->setTextColor(TFT_LIGHTGREY);
        tableSprite->setCursor(5, yPos);
        String timeStr = potaSpots[i].time;
        int tPos = timeStr.indexOf('T');
        if (tPos > 0 && tPos + 5 < (int)timeStr.length()) {
          timeStr = timeStr.substring(tPos + 1, tPos + 6);
        }
        if (timeStr.length() > 5) timeStr = timeStr.substring(0, 5);
        tableSprite->print(timeStr);

        tableSprite->setTextColor(TFT_WHITE);
        tableSprite->setCursor(50, yPos);
        tableSprite->print(potaSpots[i].callsign);

