Tom50505050/esp32-ham-clock/src/main.cpp
        tableSprite->setTextColor(TFT_YELLOW);
        tableSprite->setCursor(125, yPos);
        tableSprite->print(potaSpots[i].frequency, 3);

        tableSprite->setTextColor(TFT_GREEN);
        tableSprite->setCursor(190, yPos);
        tableSprite->print(potaSpots[i].mode);

        tableSprite->setTextColor(TFT_RADIO_ORANGE);
        tableSprite->setCursor(260, yPos);
        String countryText = formatDistanceOrCountry(potaSpots[i], COUNTRY_COL_MAX_LEN);
        tableSprite->print(countryText);

        yPos += 17;
      }
      displayCount++;
    }

    if (displayCount == 0) {
      tableSprite->setTextColor(TFT_RED);
      tableSprite->setTextSize(2);
      tableSprite->setCursor(40, 120 - tableTop);
      tableSprite->print("WAITING FOR SPOTS...");
    }

    tableSprite->pushSprite(0, tableTop);
    return;
  }

  // Fallback bez sprite (np. gdy zabraknie RAM)
  tft.fillRect(0, tableTop, 480, tableHeight, TFT_BLACK);

  int yPos = 40;
  tft.setTextColor(TFT_DARKGREY);
  tft.setTextSize(1);
  if (enlarged) {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(74, yPos);  tft.print("CALL");
    tft.setCursor(204, yPos); tft.print("MHz");
    tft.setCursor(330, yPos); tft.print("MODE");
  } else {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(50, yPos);  tft.print("CALLSIGN");
    tft.setCursor(125, yPos); tft.print("MHz");
    tft.setCursor(260, yPos); tft.print("MODE");
    tft.setCursor(360, yPos); tft.print(sanitizePolishToAscii(String(tr(TR_COUNTRY))));
  }
  tft.drawFastHLine(0, yPos + 10, 480, TFT_DARKGREY);
  yPos += enlarged ? 20 : 18;

  int displayCount = 0;
  for (int i = 0; i < potaSpotCount && displayCount < maxRows; i++) {
    if (!spotMatchesScreen7Filters(potaSpots[i])) continue;
    if (yPos >= (tableBottom - 2)) {
      break;
    }
    if (enlarged) {
      if (displayCount % 2 == 0) {
        tft.fillRect(0, yPos - 5, 480, 24, TFT_TABLE_ALT_ROW_COLOR);
      }

      tft.setTextSize(2);

      tft.setTextColor(TFT_LIGHTGREY);
      tft.setCursor(5, yPos);
      tft.print(formatSpotUtc(potaSpots[i].time));

      tft.setTextColor(TFT_WHITE);
      tft.setCursor(74, yPos);
      String callText = potaSpots[i].callsign;
      if (callText.length() > 8) callText = callText.substring(0, 8);
      tft.print(callText);

      tft.setTextColor(TFT_YELLOW);
      tft.setCursor(204, yPos);
      tft.print(potaSpots[i].frequency, 3);

      tft.setTextColor(TFT_GREEN);
      tft.setCursor(330, yPos);
      String modeText = potaSpots[i].mode;
      if (modeText.length() > 4) modeText = modeText.substring(0, 4);
      tft.print(modeText);

      yPos += 27;
    } else {
      if (displayCount % 2 == 0) {
        tft.fillRect(0, yPos - 2, 480, 16, TFT_TABLE_ALT_ROW_COLOR);
      }

      // Znak wywoławczy - rozmiar 1 (standardowy)
      tft.setTextSize(1);
      tft.setTextColor(TFT_WHITE, TFT_BLACK);
      tft.setCursor(50, yPos);
      String callStr = potaSpots[i].callsign;
      callStr.toUpperCase();
      if (callStr.length() > 8) callStr = callStr.substring(0, 8);
      tft.print(callStr);
      
      // Częstotliwość - rozmiar 1
      tft.setTextColor(TFT_YELLOW, TFT_BLACK);
      tft.setCursor(140, yPos);
      tft.print(potaSpots[i].frequency, 3);
      
      // Mode - rozmiar 1
      tft.setTextColor(TFT_GREEN, TFT_BLACK);
      tft.setCursor(260, yPos);
      String modeStr = potaSpots[i].mode;
      if (modeStr.length() > 4) modeStr = modeStr.substring(0, 4);
      tft.print(modeStr);
      
      // Czas i kraj - rozmiar 1 (dopasowane do nagłówków)
      tft.setTextSize(1);
      tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
      tft.setCursor(5, yPos + 5);
      String timeStr = potaSpots[i].time;
      int tPos = timeStr.indexOf('T');
      if (tPos > 0 && tPos + 5 < (int)timeStr.length()) {
        timeStr = timeStr.substring(tPos + 1, tPos + 6);
      }
      if (timeStr.length() > 5) timeStr = timeStr.substring(0, 5);
      tft.print(timeStr);

      tft.setTextColor(TFT_ORANGE, TFT_BLACK);
      tft.setCursor(360, yPos + 5);
      String countryText = formatDistanceOrCountry(potaSpots[i], COUNTRY_COL_MAX_LEN);
      tft.print(countryText);

      yPos += 20;
    }
    displayCount++;
  }

  if (displayCount == 0) {
    tft.setTextColor(TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(40, 120);
    tft.print("WAITING FOR SPOTS...");
  }
  
  // Strzałki nawigacyjne - ZAWSZE rysuj po odświeżeniu tabeli
  drawSwitchScreenFooter();
}

static String formatHamalertTftTime(const String &rawTime) {
  String t = rawTime;
  t.trim();
  if (t.length() == 0) return "-----";

  int tPos = t.indexOf('T');
  if (tPos > 0 && (tPos + 5) < (int)t.length()) {
    String hhmm = t.substring(tPos + 1, tPos + 6);
    if (hhmm.length() == 5) {
      return hhmm;
    }
  }

  if (t.length() >= 5 && t.charAt(2) == ':') {
    return t.substring(0, 5);
  }

  if (t.length() >= 5 && t.charAt(4) == 'Z' && isDigit((unsigned char)t.charAt(0)) && isDigit((unsigned char)t.charAt(1)) && isDigit((unsigned char)t.charAt(2)) && isDigit((unsigned char)t.charAt(3))) {
    String hhmm = t.substring(0, 4);
    return hhmm.substring(0, 2) + ":" + hhmm.substring(2, 4);
  }

  return t;
}

void drawHamalertCluster() {
  tft.fillScreen(TFT_BLACK);

  tft.fillRect(0, 0, 480, 32, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);

  drawHamburgerMenuButton3D(5, 7);

  tft.setTextSize(2);
  tft.setCursor(35, 8);
  tft.print("HAMALERT.org");

  // ZEGAR - rysowany osobno przez updateHamalertClock()

  int yPos = 40;
  const bool enlarged = isDxTableEnlarged();
  tft.setTextColor(TFT_DARKGREY);
  tft.setTextSize(1);
  if (enlarged) {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(74, yPos);  tft.print("CALL");
    tft.setCursor(204, yPos); tft.print("MHz");
    tft.setCursor(330, yPos); tft.print("MODE");
  } else {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(50, yPos);  tft.print("CALLSIGN");
    tft.setCursor(125, yPos); tft.print("MHz");
    tft.setCursor(240, yPos); tft.print("MODE");
    tft.setCursor(220, yPos); tft.print(sanitizePolishToAscii(String(tr(TR_COUNTRY))));
  }
  tft.drawFastHLine(0, yPos + 10, 480, TFT_DARKGREY);
  yPos += enlarged ? 20 : 18;

  const int maxRows = getHamalertTableMaxRows();
  int displayCount = 0;
  for (int i = 0; i < hamalertSpotCount && displayCount < maxRows; i++) {
    if (!spotMatchesScreen8Filters(hamalertSpots[i])) {
      continue;
    }
    if (enlarged) {
      if (displayCount % 2 == 0) {
        tft.fillRect(0, yPos - 5, 480, 24, TFT_TABLE_ALT_ROW_COLOR);
      }

      tft.setTextSize(2);

      tft.setTextColor(TFT_LIGHTGREY);
      tft.setCursor(5, yPos);
      tft.print(formatHamalertTftTime(hamalertSpots[i].time));

      tft.setTextColor(TFT_WHITE);
      tft.setCursor(74, yPos);
      String callText = hamalertSpots[i].callsign;
      if (callText.length() > 8) callText = callText.substring(0, 8);
      tft.print(callText);

