Tom50505050/esp32-ham-clock/src/main.cpp
      tft.setTextColor(TFT_YELLOW);
      tft.setCursor(204, yPos);
      tft.print(hamalertSpots[i].frequency, 3);

      tft.setTextColor(TFT_GREEN);
      tft.setCursor(330, yPos);
      String modeText = hamalertSpots[i].mode;
      if (modeText.length() > 4) modeText = modeText.substring(0, 4);
      tft.print(modeText);

      yPos += 27;
    } else {
      if (displayCount % 2 == 0) {
        tft.fillRect(0, yPos - 2, 480, 16, TFT_TABLE_ALT_ROW_COLOR);
      }

      tft.setTextSize(1);

      tft.setTextColor(TFT_LIGHTGREY);
      tft.setCursor(5, yPos);
      tft.print(formatHamalertTftTime(hamalertSpots[i].time));

      tft.setTextColor(TFT_WHITE);
      tft.setCursor(50, yPos);
      tft.print(hamalertSpots[i].callsign);

      tft.setTextColor(TFT_YELLOW);
      tft.setCursor(125, yPos);
      tft.print(hamalertSpots[i].frequency, 3);

      tft.setTextColor(TFT_GREEN);
      tft.setCursor(240, yPos);
      tft.print(hamalertSpots[i].mode);

      tft.setTextColor(TFT_RADIO_ORANGE);
      tft.setCursor(220, yPos);
      String countryText = formatDistanceOrCountry(hamalertSpots[i], COUNTRY_COL_MAX_LEN);
      tft.print(countryText);

      yPos += 17;
    }
    displayCount++;
  }

  // Strzałki nawigacyjne - ZAWSZE widoczne
  drawSwitchScreenFooter();

  if (displayCount == 0) {
    tft.setTextColor(TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(40, 120);
    tft.print("WAITING FOR SPOTS...");
  }
}

void updateScreen8Clock() {
  if (!tftInitialized || currentScreen != SCREEN_HAMALERT_CLUSTER || inMenu) {
    return;
  }

  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, 1)) {
    return;
  }

  char timeBuffer[10];
  strftime(timeBuffer, 10, "%H:%M Z", &timeinfo);
  int timeWidth = strlen(timeBuffer) * 12;
  int timeX = 475 - timeWidth;

  tft.fillRect(timeX - 2, 4, timeWidth + 6, 24, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  tft.setCursor(timeX, 8);
  tft.print(timeBuffer);
}

uint32_t computeScreen8Signature() {
  const uint32_t fnvPrime = 16777619u;
  uint32_t hash = 2166136261u;

  hash ^= (uint32_t)hamalertSpotCount;
  hash *= fnvPrime;
  hash ^= (uint32_t)screen8FilterMode;
  hash *= fnvPrime;
  hash ^= (uint32_t)screen8FilterBandIndex;
  hash *= fnvPrime;
  hash ^= (uint32_t)dxTableSizeMode;
  hash *= fnvPrime;
  hash ^= isTableNavFooterVisible(SCREEN_HAMALERT_CLUSTER) ? 1u : 0u;
  hash *= fnvPrime;

  int maxRows = getHamalertTableMaxRows();
  int displayCount = 0;
  for (int i = 0; i < hamalertSpotCount && displayCount < maxRows; i++) {
    const DXSpot &s = hamalertSpots[i];
    if (!spotMatchesScreen8Filters(s)) {
      continue;
    }
    for (size_t j = 0; j < s.time.length(); j++) {
      hash ^= (uint8_t)s.time[j];
      hash *= fnvPrime;
    }
    for (size_t j = 0; j < s.callsign.length(); j++) {
      hash ^= (uint8_t)s.callsign[j];
      hash *= fnvPrime;
    }
    hash ^= (uint32_t)(s.frequency * 100);
    hash *= fnvPrime;
    for (size_t j = 0; j < s.mode.length(); j++) {
      hash ^= (uint8_t)s.mode[j];
      hash *= fnvPrime;
    }
    for (size_t j = 0; j < s.country.length(); j++) {
      hash ^= (uint8_t)s.country[j];
      hash *= fnvPrime;
    }
    displayCount++;
  }

  return hash;
}

void updateScreen8Data() {
  if (!tftInitialized || currentScreen != SCREEN_HAMALERT_CLUSTER || inMenu) {
    return;
  }

  // Wyłączono - zegar tylko na górnym pasku przez updateHamalertClock
  // updateScreen8Clock();

  static uint32_t lastSig = 0;
  uint32_t currentSig = computeScreen8Signature();
  if (currentSig == lastSig) {
    return;
  }
  lastSig = currentSig;

  const bool enlarged = isDxTableEnlarged();
  const int maxRows = getHamalertTableMaxRows();
  const int tableTop = TFT_TABLE_TOP;
  const int tableBottom = getTableBottomForScreen(SCREEN_HAMALERT_CLUSTER);
  const int tableHeight = tableBottom - tableTop;

  tft.fillRect(0, tableTop, 480, tableHeight, TFT_BLACK);

  int yPos = 40;
  tft.setTextColor(TFT_DARKGREY);
  tft.setTextSize(1);
  if (enlarged) {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(74, yPos);  tft.print("CALL");
    tft.setCursor(204, yPos); tft.print("MHz");
    tft.setCursor(330, yPos); tft.print("MODE");
  } else {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(50, yPos);  tft.print("CALLSIGN");
    tft.setCursor(125, yPos); tft.print("MHz");
    tft.setCursor(240, yPos); tft.print("MODE");
    tft.setCursor(220, yPos); tft.print(sanitizePolishToAscii(String(tr(TR_COUNTRY))));
  }
  tft.drawFastHLine(0, yPos + 10, 480, TFT_DARKGREY);
  yPos += enlarged ? 20 : 18;

  int displayCount = 0;
  for (int i = 0; i < hamalertSpotCount && displayCount < maxRows; i++) {
    if (!spotMatchesScreen8Filters(hamalertSpots[i])) {
      continue;
    }
    if (yPos >= (tableBottom - 2)) {
      break;
    }
    if (enlarged) {
      if (displayCount % 2 == 0) {
        tft.fillRect(0, yPos - 5, 480, 24, TFT_TABLE_ALT_ROW_COLOR);
      }

      tft.setTextSize(2);

      tft.setTextColor(TFT_LIGHTGREY);
      tft.setCursor(5, yPos);
      tft.print(formatHamalertTftTime(hamalertSpots[i].time));

      tft.setTextColor(TFT_WHITE);
      tft.setCursor(74, yPos);
      String callText = hamalertSpots[i].callsign;
      if (callText.length() > 8) callText = callText.substring(0, 8);
      tft.print(callText);

      tft.setTextColor(TFT_YELLOW);
      tft.setCursor(204, yPos);
      tft.print(hamalertSpots[i].frequency, 3);

      tft.setTextColor(TFT_GREEN);
      tft.setCursor(330, yPos);
      String modeText = hamalertSpots[i].mode;
      if (modeText.length() > 4) modeText = modeText.substring(0, 4);
      tft.print(modeText);

      yPos += 27;
    } else {
      if (displayCount % 2 == 0) {
        tft.fillRect(0, yPos - 2, 480, 16, TFT_TABLE_ALT_ROW_COLOR);
      }

      tft.setTextSize(1);

      tft.setTextColor(TFT_LIGHTGREY);
      tft.setCursor(5, yPos);
      tft.print(formatHamalertTftTime(hamalertSpots[i].time));

      tft.setTextColor(TFT_WHITE);
      tft.setCursor(50, yPos);
      tft.print(hamalertSpots[i].callsign);

