Tom50505050/esp32-ham-clock/src/main.cpp
      tft.setTextColor(TFT_YELLOW);
      tft.setCursor(125, yPos);
      tft.print(hamalertSpots[i].frequency, 3);

      tft.setTextColor(TFT_GREEN);
      tft.setCursor(240, yPos);
      tft.print(hamalertSpots[i].mode);

      tft.setTextColor(TFT_RADIO_ORANGE);
      tft.setCursor(220, yPos);
      String countryText = formatDistanceOrCountry(hamalertSpots[i], COUNTRY_COL_MAX_LEN);
      tft.print(countryText);

      yPos += 17;
    }
    displayCount++;
  }

  if (displayCount == 0) {
    tft.setTextColor(TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(40, 120);
    tft.print("WAITING FOR SPOTS...");
  }
  
  // Strzałki nawigacyjne - ZAWSZE rysuj po odświeżeniu tabeli
  drawSwitchScreenFooter();
}

bool readRawTouchPoint(int16_t &rx, int16_t &ry) {
  if (!touch.touched()) {
    return false;
  }
  TS_Point p = touch.getPoint();
  rx = p.x;
  ry = p.y;
  return true;
}

void mapRawToScreenWithValues(int16_t rx, int16_t ry,
                              int xmin, int xmax, int ymin, int ymax,
                              bool swapXY, bool invertX, bool invertY,
                              uint16_t &x, uint16_t &y) {
  int16_t mx = rx;
  int16_t my = ry;

  if (swapXY) {
    int16_t tmp = mx;
    mx = my;
    my = tmp;
  }
  if (invertX) {
    mx = xmax - (mx - xmin);
  }
  if (invertY) {
    my = ymax - (my - ymin);
  }

  mx = constrain(mx, xmin, xmax);
  my = constrain(my, ymin, ymax);

  int screenW = tft.width();
  int screenH = tft.height();
  x = map(mx, xmin, xmax, 0, screenW - 1);
  y = map(my, ymin, ymax, 0, screenH - 1);
}

void mapRawToScreen(int16_t rx, int16_t ry, uint16_t &x, uint16_t &y) {
  mapRawToScreenWithValues(rx, ry, touchXMin, touchXMax, touchYMin, touchYMax,
                           touchSwapXY, touchInvertX, touchInvertY, x, y);
}

bool readTouchPoint(uint16_t &x, uint16_t &y) {
  int16_t rx = 0;
  int16_t ry = 0;
  if (!readRawTouchPoint(rx, ry)) {
    return false;
  }
  mapRawToScreen(rx, ry, x, y);
  return true;
}

const int SCREEN_ORDER_COUNT = 12;//SCREEN_PAGE_COUNT;

ScreenType normalizeScreenType(uint8_t raw) {
  switch (raw) {
    case SCREEN_HAM_CLOCK:
    case SCREEN_DX_CLUSTER:
    case SCREEN_SUN_SPOTS:
    case SCREEN_BAND_INFO:
    case SCREEN_WEATHER_DSP:
    case SCREEN_WEATHER_FORECAST:
    case SCREEN_APRS_IS:
    case SCREEN_APRS_RADAR:
    case SCREEN_POTA_CLUSTER:
    case SCREEN_HAMALERT_CLUSTER:
    case SCREEN_PSK_MAP:
    case SCREEN_MATRIX_CLOCK:
    case SCREEN_UNLIS_HUNTER:
      return (ScreenType)raw;
    default:
      return SCREEN_OFF;
  }
}

const char* screenTypeToCodeStr(ScreenType t) {
  switch (t) {
    case SCREEN_HAM_CLOCK: return "hamclock";
    case SCREEN_DX_CLUSTER: return "dxcluster";
    case SCREEN_APRS_IS: return "aprsis";
    case SCREEN_APRS_RADAR: return "aprsradar";
    case SCREEN_BAND_INFO: return "bandinfo";
    case SCREEN_SUN_SPOTS: return "sunspots";
    case SCREEN_WEATHER_DSP: return "weather";
    case SCREEN_WEATHER_FORECAST: return "weatherforecast";
    case SCREEN_POTA_CLUSTER: return "pota";
    case SCREEN_HAMALERT_CLUSTER: return "hamalert";
    case SCREEN_PSK_MAP: return "pskmap";
    case SCREEN_MATRIX_CLOCK: return "matrix";
    case SCREEN_UNLIS_HUNTER: return "unlishunter";
    case SCREEN_OFF:
    default:
      return "off";
  }
}

ScreenType screenCodeToType(const String &code) {
  String c = code;
  c.toLowerCase();
  c.trim();
  if (c == "hamclock") return SCREEN_HAM_CLOCK;
  if (c == "dxcluster") return SCREEN_DX_CLUSTER;
  if (c == "aprsis") return SCREEN_APRS_IS;
  if (c == "aprsradar") return SCREEN_APRS_RADAR;
  if (c == "bandinfo") return SCREEN_BAND_INFO;
  if (c == "sunspots") return SCREEN_SUN_SPOTS;
  if (c == "weather") return SCREEN_WEATHER_DSP;
  if (c == "weatherforecast" || c == "forecast") return SCREEN_WEATHER_FORECAST;
  if (c == "pota") return SCREEN_POTA_CLUSTER;
  if (c == "hamalert") return SCREEN_HAMALERT_CLUSTER;
  if (c == "pskmap" || c == "pskreporter") return SCREEN_PSK_MAP;
  if (c == "matrix") return SCREEN_MATRIX_CLOCK;
  if (c == "unlishunter") return SCREEN_UNLIS_HUNTER;
  return SCREEN_OFF;
}

void loadDefaultScreenOrder() {
  for (int i = 0; i < SCREEN_ORDER_COUNT; i++) {
    screenOrder[i] = DEFAULT_SCREEN_ORDER[i];
  }
}

void ensureScreenOrderValid() {
  bool hasActive = false;
  bool seen[13] = {false}; // indeksy odpowiadają ScreenType wartościom (0..12)
  for (int i = 0; i < SCREEN_ORDER_COUNT; i++) {
    screenOrder[i] = normalizeScreenType(screenOrder[i]);
    ScreenType t = screenOrder[i];
    if (t != SCREEN_OFF) {
      if (t >= 0 && t <= SCREEN_WEATHER_FORECAST) {
        if (seen[t]) {
          // drugi raz ten sam ekran â€“ usuń duplikat
          screenOrder[i] = SCREEN_OFF;
          continue;
        }
        seen[t] = true;
      }
      hasActive = true;
    }
  }
  if (!hasActive) {
    loadDefaultScreenOrder();
  }
}

int findScreenOrderIndex(ScreenType screenId) {
  for (int i = 0; i < SCREEN_ORDER_COUNT; i++) {
    if (screenOrder[i] == screenId) {
      return i;
    }
  }
  return 0;
}

ScreenType firstActiveScreen() {
  for (int i = 0; i < SCREEN_ORDER_COUNT; i++) {
    if (screenOrder[i] != SCREEN_OFF) {
      return screenOrder[i];
    }
  }
  return SCREEN_HAM_CLOCK;
}

ScreenType getNextScreenId(ScreenType currentId) {
  int idx = findScreenOrderIndex(currentId);
  for (int step = 1; step <= SCREEN_ORDER_COUNT; step++) {
    ScreenType candidate = screenOrder[(idx + step) % SCREEN_ORDER_COUNT];
    if (candidate != SCREEN_OFF) {
      return candidate;
    }
  }
  return SCREEN_HAM_CLOCK;
}

ScreenType getPrevScreenId(ScreenType currentId) {
  int idx = findScreenOrderIndex(currentId);
  for (int step = 1; step <= SCREEN_ORDER_COUNT; step++) {
    int prev = idx - step;
    if (prev < 0) {
      prev += SCREEN_ORDER_COUNT;
    }
    ScreenType candidate = screenOrder[prev];
    if (candidate != SCREEN_OFF) {
      return candidate;
    }
  }
  return SCREEN_HAM_CLOCK;
}

static int normalizeTftAutoSwitchTimeSec(int seconds) {
  if (seconds < 1) return 1;
  if (seconds > 3600) return 3600;
  return seconds;
}

static void applyTftAutoSwitchTimeSec(int seconds) {
  tftAutoSwitchTimeSec = normalizeTftAutoSwitchTimeSec(seconds);
}

static void resetTftAutoSwitchTimer() {
  tftAutoSwitchLastMs = millis();
  tftAutoSwitchLastScreen = currentScreen;
}

void drawQrzPopup();
void handleQrzPopupTouch(uint16_t x, uint16_t y);
void openQrzPopup(const String &callsign);

void handleTouchNavigation() {
  if (!tftInitialized) {
    return;
  }

