Tom50505050/esp32-ham-clock/src/main.cpp
  const uint16_t menuHitW = 50;
  const uint16_t menuHitH = 50;

  static bool touchActive = false;
  static unsigned long lastTouchMs = 0;
  static unsigned long touchStartMs = 0;
  static uint16_t touchStartX = 0;
  static uint16_t touchStartY = 0;
  static bool longPressHandled = false;
  static bool matrixGameHoldCandidate = false;
  unsigned long now = millis();

  uint16_t x = 0;
  uint16_t y = 0;
  int16_t rawX = 0;
  int16_t rawY = 0;
  if (readRawTouchPoint(rawX, rawY)) {
    mapRawToScreen(rawX, rawY, x, y);
    resetScreenSaverActivity();  // Reset wygaszacza przy aktywności użytkownika
    bool isNewTap = false;
    if (!touchActive) {
      if ((now - lastTouchMs) <= 150) {
        return;
      }
      touchActive = true;
      lastTouchMs = now;
      touchStartMs = now;
      touchStartX = x;
      touchStartY = y;
      longPressHandled = false;
      matrixGameHoldCandidate = (currentScreen == SCREEN_MATRIX_CLOCK && !inMenu && x >= 320 && y <= 80);
      isNewTap = true;
    }

    if (touchCalActive) {
      handleTouchCalibrationTouch(rawX, rawY, x, y, isNewTap);
      return;
    }

    if (aprsAlertScreenActive) {
      if (isNewTap && isAprsAlertCloseButtonHit(x, y)) {
        dismissAprsAlertScreen();
      }
      return;
    }

    // Obsługa wygaszacza ekranu - dotknięcie wchodzi w menu ustawień
    if (screenSaverActive) {
      if (isNewTap) {
        resetScreenSaverActivity();
        inMenu = true;
        screenSaverMenuActive = true;
        drawScreenSaverMenu();
      }
      return;
    }

    if (!brightnessMenuActive && !longPressHandled && matrixGameHoldCandidate) {
      if (currentScreen == SCREEN_MATRIX_CLOCK && !inMenu && (now - touchStartMs) >= 2000) {
        currentScreen = SCREEN_UNLIS_HUNTER;
        drawScreen(currentScreen);
        resetTftAutoSwitchTimer();
        longPressHandled = true;
        matrixGameHoldCandidate = false;
        return;
      }
    }

    if (!brightnessMenuActive && !longPressHandled) {
      if (now - touchStartMs >= 3000) {
        brightnessMenuPrevScreen = currentScreen;
        brightnessMenuPrevInMenu = inMenu;
        brightnessMenuPrevBacklight = backlightPercent;
        brightnessMenuPrevThemeHue = menuThemeHue;
        brightnessMenuActive = true;
        brightnessMenuValue = backlightPercent;
        brightnessMenuOpenedMs = now;
        inMenu = true;
        drawBrightnessMenu();
        longPressHandled = true;
        return;
      }
    }

    if (brightnessMenuActive) {
      handleBrightnessMenuTouch(x, y, isNewTap);
      return;
    }

    if (!isNewTap) {
      return;
    }

    if (currentScreen == SCREEN_UNLIS_HUNTER) {
      if (x >= UNLIS_EXIT_X && x < (UNLIS_EXIT_X + UNLIS_BTN_SIZE) &&
          y >= UNLIS_EXIT_Y && y < (UNLIS_EXIT_Y + UNLIS_BTN_SIZE)) {
        currentScreen = SCREEN_MATRIX_CLOCK;
        drawScreen(currentScreen);
        resetTftAutoSwitchTimer();
        return;
      }
      if (x >= UNLIS_START_X && x < (UNLIS_START_X + UNLIS_BTN_SIZE) &&
          y >= UNLIS_START_Y && y < (UNLIS_START_Y + UNLIS_BTN_SIZE)) {
        if (unlisRunning && !unlisGameOver) {
          unlisStopGame();
        } else {
          unlisStartResetGame();
        }
        return;
      }
      if (x >= UNLIS_PTT_X && x < (UNLIS_PTT_X + UNLIS_BTN_SIZE) &&
          y >= UNLIS_PTT_Y && y < (UNLIS_PTT_Y + UNLIS_BTN_SIZE)) {
        unlisHandlePttPress(now);
        return;
      }
      return;
    }

    if (inMenu) {
      if (screenSaverMenuActive) {
        handleScreenSaverMenuTouch(x, y);
        return;
      }
      if (currentScreen == SCREEN_HAM_CLOCK) {
        handleScreen1MenuTouch(x, y);
      }
      if (currentScreen == SCREEN_DX_CLUSTER) {
        handleScreen2MenuTouch(x, y);
      }
      if (currentScreen == SCREEN_POTA_CLUSTER) {
        handleScreen7MenuTouch(x, y);
      }
      if (currentScreen == SCREEN_HAMALERT_CLUSTER) {
        handleScreen8MenuTouch(x, y);
      }
      if (currentScreen == SCREEN_APRS_IS || currentScreen == SCREEN_APRS_RADAR) {
        handleScreen6MenuTouch(x, y);
      }
      if (currentScreen == SCREEN_WEATHER_DSP || currentScreen == SCREEN_WEATHER_FORECAST) {
        handleScreen5MenuTouch(x, y);
      }
      return;
    }

    if (qrzPopupActive) {
      handleQrzPopupTouch(x, y);
      return;
    }

    if (currentScreen == SCREEN_DX_CLUSTER) {
      if (x < menuHitW && y < menuHitH) {
          inMenu = true;
          drawDxClusterFilterMenu();
          return;
        }
      // Kliknięcie w znak (callsign) - sprawdź czy dotknięto wiersza z spotem
      if (y >= 40 && y < 280 && x >= 50 && x <= 200) {
        // Oblicz który wiersz został dotknięty
        int rowHeight = isDxTableEnlarged() ? 27 : 20;
        int headerOffset = 40;
        int clickedRow = (y - headerOffset) / rowHeight;
        if (clickedRow >= 0) {
          // Znajdź spot w tablicy
          lockDxSpots();
          int displayCount = 0;
          for (int i = 0; i < spotCount; i++) {
            if (!spotMatchesScreen2Filters(spots[i])) continue;
            if (displayCount == clickedRow) {
              // Kliknięto w ten spot
              String callsign = spots[i].callsign;
              unlockDxSpots();
              openQrzPopup(callsign);
              return;
            }
            displayCount++;
          }
          unlockDxSpots();
        }
      }
    }
    if (currentScreen == SCREEN_POTA_CLUSTER) {
        if (x < menuHitW && y < menuHitH) {
          inMenu = true;
          drawPotaFilterMenu();
          return;
        }
      // Kliknięcie w znak (callsign) - sprawdź czy dotknięto wiersza z spotem
      if (y >= 40 && y < 280 && x >= 50 && x <= 200) {
        // Oblicz który wiersz został dotknięty
        int rowHeight = isDxTableEnlarged() ? 27 : 20;
        int headerOffset = 40;
        int clickedRow = (y - headerOffset) / rowHeight;
        if (clickedRow >= 0) {
          // Znajdź spot w tablicy POTA
          int displayCount = 0;
          for (int i = 0; i < potaSpotCount; i++) {
            if (!spotMatchesScreen7Filters(potaSpots[i])) continue;
            if (displayCount == clickedRow) {
              // Kliknięto w ten spot
              String callsign = potaSpots[i].callsign;
              openQrzPopup(callsign);
              return;
            }
            displayCount++;
          }
        }
      }
    }
    if (currentScreen == SCREEN_HAMALERT_CLUSTER) {
        if (x < menuHitW && y < menuHitH) {
          inMenu = true;
          drawHamalertFilterMenu();
          return;
        }
      }
      if (currentScreen == SCREEN_APRS_IS) {
      if (x < menuHitW && y < menuHitH) {
        inMenu = true;
        screen6MenuBeaconingTemp = aprsBeaconEnabled;
        screen6MenuAprsAlertTemp = aprsAlertEnabled;
        screen6MenuRangeAlertTemp = aprsAlertNearbyEnabled;
        screen6MenuLedAlertTemp = enableLedAlert;
        drawAprsSortMenu();
        return;
      }
    }
      if (currentScreen == SCREEN_APRS_RADAR) {
      if (isScreen6RadarZoomTopHit(x, y)) {
        if ((now - screen6RadarLastZoomTapMs) < SCREEN6_RADAR_ZOOM_TAP_COOLDOWN_MS) {
          return;
        }
        screen6RadarLastZoomTapMs = now;
        float newZoom = min(SCREEN6_RADAR_ZOOM_MAX, screen6RadarZoom + SCREEN6_RADAR_ZOOM_STEP);
        if (newZoom > screen6RadarZoom + 0.0001f) {
          screen6RadarZoom = newZoom;
          triggerScreen6RadarHint();
          drawScreen(SCREEN_APRS_RADAR);
          resetTftAutoSwitchTimer();
        }
        return;
      }
      if (isScreen6RadarZoomBottomHit(x, y)) {
        if ((now - screen6RadarLastZoomTapMs) < SCREEN6_RADAR_ZOOM_TAP_COOLDOWN_MS) {
          return;
        }
        screen6RadarLastZoomTapMs = now;
        float newZoom = max(SCREEN6_RADAR_ZOOM_MIN, screen6RadarZoom - SCREEN6_RADAR_ZOOM_STEP);
        if (newZoom < screen6RadarZoom - 0.0001f) {
          screen6RadarZoom = newZoom;
          triggerScreen6RadarHint();
          drawScreen(SCREEN_APRS_RADAR);
          resetTftAutoSwitchTimer();
        }
        return;
      }
      if (x < menuHitW && y < menuHitH) {
        inMenu = true;
        screen6MenuBeaconingTemp = aprsBeaconEnabled;
        screen6MenuAprsAlertTemp = aprsAlertEnabled;
        screen6MenuRangeAlertTemp = aprsAlertNearbyEnabled;
        screen6MenuLedAlertTemp = enableLedAlert;
        drawAprsSortMenu();
        return;
      }
    }
    if (currentScreen == SCREEN_HAM_CLOCK) {
      if (x > 285 && y < 35) {
        inMenu = true;
        drawHamClockTimeMenu();
        return;
      }
    }
    if (currentScreen == SCREEN_PSK_MAP) {
      handlePskMapTouch(x, y);
      return;
    }
    if (currentScreen == SCREEN_WEATHER_DSP || currentScreen == SCREEN_WEATHER_FORECAST) {
      if (x < menuHitW && y < menuHitH) {
        inMenu = true;
        drawWeatherMenu();
        return;
      }
    }

    // Nawigacja: dolne obszary dotyku (ok. 80x180)
    // Zamienione kierunki: lewa strona = w prawo (next), prawa strona = w lewo (prev)
    const uint16_t cornerY = 60;
    const uint16_t cornerX = 80;
    if (y >= cornerY && x < cornerX) {
      currentScreen = getNextScreenId(currentScreen);
      drawScreen(currentScreen);
      resetTftAutoSwitchTimer();
      LOGV_PRINTF("[TOUCH] Ekran zmieniony na: %d (tap left -> next)\n", currentScreen);
    } else if (y >= cornerY && x >= (480 - cornerX)) {
      currentScreen = getPrevScreenId(currentScreen);
      drawScreen(currentScreen);
      resetTftAutoSwitchTimer();
      LOGV_PRINTF("[TOUCH] Ekran zmieniony na: %d (tap right -> prev)\n", currentScreen);
    }
  } else {
    touchActive = false;
    longPressHandled = false;
    matrixGameHoldCandidate = false;
    // Reset liczników long-press dla menu jasności po puszczeniu dotyku
    if (brightnessMenuActive) {
      brightnessMenuTouchStartMs = 0;
      brightnessMenuLongPressHandled = false;
    }
  }
}
// Ekran 2: DX Cluster
void drawDxCluster() {
  tft.fillScreen(TFT_BLACK);

  // 1. NAGÄąÂÄ‚â€śWEK: Belka z menu, nazwĂ„â€¦ klastra i czasem UTC
  tft.fillRect(0, 0, 480, 32, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);

// IKONA MENU (3D)
drawHamburgerMenuButton3D(5, 7);

// Nazwa klastra - przesunięta w prawo (x=35 zamiast 5), by zrobić miejsce na menu
tft.setTextSize(2);
tft.setCursor(35, 8);
tft.print(clusterHost);
  
  // ZEGAR - rysowany osobno przez updateDxClusterClock()

  // 2. NAGŁÓWKI TABELI
  const bool enlarged = isDxTableEnlarged();
  int yPos = 40;
  tft.setTextColor(TFT_DARKGREY);
  tft.setTextSize(1);

  if (enlarged) {
    tft.setCursor(5, yPos);   tft.print("CZAS");
    tft.setCursor(74, yPos);  tft.print("CALL");
    tft.setCursor(204, yPos); tft.print("MHz");
    tft.setCursor(330, yPos); tft.print("MODE");
  } else {
    tft.setCursor(5, yPos);   tft.print("CZAS");
    tft.setCursor(50, yPos);  tft.print("CALLSIGN");
    tft.setCursor(140, yPos); tft.print("MHz");
    tft.setCursor(260, yPos); tft.print("MODE");
    tft.setCursor(360, yPos); tft.print(sanitizePolishToAscii(String(tr(TR_COUNTRY))));
  }
  tft.drawFastHLine(0, yPos + 10, 480, TFT_DARKGREY);
  yPos += enlarged ? 20 : 18;

  // 3. LISTA SPOTÄ‚â€śW
  int maxRows = getDxTableMaxRows();
  int displayCount = 0;
  lockDxSpots();
  for (int i = 0; i < spotCount && displayCount < maxRows; i++) {
    if (!spotMatchesScreen2Filters(spots[i])) {
      continue;
    }
    if (enlarged) {
      if (displayCount % 2 == 0) tft.fillRect(0, yPos - 5, 480, 24, TFT_TABLE_ALT_ROW_COLOR);
      tft.setTextSize(2);
      tft.setTextColor(TFT_LIGHTGREY);
      tft.setCursor(5, yPos);
      tft.print(formatSpotUtc(spots[i].time));

      tft.setTextColor(TFT_WHITE);
      tft.setCursor(74, yPos);
      String callText = spots[i].callsign;
      if (callText.length() > 8) callText = callText.substring(0, 8);
      tft.print(callText);

