Tom50505050/esp32-ham-clock/src/main.cpp
      tft.setTextColor(TFT_YELLOW);
      tft.setCursor(204, yPos);
      tft.print(spots[i].frequency / 1000.0, 3);

      tft.setTextColor(TFT_GREEN);
      tft.setCursor(330, yPos);
      String modeText = spots[i].mode;
      if (modeText.length() > 4) modeText = modeText.substring(0, 4);
      tft.print(modeText);
      yPos += 27;
    } else {
      if (displayCount % 2 == 0) tft.fillRect(0, yPos - 2, 480, 16, TFT_TABLE_ALT_ROW_COLOR);

      // Znak wywoławczy - rozmiar 1 (standardowy)
      tft.setTextSize(1);
      tft.setTextColor(TFT_WHITE, TFT_BLACK);
      tft.setCursor(50, yPos);
      String callStr = spots[i].callsign;
      callStr.toUpperCase();
      if (callStr.length() > 8) callStr = callStr.substring(0, 8);
      tft.print(callStr);
      
      // Częstotliwość - rozmiar 1
      tft.setTextColor(TFT_YELLOW, TFT_BLACK);
      tft.setCursor(140, yPos);
      tft.print(spots[i].frequency / 1000.0, 3);
      
      // Mode - rozmiar 1
      tft.setTextColor(TFT_GREEN, TFT_BLACK);
      tft.setCursor(260, yPos);
      String modeStr = spots[i].mode;
      if (modeStr.length() > 4) modeStr = modeStr.substring(0, 4);
      tft.print(modeStr);
      
      // Czas i kraj - rozmiar 1 (dopasowane do nagłówków)
      tft.setTextSize(1);
      tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
      tft.setCursor(5, yPos + 5);
      tft.print(formatSpotUtc(spots[i].time));
      
      tft.setTextColor(TFT_ORANGE, TFT_BLACK);
      tft.setCursor(360, yPos + 5);
      tft.print(formatDistanceOrCountry(spots[i], COUNTRY_COL_MAX_LEN));

      yPos += 20;
    }
    displayCount++;
  }
  unlockDxSpots();

  // 4. Pasek nawigacji - ZAWSZE widoczny (zmienione z 5 sekund)
  drawSwitchScreenFooter();

  if (displayCount == 0) {
    tft.setTextColor(TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(40, 120);
    tft.print("WAITING FOR SPOTS...");
  }
  drawSwitchScreenFooter(); // Dodano rysowanie strzałek nawigacyjnych
}

bool isPointInRect(uint16_t x, uint16_t y, int rx, int ry, int rw, int rh) {
  return (x >= rx && x <= (rx + rw) && y >= ry && y <= (ry + rh));
}

void drawHamburgerMenuButton3D(int x, int y) {
  const int iconW = 20;
  const int iconH = 17;
  const int pad = 3;
  const int btnX = x - pad;
  const int btnY = y - pad;
  const int btnW = iconW + (pad * 2);
  const int btnH = iconH + (pad * 2);
  const uint16_t edgeLight = lerpColor565(TFT_WHITE, TFT_RADIO_ORANGE, 140);
  const uint16_t edgeShadow = lerpColor565(TFT_BLACK, TFT_RADIO_ORANGE, 115);

  tft.fillRoundRect(btnX, btnY, btnW, btnH, 3, TFT_RADIO_ORANGE);
  tft.drawRoundRect(btnX, btnY, btnW, btnH, 3, edgeLight);
  tft.drawLine(btnX + 1, btnY + btnH - 1, btnX + btnW - 2, btnY + btnH - 1, edgeShadow);
  tft.drawLine(btnX + btnW - 1, btnY + 1, btnX + btnW - 1, btnY + btnH - 2, edgeShadow);

  tft.fillRect(x, y, iconW, 3, TFT_BLACK);
  tft.fillRect(x, y + 7, iconW, 3, TFT_BLACK);
  tft.fillRect(x, y + 14, iconW, 3, TFT_BLACK);
}

static void drawScreen6ViewToggleButton3D(int x, int y, Screen6ViewMode mode) {
  const int iconW = 20;
  const int iconH = 17;
  const int pad = 3;
  const int btnX = x - pad;
  const int btnY = y - pad;
  const int btnW = iconW + (pad * 2);
  const int btnH = iconH + (pad * 2);
  const uint16_t edgeLight = lerpColor565(TFT_WHITE, TFT_RADIO_ORANGE, 140);
  const uint16_t edgeShadow = lerpColor565(TFT_BLACK, TFT_RADIO_ORANGE, 115);

  tft.fillRoundRect(btnX, btnY, btnW, btnH, 3, TFT_RADIO_ORANGE);
  tft.drawRoundRect(btnX, btnY, btnW, btnH, 3, edgeLight);
  tft.drawLine(btnX + 1, btnY + btnH - 1, btnX + btnW - 2, btnY + btnH - 1, edgeShadow);
  tft.drawLine(btnX + btnW - 1, btnY + 1, btnX + btnW - 1, btnY + btnH - 2, edgeShadow);

  tft.setTextSize(2);
  tft.setTextColor(TFT_BLACK);
  tft.setCursor(x + 6, y + 1);
  tft.print(mode == APRS_VIEW_RADAR ? "L" : "R");
}

static bool isScreen6ViewToggleHit(uint16_t x, uint16_t y) {
  return (x >= SCREEN6_VIEW_BTN_HIT_X &&
          x <= (SCREEN6_VIEW_BTN_HIT_X + SCREEN6_VIEW_BTN_HIT_W) &&
          y >= SCREEN6_VIEW_BTN_HIT_Y &&
          y <= (SCREEN6_VIEW_BTN_HIT_Y + SCREEN6_VIEW_BTN_HIT_H));
}

static bool isScreen6RadarZoomTopHit(uint16_t x, uint16_t y) {
  if (currentScreen != SCREEN_APRS_RADAR) {
    return false;
  }
  int w = tft.width();
  int h = tft.height();
  int xMin = w / 4;
  int xMax = (3 * w) / 4;
  return (x >= xMin && x <= xMax && y < (h / 2));
}

static bool isScreen6RadarZoomBottomHit(uint16_t x, uint16_t y) {
  if (currentScreen != SCREEN_APRS_RADAR) {
    return false;
  }
  int w = tft.width();
  int h = tft.height();
  int xMin = w / 4;
  int xMax = (3 * w) / 4;
  return (x >= xMin && x <= xMax && y >= (h / 2));
}

static void triggerScreen6RadarHint() {
  screen6RadarHintUntilMs = millis() + SCREEN6_RADAR_HINT_DURATION_MS;
}

static bool isScreen6RadarHintVisible() {
  return (currentScreen == SCREEN_APRS_RADAR && millis() < screen6RadarHintUntilMs);
}

static void drawScreen6RadarZoomHints() {
  if (!isScreen6RadarHintVisible()) {
    return;
  }

  const int screenW = tft.width();
  const int screenH = tft.height();
  const char *topHint = "ZOOM +";
  const char *bottomHint = "ZOOM -";
  const int topW = (int)strlen(topHint) * 12;
  const int bottomW = (int)strlen(bottomHint) * 12;

  tft.setTextSize(2);
  tft.setTextColor(TFT_YELLOW);
  tft.setCursor((screenW - topW) / 2, 6);
  tft.print(topHint);
  tft.setCursor((screenW - bottomW) / 2, screenH - 20);
  tft.print(bottomHint);

  const uint16_t radarAlertColor = rgb565(70, 130, 190);
  int zoomPercent = (int)(screen6RadarZoom * 100.0f + 0.5f);
  float radarVisibleMaxKm = (screen6RadarZoom > 0.0f)
                              ? ((float)aprsFilterRadius / screen6RadarZoom)
                              : (float)aprsFilterRadius;

  String zoomInfo = String("ZOOM:") + String(zoomPercent) + "%";
  String rmaxInfo = String("Rmax:") + String(radarVisibleMaxKm, 1) + "km";
  String alertInfo = String("ALERT:") + String(aprsAlertDistanceKm, 1) + "km";

  const int infoX = 2;
  const int zoomY = screenH - 29;
  const int rmaxY = screenH - 19;
  const int alertY = screenH - 9;

  tft.setTextSize(1);

  int zoomW = (int)zoomInfo.length() * 6;
  int rmaxW = (int)rmaxInfo.length() * 6;
  int alertW = (int)alertInfo.length() * 6;

  tft.fillRect(infoX - 1, zoomY - 1, zoomW + 2, 10, TFT_BLACK);
  tft.fillRect(infoX - 1, rmaxY - 1, rmaxW + 2, 10, TFT_BLACK);
  tft.fillRect(infoX - 1, alertY - 1, alertW + 2, 10, TFT_BLACK);

  tft.setTextColor(TFT_LIGHTGREY);
  tft.setCursor(infoX, zoomY);
  tft.print(zoomInfo);

