Tom50505050/esp32-ham-clock/src/main.cpp
  tft.setCursor(infoX, rmaxY);
  tft.print(rmaxInfo);

  tft.setTextColor(radarAlertColor);
  tft.setCursor(infoX, alertY);
  tft.print(alertInfo);
}

static uint16_t getAprsRadarColorForStation(const APRSStation &station) {
  String symbolShort = getAPRSSymbolShort(station);
  if (symbolShort == "CAR") return TFT_RED;
  if (symbolShort == "HOUSE") return TFT_YELLOW;
  if (symbolShort == "HUMAN") return TFT_BLUE;
  return TFT_GREEN;
}

static void drawAprsRadarBody() {
  const int screenW = tft.width();
  const int screenH = tft.height();
  tft.fillRect(0, 0, screenW, screenH, TFT_BLACK);

  const int centerX = screenW / 2;
  const int centerY = screenH / 2;
  const int pad = 6;
  int baseOuterRadius = min(min(centerX - pad, screenW - centerX - pad),
                            min(centerY - pad, screenH - centerY - pad));
  if (baseOuterRadius < 20) {
    baseOuterRadius = 20;
  }

  int outerRadius = (int)(baseOuterRadius * screen6RadarZoom);
  if (outerRadius < 20) {
    outerRadius = 20;
  }

  const int fixedOuterRadius = baseOuterRadius; // nowy, stały wizualnie pierścień 100%
  const int fixedHalfRadius = max(1, fixedOuterRadius / 2); // nowy, stały wizualnie pierścień 50%

  const float zoomSafe = (screen6RadarZoom > 0.01f) ? screen6RadarZoom : 0.01f;
  const float fixedOuterKm = (aprsFilterRadius > 0)
                              ? ((float)aprsFilterRadius / zoomSafe)
                              : 0.0f;

  const uint16_t radarCircleBgColor = TFT_BLACK;
  const uint16_t radarAlertColor = rgb565(70, 130, 190);
  const uint16_t ringColor = TFT_DARKGREY;
  const int innerRadius = (aprsFilterRadius > 0)
                            ? (int)((aprsAlertDistanceKm / (float)aprsFilterRadius) * outerRadius)
                            : 0;
  const int clampedInnerRadius = constrain(innerRadius, 1, outerRadius);

  if (outerRadius <= baseOuterRadius + 2) {
    tft.fillCircle(centerX, centerY, outerRadius - 1, radarCircleBgColor);
  }

  // Dodane stałe pierścienie referencyjne na spodzie (stacje są rysowane później, nad nimi)
  tft.drawCircle(centerX, centerY, fixedOuterRadius, ringColor); // 100%
  tft.drawCircle(centerX, centerY, fixedHalfRadius, ringColor);  // 50%

  // Oryginalne okręgi radaru
  tft.drawCircle(centerX, centerY, outerRadius, TFT_WHITE);
  tft.drawCircle(centerX, centerY, clampedInnerRadius, radarAlertColor);

  tft.drawFastVLine(centerX, centerY - outerRadius, outerRadius * 2, 0x39C7);
  tft.drawFastHLine(centerX - outerRadius, centerY, outerRadius * 2, 0x39C7);

  auto kmLabel = [](float km) -> String {
    if (km >= 100.0f) return String((int)(km + 0.5f)) + "km";
    if (km >= 10.0f) return String(km, 1) + "km";
    return String(km, 2) + "km";
  };

  tft.setTextSize(1);
  tft.setTextColor(TFT_LIGHTGREY);
  String ring100Text = kmLabel(fixedOuterKm);
  String ring50Text = kmLabel(fixedOuterKm * 0.5f);

  int ringLabelX = centerX + 4;
  int ring100Y = max(0, centerY - fixedOuterRadius + 2);
  int ring50Y = max(0, centerY - fixedHalfRadius + 2);

  tft.fillRect(ringLabelX - 1, ring100Y - 1, (int)ring100Text.length() * 6 + 2, 10, TFT_BLACK);
  tft.fillRect(ringLabelX - 1, ring50Y - 1, (int)ring50Text.length() * 6 + 2, 10, TFT_BLACK);
  tft.setCursor(ringLabelX, ring100Y);
  tft.print(ring100Text);
  tft.setCursor(ringLabelX, ring50Y);
  tft.print(ring50Text);

  tft.fillCircle(centerX, centerY, 4, TFT_RADIO_ORANGE);

  int order[MAX_APRS_DISPLAY_LCD];
  int displayCount = 0;
  buildAprsDisplayOrder(order, displayCount);
  int maxRows = min(displayCount, MAX_APRS_DISPLAY_LCD);

  for (int i = 0; i < maxRows; i++) {
    const APRSStation &station = aprsStations[order[i]];
    if (!station.hasLatLon || station.distance <= 0.0f) {
      continue;
    }
    if (aprsFilterRadius <= 0 || station.distance > (float)aprsFilterRadius) {
      continue;
    }

    float bearingDeg = calculateBearing(userLat, userLon, (double)station.lat, (double)station.lon);
    float angleRad = bearingDeg * (float)M_PI / 180.0f;
    float scaledRadius = (station.distance / (float)aprsFilterRadius) * outerRadius;
    if (scaledRadius > outerRadius) {
      continue;
    }
    int px = centerX + (int)(sin(angleRad) * scaledRadius);
    int py = centerY - (int)(cos(angleRad) * scaledRadius);

    uint16_t color = getAprsRadarColorForStation(station);
    tft.fillCircle(px, py, 3, color);

    String call = station.callsign;
    if (call.length() > 8) {
      call = call.substring(0, 8);
    }
    int tx = px - ((int)call.length() * 3);
    int ty = py - 10;
    if (tx < 1) tx = 1;
    if (tx > screenW - ((int)call.length() * 6) - 1) tx = screenW - ((int)call.length() * 6) - 1;
    if (ty < 2) ty = py + 6;
    if (ty > screenH - 9) ty = screenH - 9;

    tft.setTextColor(color);
    tft.setTextSize(1);
    tft.setCursor(tx, ty);
    tft.print(call);

    if ((i & 0x03) == 0) {
      yield();
    }
  }

}

void drawFilterTile(int x, int y, int w, int h, const char *label, bool active) {
  uint16_t fill = active ? TFT_RADIO_ORANGE : TFT_DARKGREY;
  uint16_t text = active ? TFT_BLACK : TFT_WHITE;
  tft.fillRect(x, y, w, h, fill);
  tft.drawRect(x, y, w, h, TFT_BLACK);
  tft.setTextSize(1);
  tft.setTextColor(text);
  int textW = strlen(label) * 6;
  int textX = x + (w - textW) / 2;
  int textY = y + (h - 8) / 2;
  tft.setCursor(textX, textY);
  tft.print(label);
}

static void drawScreen6MenuCheckButton(int x, int y, const char *label, bool checked) {
  const int boxSize = 18;
  tft.drawRect(x, y, boxSize, boxSize, TFT_WHITE);
  if (checked) {
    tft.fillRect(x + 4, y + 4, boxSize - 8, boxSize - 8, TFT_RADIO_ORANGE);
  } else {
    tft.fillRect(x + 1, y + 1, boxSize - 2, boxSize - 2, TFT_BLACK);
  }

  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(2);
  tft.setCursor(x + boxSize + 10, y + 2);
  tft.print(label);
}

void drawDxClusterFilterMenu() {
  tft.fillScreen(TFT_BLACK);
  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(3);
  tft.setCursor(10, 8);
  tft.print("FILTERS");

  tft.setTextSize(2);
  tft.setTextColor(TFT_LIGHTGREY);
  tft.setCursor(10, 45);
  tft.print("MODE");

  const int modeTileW = 100;
  const int modeTileH = 40;
  const int modeGap = 10;
  const int modeStartX = (480 - (4 * modeTileW + 3 * modeGap)) / 2;
  const int modeY = 70;
  drawFilterTile(modeStartX + 0 * (modeTileW + modeGap), modeY, modeTileW, modeTileH, "ALL", screen2FilterMode == FILTER_MODE_ALL);
  drawFilterTile(modeStartX + 1 * (modeTileW + modeGap), modeY, modeTileW, modeTileH, "CW", screen2FilterMode == FILTER_MODE_CW);
  drawFilterTile(modeStartX + 2 * (modeTileW + modeGap), modeY, modeTileW, modeTileH, "SSB", screen2FilterMode == FILTER_MODE_SSB);
  drawFilterTile(modeStartX + 3 * (modeTileW + modeGap), modeY, modeTileW, modeTileH, "DIGI", screen2FilterMode == FILTER_MODE_DIGI);

  tft.setTextColor(TFT_LIGHTGREY);
  tft.setCursor(10, 125);
  tft.print("BAND");

  const int bandTileW = 100;
  const int bandTileH = 32;
  const int bandGap = 8;
  const int bandStartX = (480 - (4 * bandTileW + 3 * bandGap)) / 2;
  const int bandStartY = 140;
  int bandIdx = 0;
  for (int row = 0; row < 3; row++) {
    for (int col = 0; col < 4; col++) {
      if (bandIdx >= SCREEN8_FILTER_BANDS_COUNT) break;
      int x = bandStartX + col * (bandTileW + bandGap);
      int y = bandStartY + row * (bandTileH + bandGap);
      drawFilterTile(x, y, bandTileW, bandTileH, SCREEN8_FILTER_BANDS[bandIdx], screen2FilterBandIndex == bandIdx);
      bandIdx++;
    }
  }

  const int closeW = 140;
  const int closeH = 40;
  const int closeX = (480 - closeW) / 2;
  const int closeY = 275;
  drawFilterTile(closeX, closeY, closeW, closeH, "CLOSE", false);
}

void handleScreen2MenuTouch(uint16_t x, uint16_t y) {
  const int modeTileW = 100;
  const int modeTileH = 40;
  const int modeGap = 10;
  const int modeStartX = (480 - (4 * modeTileW + 3 * modeGap)) / 2;
  const int modeY = 70;

