Tom50505050/esp32-ham-clock/src/main.cpp
  for (int i = 0; i < 4; i++) {
    int rx = modeStartX + i * (modeTileW + modeGap);
    if (isPointInRect(x, y, rx, modeY, modeTileW, modeTileH)) {
      screen7FilterMode = (Screen2FilterMode)i;
      drawPotaFilterMenu();
      return;
    }
  }

  const int bandTileW = 90;
  const int bandTileH = 24;
  const int bandGap = 6;
  const int bandStartX = (480 - (3 * bandTileW + 2 * bandGap)) / 2;
  const int bandStartY = 96;
  int bandIdx = 0;
  for (int row = 0; row < 3; row++) {
    for (int col = 0; col < 3; col++) {
      if (bandIdx >= SCREEN2_FILTER_BANDS_COUNT) break;
      int rx = bandStartX + col * (bandTileW + bandGap);
      int ry = bandStartY + row * (bandTileH + bandGap);
      if (isPointInRect(x, y, rx, ry, bandTileW, bandTileH)) {
        screen7FilterBandIndex = bandIdx;
        drawPotaFilterMenu();
        return;
      }
      bandIdx++;
    }
  }

  const int closeW = 100;
  const int closeH = 26;
  const int closeX = (480 - closeW) / 2;
  const int closeY = 210;
  if (isPointInRect(x, y, closeX, closeY, closeW, closeH)) {
    inMenu = false;
    drawScreen(SCREEN_POTA_CLUSTER);
    return;
  }
}

void drawHamalertFilterMenu() {
  tft.fillScreen(TFT_BLACK);
  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(2);
  tft.setCursor(10, 6);
  tft.print("HAMALERT FILTR");

  tft.setTextSize(1);
  tft.setTextColor(TFT_LIGHTGREY);
  tft.setCursor(10, 28);
  tft.print("MODE");

  const int modeTileW = 70;
  const int modeTileH = 26;
  const int modeGap = 6;
  const int modeStartX = (480 - (4 * modeTileW + 3 * modeGap)) / 2;
  const int modeY = 40;
  drawFilterTile(modeStartX + 0 * (modeTileW + modeGap), modeY, modeTileW, modeTileH, "ALL", screen8FilterMode == FILTER_MODE_ALL);
  drawFilterTile(modeStartX + 1 * (modeTileW + modeGap), modeY, modeTileW, modeTileH, "CW", screen8FilterMode == FILTER_MODE_CW);
  drawFilterTile(modeStartX + 2 * (modeTileW + modeGap), modeY, modeTileW, modeTileH, "SSB", screen8FilterMode == FILTER_MODE_SSB);
  drawFilterTile(modeStartX + 3 * (modeTileW + modeGap), modeY, modeTileW, modeTileH, "DIGI", screen8FilterMode == FILTER_MODE_DIGI);

  tft.setTextColor(TFT_LIGHTGREY);
  tft.setCursor(10, 82);
  tft.print("BAND");

  const int bandTileW = 72;
  const int bandTileH = 24;
  const int bandGap = 6;
  const int bandStartX = (480 - (4 * bandTileW + 3 * bandGap)) / 2;
  const int bandStartY = 96;
  int bandIdx = 0;
  for (int row = 0; row < 3; row++) {
    for (int col = 0; col < 4; col++) {
      if (bandIdx >= SCREEN8_FILTER_BANDS_COUNT) break;
      int x = bandStartX + col * (bandTileW + bandGap);
      int y = bandStartY + row * (bandTileH + bandGap);
      drawFilterTile(x, y, bandTileW, bandTileH, SCREEN8_FILTER_BANDS[bandIdx], screen8FilterBandIndex == bandIdx);
      bandIdx++;
    }
  }

  const int closeW = 100;
  const int closeH = 26;
  const int closeX = (480 - closeW) / 2;
  const int closeY = 210;
  drawFilterTile(closeX, closeY, closeW, closeH, "CLOSE", false);
}

void handleScreen8MenuTouch(uint16_t x, uint16_t y) {
  const int modeTileW = 70;
  const int modeTileH = 26;
  const int modeGap = 6;
  const int modeStartX = (480 - (4 * modeTileW + 3 * modeGap)) / 2;
  const int modeY = 40;

  for (int i = 0; i < 4; i++) {
    int rx = modeStartX + i * (modeTileW + modeGap);
    if (isPointInRect(x, y, rx, modeY, modeTileW, modeTileH)) {
      screen8FilterMode = (Screen2FilterMode)i;
      drawHamalertFilterMenu();
      return;
    }
  }

  const int bandTileW = 72;
  const int bandTileH = 24;
  const int bandGap = 6;
  const int bandStartX = (480 - (4 * bandTileW + 3 * bandGap)) / 2;
  const int bandStartY = 96;
  int bandIdx = 0;
  for (int row = 0; row < 3; row++) {
    for (int col = 0; col < 4; col++) {
      if (bandIdx >= SCREEN8_FILTER_BANDS_COUNT) break;
      int rx = bandStartX + col * (bandTileW + bandGap);
      int ry = bandStartY + row * (bandTileH + bandGap);
      if (isPointInRect(x, y, rx, ry, bandTileW, bandTileH)) {
        screen8FilterBandIndex = bandIdx;
        drawHamalertFilterMenu();
        return;
      }
      bandIdx++;
    }
  }

  const int closeW = 100;
  const int closeH = 26;
  const int closeX = (480 - closeW) / 2;
  const int closeY = 210;
  if (isPointInRect(x, y, closeX, closeY, closeW, closeH)) {
    inMenu = false;
    drawScreen(SCREEN_HAMALERT_CLUSTER);
    return;
  }
}

void drawHamClockTimeMenu() {
  tft.fillScreen(TFT_BLACK);
  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(2);
  tft.setCursor(10, 6);
  tft.print("TIME MODE");

  const int tileW = 110;
  const int tileH = 28;
  const int gap = 10;
  const int startX = (480 - (2 * tileW + gap)) / 2;
  const int tileY = 60;
  drawFilterTile(startX, tileY, tileW, tileH, "UTC", screen1TimeMode == SCREEN1_TIME_UTC);
  drawFilterTile(startX + tileW + gap, tileY, tileW, tileH, "LOCAL", screen1TimeMode == SCREEN1_TIME_LOCAL);

  const int closeW = 100;
  const int closeH = 26;
  const int closeX = (480 - closeW) / 2;
  const int closeY = 210;
  drawFilterTile(closeX, closeY, closeW, closeH, "CLOSE", false);
}

void drawWeatherMenu() {
  tft.fillScreen(TFT_BLACK);
  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(2);
  tft.setCursor(10, 6);
  tft.print("WEATHER MENU");

  const int tileW = 140;
  const int tileH = 36;
  const int gap = 12;
  const int startX = (480 - (2 * tileW + gap)) / 2;
  const int tileY = 80;
  
  drawFilterTile(startX, tileY, tileW, tileH, "REFRESH", false);
  drawFilterTile(startX + tileW + gap, tileY, tileW, tileH, "FORECAST", currentScreen == SCREEN_WEATHER_FORECAST);

  const int closeW = 140;
  const int closeH = 36;
  const int closeX = (480 - closeW) / 2;
  const int closeY = 210;
  drawFilterTile(closeX, closeY, closeW, closeH, "CLOSE", false);
}

void handleScreen5MenuTouch(uint16_t x, uint16_t y) {
  const int tileW = 140;
  const int tileH = 36;
  const int gap = 12;
  const int startX = (480 - (2 * tileW + gap)) / 2;
  const int tileY = 80;

  if (isPointInRect(x, y, startX, tileY, tileW, tileH)) {
    // Refresh - force weather data update
    if (weatherApiKey.length() > 0) {
      lastWeatherFetchMs = 0; // Reset to force immediate fetch
    }
    inMenu = false;
    drawScreen(currentScreen);
    return;
  }
  if (isPointInRect(x, y, startX + tileW + gap, tileY, tileW, tileH)) {
    // Toggle between weather and forecast screen
    if (currentScreen == SCREEN_WEATHER_DSP) {
      currentScreen = SCREEN_WEATHER_FORECAST;
    } else {
      currentScreen = SCREEN_WEATHER_DSP;
    }
    inMenu = false;
    drawScreen(currentScreen);
    return;
  }

  const int closeW = 140;
  const int closeH = 36;
  const int closeX = (480 - closeW) / 2;
  const int closeY = 210;
  if (isPointInRect(x, y, closeX, closeY, closeW, closeH)) {
    inMenu = false;
    drawScreen(currentScreen);
    return;
  }
}

void handleScreen1MenuTouch(uint16_t x, uint16_t y) {
  const int tileW = 110;
  const int tileH = 28;
  const int gap = 10;
  const int startX = (480 - (2 * tileW + gap)) / 2;
  const int tileY = 60;

  if (isPointInRect(x, y, startX, tileY, tileW, tileH)) {
    screen1TimeMode = SCREEN1_TIME_UTC;
    savePreferences();
    drawHamClockTimeMenu();
    return;
  }
  if (isPointInRect(x, y, startX + tileW + gap, tileY, tileW, tileH)) {
    screen1TimeMode = SCREEN1_TIME_LOCAL;
    savePreferences();
    drawHamClockTimeMenu();
    return;
  }

  const int closeW = 100;
  const int closeH = 26;
  const int closeX = (480 - closeW) / 2;
  const int closeY = 210;
  if (isPointInRect(x, y, closeX, closeY, closeW, closeH)) {
    inMenu = false;
    drawScreen(SCREEN_HAM_CLOCK);
    return;
  }
}

