Tom50505050/esp32-ham-clock/src/main.cpp
void redrawCurrentMenu() {
  if (currentScreen == SCREEN_HAM_CLOCK) {
    drawHamClockTimeMenu();
    return;
  }
  if (currentScreen == SCREEN_DX_CLUSTER) {
    drawDxClusterFilterMenu();
    return;
  }
  if (currentScreen == SCREEN_APRS_IS || currentScreen == SCREEN_APRS_RADAR) {
    drawAprsSortMenu();
    return;
  }
  if (currentScreen == SCREEN_WEATHER_DSP || currentScreen == SCREEN_WEATHER_FORECAST) {
    drawWeatherMenu();
    return;
  }
}

void restoreAfterBrightnessMenu() {
  inMenu = brightnessMenuPrevInMenu;
  if (brightnessMenuPrevInMenu) {
    redrawCurrentMenu();
    return;
  }
  currentScreen = brightnessMenuPrevScreen;
  drawScreen(currentScreen);
}

void drawBrightnessSlider() {
  const int sliderX = 40;
  const int sliderY = 90;
  const int sliderW = 400;
  const int sliderH = 12;
  const int knobW = 6;

  // Wyczyść obszar suwaka (z zapasem na pokrętło), żeby nie zostawał ślad
  tft.fillRect(sliderX - knobW, sliderY - 6, sliderW + knobW * 2, sliderH + 12, TFT_BLACK);

  tft.drawRect(sliderX, sliderY, sliderW, sliderH, TFT_WHITE);
  int fillW = (brightnessMenuValue * (sliderW - 2)) / 100;
  tft.fillRect(sliderX + 1, sliderY + 1, sliderW - 2, sliderH - 2, TFT_BLACK);
  tft.fillRect(sliderX + 1, sliderY + 1, fillW, sliderH - 2, TFT_RADIO_ORANGE);

  int knobX = sliderX + (brightnessMenuValue * (sliderW - knobW)) / 100;
  tft.fillRect(knobX, sliderY - 4, knobW, sliderH + 8, TFT_WHITE);

  tft.setTextColor(TFT_LIGHTGREY);
  tft.setTextSize(1);
  tft.setCursor(10, 70);
  tft.print(sanitizePolishToAscii(String(tr(TR_BRIGHTNESS))));
  tft.fillRect(120, 70, 40, 8, TFT_BLACK);
  tft.setCursor(120, 70);
  tft.print(brightnessMenuValue);
  tft.print("%");
}

void drawThemeSlider() {
  const int sliderX = 40;
  const int sliderY = 130;
  const int sliderW = 400;
  const int sliderH = 12;
  const int knobW = 6;

  // Wyczyść obszar suwaka (z zapasem na pokrętło)
  tft.fillRect(sliderX - knobW, sliderY - 6, sliderW + knobW * 2, sliderH + 12, TFT_BLACK);

  for (int i = 0; i < sliderW; i++) {
    uint8_t hue = (uint8_t)((i * 255) / (sliderW - 1));
    tft.drawFastVLine(sliderX + i, sliderY + 1, sliderH - 2, colorWheel(hue));
  }
  tft.drawRect(sliderX, sliderY, sliderW, sliderH, TFT_WHITE);

  int knobX = sliderX + (menuThemeHue * (sliderW - knobW)) / 255;
  tft.fillRect(knobX, sliderY - 4, knobW, sliderH + 8, TFT_WHITE);

  tft.setTextColor(TFT_LIGHTGREY);
  tft.setTextSize(1);
  tft.setCursor(10, 110);
  tft.print(sanitizePolishToAscii(String(tr(TR_THEME_COLOR))));
}

void drawBrightnessMenuHeader() {
  tft.fillRect(0, 0, 480, 28, menuThemeColor);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  tft.setCursor(10, 6);
  tft.print(sanitizePolishToAscii(String(tr(TR_DISPLAY_SETTINGS))));
}

void drawBrightnessMenu() {
  tft.fillScreen(TFT_BLACK);
  drawBrightnessMenuHeader();

  // Podpowiedź: długi tap 3s w dowolnym miejscu uruchamia kalibrację
  tft.setTextColor(TFT_LIGHTGREY);
  tft.setTextSize(1);
  tft.setCursor(10, 40);
  tft.print(sanitizePolishToAscii(String(tr(TR_TFT_CALIBRATION_HINT))));

  drawBrightnessSlider();
  drawThemeSlider();

  const int langLabelY = 150;
  const int langTileW = 70;
  const int langTileH = 22;
  const int langGap = 10;
  const int langStartX = (480 - (2 * langTileW + langGap)) / 2;
  const int langY = 240;

  tft.setTextColor(TFT_LIGHTGREY);
  tft.setTextSize(1);
  tft.setCursor(10, langLabelY);
  tft.print(sanitizePolishToAscii(String(tr(TR_LANGUAGE))));
  drawFilterTile(langStartX, langY, langTileW, langTileH, "PL", tftLanguage == TFT_LANG_PL);
  drawFilterTile(langStartX + langTileW + langGap, langY, langTileW, langTileH, "EN", tftLanguage == TFT_LANG_EN);

  const int btnW = 90;
  const int btnH = 26;
  const int btnY = 190;
  const int btnGap = 10;
  const int saveX = 10;
  const int defaultX = saveX + btnW + btnGap;
  const int saverX = defaultX + btnW + btnGap;
  const int closeX = saverX + btnW + btnGap;
  drawFilterTile(saveX, btnY, btnW, btnH, tr(TR_SAVE), false);
  drawFilterTile(defaultX, btnY, btnW, btnH, tr(TR_DEFAULT), false);
  drawFilterTile(saverX, btnY, btnW, btnH, "WYGASZACZ", false);
  drawFilterTile(closeX, btnY, btnW, btnH, tr(TR_CLOSE), false);
}

void drawTouchCalTarget(int cx, int cy, uint16_t color) {
  tft.drawLine(cx - 10, cy, cx + 10, cy, color);
  tft.drawLine(cx, cy - 10, cx, cy + 10, color);
  tft.drawRect(cx - 12, cy - 12, 24, 24, color);
}

void drawTouchCalibrationScreen() {
  tft.fillScreen(TFT_BLACK);

  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(1);
  int centerY = 120;
  
  if (touchCalStep == 0) {
    tft.setCursor(40, centerY);
    tft.print("Touch target 1/4 (top-left)");
    drawTouchCalTarget(20, 20, TFT_RADIO_ORANGE);
  } else if (touchCalStep == 1) {
    tft.setCursor(35, centerY);
    tft.print("Touch target 2/4 (top-right)");
    drawTouchCalTarget(460, 20, TFT_RADIO_ORANGE);
  } else if (touchCalStep == 2) {
    tft.setCursor(30, centerY);
    tft.print("Touch target 3/4 (bottom-right)");
    drawTouchCalTarget(460, 300, TFT_RADIO_ORANGE);
  } else if (touchCalStep == 3) {
    tft.setCursor(35, centerY);
    tft.print("Touch target 4/4 (bottom-left)");
    drawTouchCalTarget(20, 300, TFT_RADIO_ORANGE);
  } else {
    // touchCalStep >= 4 - Review screen
    tft.setCursor(40, centerY);
    tft.print("Calibration complete - Touch to close");
    
    // Narysuj wszystkie 4 targets jako potwierdzenie
    drawTouchCalTarget(20, 20, TFT_DARKGREY);
    drawTouchCalTarget(460, 20, TFT_DARKGREY);
    drawTouchCalTarget(460, 300, TFT_DARKGREY);
    drawTouchCalTarget(20, 300, TFT_DARKGREY);
    
    tft.setTextColor(TFT_LIGHTGREY);
    tft.setCursor(10, 30);
    tft.print("Raw X: ");
    tft.print(touchCalNewXMin);
    tft.print(" - ");
    tft.print(touchCalNewXMax);
    tft.setCursor(10, 45);
    tft.print("Raw Y: ");
    tft.print(touchCalNewYMin);
    tft.print(" - ");
    tft.print(touchCalNewYMax);
    
    tft.setCursor(10, 65);
    tft.print("Detected: Swap:");
    tft.print(touchSwapXY ? "YES" : "NO");
    tft.print(" InvX:");
    tft.print(touchInvertX ? "YES" : "NO");
    tft.setCursor(10, 80);
    tft.print("          InvY:");
    tft.print(touchInvertY ? "YES" : "NO");
    
    // Podpowiedź do ustawienia w WWW
    tft.setTextColor(TFT_YELLOW);
    tft.setCursor(10, 145);
    tft.print("Use WWW panel >");
    tft.setTextColor(TFT_WHITE);
    tft.setCursor(10, 240);
    tft.print(sanitizePolishToAscii(String(tr(TR_TFT_CALIBRATION_HINT))));
    tft.setTextColor(TFT_GREENYELLOW);
    tft.setCursor(10, 180);
    
