Tom50505050/esp32-ham-clock/src/main.cpp
    // Ustal jaki tryb sugerować
    if (touchSwapXY && touchInvertX && touchInvertY) {
      tft.print("-> SWAP XY + INVERT BOTH");
    } else if (touchSwapXY && touchInvertX) {
      tft.print("-> ");
      tft.print(tr(TR_ROT_90_RIGHT));
    } else if (touchSwapXY && touchInvertY) {
      tft.print("-> ");
      tft.print(tr(TR_ROT_90_LEFT));
    } else if (touchSwapXY) {
      tft.print("-> SWAP XY");
    } else if (touchInvertX && touchInvertY) {
      tft.print("-> INVERT BOTH (180deg)");
    } else if (touchInvertX) {
      tft.print("-> INVERT X");
    } else if (touchInvertY) {
      tft.print("-> INVERT Y");
    } else {
      tft.print("-> NONE (default - OK)");
    }
    
    tft.setTextColor(TFT_LIGHTGREY);
    tft.setCursor(10, 210);
    tft.print("(Touch will NOT save changes)");
  }
}

void startTouchCalibration() {
  touchCalActive = true;
  touchCalStep = 0;
  touchCalRawX1 = 0;
  touchCalRawY1 = 0;
  touchCalRawX2 = 0;
  touchCalRawY2 = 0;
  touchCalRawX3 = 0;
  touchCalRawY3 = 0;
  touchCalRawX4 = 0;
  touchCalRawY4 = 0;
  touchCalNewXMin = touchXMin;
  touchCalNewXMax = touchXMax;
  touchCalNewYMin = touchYMin;
  touchCalNewYMax = touchYMax;
  drawTouchCalibrationScreen();
}

void setBrightnessFromTouch(uint16_t x) {
  const int sliderX = 40;
  const int sliderW = 400;
  int val = (int)((long)(x - sliderX) * 100 / (sliderW - 1));
  if (val < MIN_BACKLIGHT_PERCENT) val = MIN_BACKLIGHT_PERCENT;
  if (val > 100) val = 100;
  if (val != brightnessMenuValue) {
    brightnessMenuValue = val;
    setBacklightPercent(brightnessMenuValue);
    drawBrightnessSlider();
  }
}

void setThemeFromTouch(uint16_t x) {
  const int sliderX = 40;
  const int sliderW = 400;
  int val = (int)((long)(x - sliderX) * 255 / (sliderW - 1));
  if (val < 0) val = 0;
  if (val > 255) val = 255;
  uint8_t hue = (uint8_t)val;
  if (hue != menuThemeHue) {
    menuThemeHue = hue;
    applyMenuThemeFromHue();
    drawBrightnessMenuHeader();
    drawThemeSlider();
    drawBrightnessSlider();
  }
}

void handleTouchCalibrationTouch(int16_t rawX, int16_t rawY, uint16_t x, uint16_t y, bool isNewTap) {
  if (!touchCalActive || !isNewTap) {
    return;
  }

  if (touchCalStep == 0) {
    // Target 1: lewy górny (20, 20)
    touchCalRawX1 = rawX;
    touchCalRawY1 = rawY;
    touchCalStep = 1;
    drawTouchCalibrationScreen();
    return;
  }

  if (touchCalStep == 1) {
    // Target 2: prawy górny (300, 20)
    touchCalRawX2 = rawX;
    touchCalRawY2 = rawY;
    touchCalStep = 2;
    drawTouchCalibrationScreen();
    return;
  }

  if (touchCalStep == 2) {
    // Target 3: prawy dolny (300, 220)
    touchCalRawX3 = rawX;
    touchCalRawY3 = rawY;
    touchCalStep = 3;
    drawTouchCalibrationScreen();
    return;
  }

  if (touchCalStep == 3) {
    // Target 4: lewy dolny (20, 220)
    touchCalRawX4 = rawX;
    touchCalRawY4 = rawY;
    
    // Wszystkie 4 punkty zebrane - oblicz parametry
    // Min/Max ze wszystkich 4 punktów surowych
    touchCalNewXMin = min(min(touchCalRawX1, touchCalRawX2), min(touchCalRawX3, touchCalRawX4));
    touchCalNewXMax = max(max(touchCalRawX1, touchCalRawX2), max(touchCalRawX3, touchCalRawX4));
    touchCalNewYMin = min(min(touchCalRawY1, touchCalRawY2), min(touchCalRawY3, touchCalRawY4));
    touchCalNewYMax = max(max(touchCalRawY1, touchCalRawY2), max(touchCalRawY3, touchCalRawY4));
    
    // Wykryj swap: porównaj rozpiętość surowych wartości
    // Targets rozciągają się w X: 20-300 (280px) i Y: 20-220 (200px)
    // Jeśli deltaRawY > deltaRawX, osie są zamienione
    int deltaRawX = touchCalNewXMax - touchCalNewXMin;
    int deltaRawY = touchCalNewYMax - touchCalNewYMin;
    touchSwapXY = (deltaRawY > deltaRawX);
    
    // Wykryj odwrócenie osi
    // Porównaj punkt 1 (góra-lewo) z punktem 3 (dół-prawo)
    int16_t x1 = touchCalRawX1;
    int16_t y1 = touchCalRawY1;
    int16_t x3 = touchCalRawX3;
    int16_t y3 = touchCalRawY3;
    
    // Jeśli osie są zamienione, swap współrzędne przed sprawdzeniem kierunku
    if (touchSwapXY) {
      int16_t tmp = x1; x1 = y1; y1 = tmp;
      tmp = x3; x3 = y3; y3 = tmp;
    }
    
    // Target 1 (20,20) -> Target 3 (300,220): oczekujemy x3 > x1 i y3 > y1
    touchInvertX = (x3 < x1);
    touchInvertY = (y3 < y1);
    
    touchCalStep = 4;
    drawTouchCalibrationScreen();
    return;
  }

  if (touchCalStep >= 4) {
    // Dowolne dotknięcie zamyka ekran kalibracji bez zapisywania
    // Przywróć poprzednie wartości flag
    touchSwapXY = TOUCH_SWAP_XY;
    touchInvertX = TOUCH_INVERT_X;
    touchInvertY = TOUCH_INVERT_Y;
    touchCalActive = false;
    drawBrightnessMenu();
    return;
  }
}

void handleBrightnessMenuTouch(uint16_t x, uint16_t y, bool isNewTap) {
  unsigned long now = millis();
  
  if (now - brightnessMenuOpenedMs < 1500) {
    return;
  }

  // Zawsze aktualizuj znacznik startu dla bieżącego dotknięcia, zanim obsłużymy kafelki
  if (isNewTap) {
    brightnessMenuTouchStartMs = now;
    brightnessMenuLongPressHandled = false;
  }

  // Długi tap (>=5s) w dowolnym miejscu ekranu jasności uruchamia kalibrację dotyku
  if (!brightnessMenuLongPressHandled && brightnessMenuTouchStartMs > 0 && (now - brightnessMenuTouchStartMs) >= 5000) {
    brightnessMenuLongPressHandled = true;
    startTouchCalibration();
    return;
  }

  const int sliderX = 40;
  const int sliderY = 90;
  const int sliderW = 400;
  const int sliderH = 12;
  const int themeSliderY = 130;
  const int themeSliderH = 12;
  const int langTileW = 70;
  const int langTileH = 22;
  const int langGap = 10;
  const int langStartX = (480 - (2 * langTileW + langGap)) / 2;
  const int langY = 240;

  // Obsługa sliderów
  if (y >= sliderY - 6 && y <= sliderY + sliderH + 6) {
    setBrightnessFromTouch(x);
  }
  if (y >= themeSliderY - 6 && y <= themeSliderY + themeSliderH + 6) {
    setThemeFromTouch(x);
  }

  if (isNewTap) {
    if (isPointInRect(x, y, langStartX, langY, langTileW, langTileH)) {
      tftLanguage = TFT_LANG_PL;
      // Wymuś odświeżenie opisów pogody po zmianie języka
      lastWeatherFetchMs = 0;
      weatherData.valid = false;
      weatherData.forecast3hValid = false;
      weatherData.forecastNextDayValid = false;
      for (uint8_t i = 0; i < WeatherData::DETAIL_COLS; i++) {
        weatherData.detailValid[i] = false;
      }
      savePreferences();
      drawBrightnessMenu();
      return;
    }
    if (isPointInRect(x, y, langStartX + langTileW + langGap, langY, langTileW, langTileH)) {
      tftLanguage = TFT_LANG_EN;
      // Wymuś odświeżenie opisów pogody po zmianie języka
      lastWeatherFetchMs = 0;
      weatherData.valid = false;
      weatherData.forecast3hValid = false;
      weatherData.forecastNextDayValid = false;
      for (uint8_t i = 0; i < WeatherData::DETAIL_COLS; i++) {
        weatherData.detailValid[i] = false;
      }
      savePreferences();
      drawBrightnessMenu();
      return;
    }
  }

  if (!isNewTap) {
    return;
  }

  const int btnW = 90;
  const int btnH = 26;
  const int btnY = 190;
  const int btnGap = 10;
  const int saveX = 10;
  const int defaultX = saveX + btnW + btnGap;
  const int saverX = defaultX + btnW + btnGap;
  const int closeX = saverX + btnW + btnGap;

  if (isPointInRect(x, y, saveX, btnY, btnW, btnH)) {
    backlightPercent = brightnessMenuValue;
    savePreferences();
    brightnessMenuActive = false;
    restoreAfterBrightnessMenu();
    return;
  }
  if (isPointInRect(x, y, defaultX, btnY, btnW, btnH)) {
    menuThemeHue = DEFAULT_MENU_THEME_HUE;
    applyMenuThemeFromHue();
    drawBrightnessMenuHeader();
    drawThemeSlider();
    drawBrightnessSlider();
    return;
  }
  if (isPointInRect(x, y, closeX, btnY, btnW, btnH)) {
    backlightPercent = brightnessMenuPrevBacklight;
    setBacklightPercent(backlightPercent);
    menuThemeHue = brightnessMenuPrevThemeHue;
    applyMenuThemeFromHue();
    brightnessMenuActive = false;
    restoreAfterBrightnessMenu();
    return;
  }
  
  // Przycisk WYGASZACZ - otwórz menu wygaszacza
  if (isPointInRect(x, y, saverX, btnY, btnW, btnH)) {
    brightnessMenuActive = false;  // Zamknij menu jasności
    screenSaverMenuActive = true;
    drawScreenSaverMenu();
    return;
  }
}

// Ekran 6: APRS-IS
void updateScreen6Clock() {
  if (!tftInitialized || inMenu) {
    return;
  }
  if (currentScreen != SCREEN_APRS_IS && currentScreen != SCREEN_APRS_RADAR) {
    return;
  }

  static char lastDrawnTime[6] = "";
  static bool lastRadarMode = false;

  struct tm timeinfo;
  if (!getTimeWithTimezone(&timeinfo)) {
    return;
  }

  char timeBuffer[6];
  strftime(timeBuffer, 6, "%H:%M", &timeinfo);
  int timeWidth = strlen(timeBuffer) * 12;
  bool radarMode = (currentScreen == SCREEN_APRS_RADAR);
  uint16_t topClearColor = radarMode ? TFT_BLACK : TFT_RADIO_ORANGE;
  uint16_t timeColor = radarMode ? TFT_WHITE : TFT_BLACK;
  int timeY = radarMode ? 5 : 8;

  if (strcmp(lastDrawnTime, timeBuffer) == 0 && lastRadarMode == radarMode) {
    return;
  }

  int timeX = 480 - timeWidth - 4;

  tft.fillRect(timeX - 2, 4, timeWidth + 6, 24, topClearColor);
  tft.setTextColor(timeColor);
  tft.setTextSize(2);
  tft.setCursor(timeX, timeY);
  tft.print(timeBuffer);

  strncpy(lastDrawnTime, timeBuffer, sizeof(lastDrawnTime));
  lastDrawnTime[sizeof(lastDrawnTime) - 1] = '\0';
  lastRadarMode = radarMode;
}

uint32_t computeScreen6Signature() {
  // Prosty hash treÄąâ€şci tabeli (10 lub 11 stacji APRS zależnie od paska nawigacji)
  const uint32_t fnvPrime = 16777619u;
  uint32_t hash = 2166136261u;

  hash ^= (uint32_t)aprsStationCount;
  hash *= fnvPrime;
  hash ^= (uint32_t)screen6SortMode;
  hash *= fnvPrime;
  hash ^= (uint32_t)(screen6RadarZoom * 100.0f);
  hash *= fnvPrime;
  hash ^= isScreen6RadarHintVisible() ? 1u : 0u;
  hash *= fnvPrime;
  hash ^= (uint32_t)dxTableSizeMode;
  hash *= fnvPrime;
  hash ^= isTableNavFooterVisible(SCREEN_APRS_IS) ? 1u : 0u;
  hash *= fnvPrime;

  int order[MAX_APRS_DISPLAY_LCD];
  int displayCount = 0;
  buildAprsDisplayOrder(order, displayCount);
  int maxRows = getAprsTableMaxRows();
  int visibleCount = min(displayCount, maxRows);
  for (int i = 0; i < visibleCount; i++) {
    const APRSStation &s = aprsStations[order[i]];
    for (size_t j = 0; j < s.time.length(); j++) {
      hash ^= (uint8_t)s.time[j];
      hash *= fnvPrime;
    }
    for (size_t j = 0; j < s.callsign.length(); j++) {
      hash ^= (uint8_t)s.callsign[j];
      hash *= fnvPrime;
    }
    hash ^= (uint32_t)(s.lat * 1000);
    hash *= fnvPrime;
    hash ^= (uint32_t)(s.lon * 1000);
    hash *= fnvPrime;
    hash ^= (uint32_t)s.distance;
    hash *= fnvPrime;
    hash ^= (uint32_t)(s.freqMHz * 1000);
    hash *= fnvPrime;
  }

  return hash;
}

