Tom50505050/esp32-ham-clock/src/main.cpp
void updateScreen6Data() {
  if (!tftInitialized || inMenu) {
    return;
  }
  if (currentScreen != SCREEN_APRS_IS && currentScreen != SCREEN_APRS_RADAR) {
    return;
  }

  // 1) Zaktualizuj czas w nagłówku (bez pełnego odświeżania)
  updateScreen6Clock();

  // 2) Odśwież tabelę tylko gdy dane się zmieniły
  static uint32_t lastSig = 0;
  uint32_t currentSig = computeScreen6Signature();
  if (currentSig == lastSig) {
    return;
  }
  lastSig = currentSig;

  if (currentScreen == SCREEN_APRS_RADAR) {
    drawAprsRadar();
    return;
  }

  // 3) Renderuj tabelę do bufora i wypchnij jednym ruchem (bez migotania)
  const bool navVisible = isTableNavFooterVisible(SCREEN_APRS_IS);
  const bool enlarged = isDxTableEnlarged();
  const int maxRows = getAprsTableMaxRows();
  const int tableTop = TFT_TABLE_TOP;
  const int tableBottom = getTableBottomForScreen(SCREEN_APRS_IS);
  const int tableHeight = tableBottom - tableTop;
  TFT_eSprite *tableSprite = (navVisible && ensureSharedTableSprite()) ? &sharedTableSprite : nullptr;

  if (tableSprite != nullptr) {
    tableSprite->fillSprite(TFT_BLACK);

    int yPos = 8;
    tableSprite->setTextColor(TFT_DARKGREY);
    tableSprite->setTextSize(1);
    if (enlarged) {
      tableSprite->setCursor(5, yPos);   tableSprite->print("UTC");
      tableSprite->setCursor(74, yPos);  tableSprite->print("CALL");
      tableSprite->setCursor(198, yPos); tableSprite->print("KM");
      tableSprite->setCursor(224, yPos); tableSprite->print("FREQ");
    } else {
      tableSprite->setCursor(5, yPos);   tableSprite->print("UTC");
      tableSprite->setCursor(50, yPos);  tableSprite->print("CALLSIGN");
      tableSprite->setCursor(125, yPos); tableSprite->print("SYMBOL");
      tableSprite->setCursor(200, yPos); tableSprite->print("KM");
      tableSprite->setCursor(245, yPos); tableSprite->print("FREQ");
    }
    tableSprite->drawFastHLine(0, yPos + 10, 480, TFT_DARKGREY);
    yPos += enlarged ? 20 : 18;

    int order[MAX_APRS_DISPLAY_LCD];
    int displayCount = 0;
    buildAprsDisplayOrder(order, displayCount);
    int visibleCount = min(displayCount, maxRows);
    for (int i = 0; i < visibleCount; i++) {
      if (yPos >= (tableHeight - 2)) {
        break;
      }
      const APRSStation &station = aprsStations[order[i]];
      if (enlarged) {
        if (i % 2 == 0) {
          tableSprite->fillRect(0, yPos - 5, 480, 24, TFT_TABLE_ALT_ROW_COLOR);
        }

        tableSprite->setTextSize(2);

        tableSprite->setTextColor(TFT_LIGHTGREY);
        tableSprite->setCursor(5, yPos);
        String timeStr = formatAprsTimeWithTimezone(station.time);
        tableSprite->print(timeStr);

        tableSprite->setTextColor(getAprsCallsignColorForEnlarged(station));
        tableSprite->setCursor(74, yPos);
        String callText = station.callsign;
        if (callText.length() > 8) callText = callText.substring(0, 8);
        tableSprite->print(callText);

        tableSprite->setTextColor(TFT_RADIO_ORANGE);
        tableSprite->setCursor(198, yPos);
        if (station.hasLatLon && station.distance > 0) {
          tableSprite->print((int)station.distance);
        } else {
          tableSprite->print("-");
        }

        tableSprite->setTextColor(TFT_CYAN);
        tableSprite->setCursor(224, yPos);
        if (station.freqMHz > 0.0f) {
          tableSprite->print(String(station.freqMHz, 3));
        } else {
          tableSprite->print("-");
        }

        yPos += 27;
      } else {
        if (i % 2 == 0) {
          tableSprite->fillRect(0, yPos - 2, 480, 16, TFT_TABLE_ALT_ROW_COLOR);
        }

        tableSprite->setTextSize(1);

        tableSprite->setTextColor(TFT_LIGHTGREY);
        tableSprite->setCursor(5, yPos);
        String timeStr = formatAprsTimeWithTimezone(station.time);
        tableSprite->print(timeStr);

        tableSprite->setTextColor(TFT_WHITE);
        tableSprite->setCursor(50, yPos);
        tableSprite->print(station.callsign);

        String symbolShort = getAPRSSymbolShort(station);
        uint16_t symbolColor = TFT_GREEN;
        if (symbolShort == "HUMAN") {
          symbolColor = TFT_BLUE;
        } else if (symbolShort == "HOUSE") {
          symbolColor = TFT_YELLOW;
        } else if (symbolShort == "CAR") {
          symbolColor = TFT_RED;
        }
        tableSprite->setTextColor(symbolColor);
        tableSprite->setCursor(125, yPos);
        tableSprite->print(symbolShort);

        tableSprite->setTextColor(TFT_RADIO_ORANGE);
        tableSprite->setCursor(200, yPos);
        if (station.hasLatLon && station.distance > 0) {
          tableSprite->print((int)station.distance);
          tableSprite->print(" km");
        } else {
          tableSprite->print("-");
        }

        tableSprite->setTextColor(TFT_CYAN);
        tableSprite->setCursor(245, yPos);
        if (station.freqMHz > 0.0f) {
          tableSprite->print(String(station.freqMHz, 3));
        } else {
          tableSprite->print("-");
        }

        yPos += 17;
      }
    }

    if (visibleCount == 0) {
      tableSprite->setTextColor(TFT_RED);
      tableSprite->setTextSize(2);
      tableSprite->setCursor(40, 120 - tableTop);
      tableSprite->print("WAITING FOR APRS...");
    }

    tableSprite->pushSprite(0, tableTop);
    return;
  }

  // Fallback bez sprite (np. gdy zabraknie RAM)
  tft.fillRect(0, tableTop, 480, tableHeight, TFT_BLACK);

  int yPos = 40;
  tft.setTextColor(TFT_DARKGREY);
  tft.setTextSize(1);
  if (enlarged) {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(74, yPos);  tft.print("CALL");
    tft.setCursor(198, yPos); tft.print("KM");
    tft.setCursor(224, yPos); tft.print("FREQ");
  } else {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(50, yPos);  tft.print("CALLSIGN");
    tft.setCursor(125, yPos); tft.print("SYMBOL");
    tft.setCursor(200, yPos); tft.print("KM");
    tft.setCursor(245, yPos); tft.print("FREQ");
  }
  tft.drawFastHLine(0, yPos + 10, 480, TFT_DARKGREY);
  yPos += enlarged ? 20 : 18;

  int order[MAX_APRS_DISPLAY_LCD];
  int displayCount = 0;
  buildAprsDisplayOrder(order, displayCount);
  int visibleCount = min(displayCount, maxRows);
  for (int i = 0; i < visibleCount; i++) {
    if (yPos >= (tableBottom - 2)) {
      break;
    }
    const APRSStation &station = aprsStations[order[i]];
    if (enlarged) {
      if (i % 2 == 0) {
        tft.fillRect(0, yPos - 5, 480, 24, TFT_TABLE_ALT_ROW_COLOR);
      }

      tft.setTextSize(2);

      tft.setTextColor(TFT_LIGHTGREY);
      tft.setCursor(5, yPos);
      String timeStr = formatAprsTimeWithTimezone(station.time);
      tft.print(timeStr);

      tft.setTextColor(getAprsCallsignColorForEnlarged(station));
      tft.setCursor(74, yPos);
      String callText = station.callsign;
      if (callText.length() > 8) callText = callText.substring(0, 8);
      tft.print(callText);

      tft.setTextColor(TFT_RADIO_ORANGE);
      tft.setCursor(198, yPos);
      if (station.hasLatLon && station.distance > 0) {
        tft.print((int)station.distance);
      } else {
        tft.print("-");
      }

