Tom50505050/esp32-ham-clock/src/main.cpp
      tft.setTextColor(TFT_CYAN);
      tft.setCursor(224, yPos);
      if (station.freqMHz > 0.0f) {
        tft.print(String(station.freqMHz, 3));
      } else {
        tft.print("-");
      }

      yPos += 27;
    } else {
      if (i % 2 == 0) {
        tft.fillRect(0, yPos - 2, 480, 16, TFT_TABLE_ALT_ROW_COLOR);
      }

      tft.setTextSize(1);

      tft.setTextColor(TFT_LIGHTGREY);
      tft.setCursor(5, yPos);
      String timeStr = formatAprsTimeWithTimezone(station.time);
      tft.print(timeStr);

      tft.setTextColor(TFT_WHITE);
      tft.setCursor(50, yPos);
      tft.print(station.callsign);

      String symbolShort = getAPRSSymbolShort(station);
      uint16_t symbolColor = TFT_GREEN;
      if (symbolShort == "HUMAN") {
        symbolColor = TFT_BLUE;
      } else if (symbolShort == "HOUSE") {
        symbolColor = TFT_YELLOW;
      } else if (symbolShort == "CAR") {
        symbolColor = TFT_RED;
      }
      tft.setTextColor(symbolColor);
      tft.setCursor(125, yPos);
      tft.print(symbolShort);

      tft.setTextColor(TFT_RADIO_ORANGE);
      tft.setCursor(200, yPos);
      if (station.hasLatLon && station.distance > 0) {
        tft.print((int)station.distance);
        tft.print(" km");
      } else {
        tft.print("-");
      }

      tft.setTextColor(TFT_CYAN);
      tft.setCursor(245, yPos);
      if (station.freqMHz > 0.0f) {
        tft.print(String(station.freqMHz, 3));
      } else {
        tft.print("-");
      }

      yPos += 17;
    }
  }

  if (visibleCount == 0) {
    tft.setTextColor(TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(40, 120);
    tft.print("WAITING FOR APRS...");
  }
  
  // Strzałki nawigacyjne - ZAWSZE rysuj po odświeżeniu tabeli
  drawSwitchScreenFooter();
}

void drawAprsIs() {
  screen6ViewMode = APRS_VIEW_LIST;
  tft.fillScreen(TFT_BLACK);

  // 1. NAGÄąÂÄ‚â€śWEK: Belka z menu, nazwĂ„â€¦ serwera i czasem UTC
  tft.fillRect(0, 0, 480, 32, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);

  // IKONA MENU (3D)
  drawHamburgerMenuButton3D(5, 7);

  // Nazwa serwera APRS-IS - przesuniĂ„â„˘ta w prawo (x=35 zamiast 5), by zrobiĂ„â€ˇ miejsce na menu
  tft.setTextSize(2);
  tft.setCursor(35, 8);
  tft.print("APRS-IS");
  
  struct tm timeinfo;
  if (getTimeWithTimezone(&timeinfo)) {
    char timeBuffer[6];
    strftime(timeBuffer, 6, "%H:%M", &timeinfo);
    int timeWidth = strlen(timeBuffer) * 12;
    tft.setCursor(480 - timeWidth - 4, 8);
    tft.print(timeBuffer);
  }

  // 2. NAGÄąÂÄ‚â€śWKI TABELI
  int yPos = 40;
  const bool enlarged = isDxTableEnlarged();
  tft.setTextColor(TFT_DARKGREY);
  tft.setTextSize(1);
  if (enlarged) {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(74, yPos);  tft.print("CALL");
    tft.setCursor(198, yPos); tft.print("KM");
    tft.setCursor(224, yPos); tft.print("FREQ");
  } else {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(50, yPos);  tft.print("CALLSIGN");
    tft.setCursor(125, yPos); tft.print("SYMBOL");
    tft.setCursor(200, yPos); tft.print("KM");
  }
  tft.drawFastHLine(0, yPos + 10, 480, TFT_DARKGREY);
  yPos += enlarged ? 20 : 18;

  // 3. LISTA STACJI APRS (10 z paskiem nawigacji, 11 bez)
  int order[MAX_APRS_DISPLAY_LCD];
  int maxRows = getAprsTableMaxRows();
  int displayCount = 0;
  buildAprsDisplayOrder(order, displayCount);
  int visibleCount = min(displayCount, maxRows);
  for (int i = 0; i < visibleCount; i++) {
    const APRSStation &station = aprsStations[order[i]];
    if (enlarged) {
      if (i % 2 == 0) tft.fillRect(0, yPos - 5, 480, 24, TFT_TABLE_ALT_ROW_COLOR);

      tft.setTextSize(2);
      tft.setTextColor(TFT_LIGHTGREY);
      tft.setCursor(5, yPos);
      String timeStr = formatAprsTimeWithTimezone(station.time);
      tft.print(timeStr);

      tft.setTextColor(getAprsCallsignColorForEnlarged(station));
      tft.setCursor(74, yPos);
      String callText = station.callsign;
      if (callText.length() > 8) callText = callText.substring(0, 8);
      tft.print(callText);

      tft.setTextColor(TFT_RADIO_ORANGE);
      tft.setCursor(198, yPos);
      if (station.hasLatLon && station.distance > 0) {
        tft.print((int)station.distance);
      } else {
        tft.print("-");
      }

      tft.setTextColor(TFT_CYAN);
      tft.setCursor(224, yPos);
      if (station.freqMHz > 0.0f) {
        tft.print(String(station.freqMHz, 3));
      } else {
        tft.print("-");
      }

      yPos += 27;
    } else {
      if (i % 2 == 0) tft.fillRect(0, yPos - 2, 480, 16, TFT_TABLE_ALT_ROW_COLOR);

      tft.setTextSize(1);
      tft.setTextColor(TFT_LIGHTGREY);
      tft.setCursor(5, yPos);
      String timeStr = formatAprsTimeWithTimezone(station.time);
      tft.print(timeStr);

      tft.setTextColor(TFT_WHITE);
      tft.setCursor(50, yPos);
      tft.print(station.callsign);

      String symbolShort = getAPRSSymbolShort(station);
      uint16_t symbolColor = TFT_GREEN;
      if (symbolShort == "HUMAN") {
        symbolColor = TFT_BLUE;
      } else if (symbolShort == "HOUSE") {
        symbolColor = TFT_YELLOW;
      } else if (symbolShort == "CAR") {
        symbolColor = TFT_RED;
      }
      tft.setTextColor(symbolColor);
      tft.setCursor(125, yPos);
      tft.print(symbolShort);

      tft.setTextColor(TFT_RADIO_ORANGE);
      tft.setCursor(200, yPos);
      if (station.hasLatLon && station.distance > 0) {
        tft.print((int)station.distance);
        tft.print(" km");
      } else {
        tft.print("-");
      }

      yPos += 17;
    }
  }

  // 4. Pasek nawigacji - ZAWSZE widoczny
  drawSwitchScreenFooter();

  if (visibleCount == 0) {
    tft.setTextColor(TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(40, 120);
    tft.print("WAITING FOR APRS...");
  }
}

void drawAprsRadar() {
  screen6ViewMode = APRS_VIEW_RADAR;
  tft.fillScreen(TFT_BLACK);
  drawAprsRadarBody();

  drawHamburgerMenuButton3D(5, 7);

  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(2);
  const char *aprsTitleTop = "APRS";
  const char *aprsTitleBottom = "RADAR";
  int aprsTopWidth = strlen(aprsTitleTop) * 12;
  int aprsBottomWidth = strlen(aprsTitleBottom) * 12;
  int aprsTopX = tft.width() - aprsTopWidth - 4;
  int aprsBottomX = tft.width() - aprsBottomWidth - 4;
  tft.setCursor(aprsTopX, tft.height() - 36);
  tft.print(aprsTitleTop);
  tft.setCursor(aprsBottomX, tft.height() - 20);
  tft.print(aprsTitleBottom);

  struct tm timeinfo;
  if (getTimeWithTimezone(&timeinfo)) {
    char timeBuffer[6];
    strftime(timeBuffer, 6, "%H:%M", &timeinfo);
    int timeWidth = strlen(timeBuffer) * 12;
    tft.setCursor(tft.width() - timeWidth - 4, 5);
    tft.print(timeBuffer);
  }

  drawScreen6RadarZoomHints();
}

static String extractXmlTagValue(const String &xml, const char* tag) {
  String openTag = "<" + String(tag) + ">";
  String closeTag = "</" + String(tag) + ">";
  int start = xml.indexOf(openTag);
  if (start < 0) return "";
  start += openTag.length();
  int end = xml.indexOf(closeTag, start);
  if (end < 0) return "";
  return xml.substring(start, end);
}

static String extractBandCondition(const String &xml, const char* bandName, const char* timeName) {
  String token = "<band name=\"" + String(bandName) + "\" time=\"" + String(timeName) + "\">";
  int start = xml.indexOf(token);
  if (start < 0) return "";
  start += token.length();
  int end = xml.indexOf("</band>", start);
  if (end < 0) return "";
  return xml.substring(start, end);
}

static void setPropagationBandDefaults(PropagationData &out) {
  out.hfBandLabel[0] = "80m-40m";
  out.hfBandFreq[0] = "3.5-7.3 MHz";
  out.hfBandLabel[1] = "30m-20m";
  out.hfBandFreq[1] = "10.1-14.35 MHz";
  out.hfBandLabel[2] = "17m-15m";
  out.hfBandFreq[2] = "18.068-21.45 MHz";
  out.hfBandLabel[3] = "12m-10m";
  out.hfBandFreq[3] = "24.89-29.7 MHz";

