Tom50505050/esp32-ham-clock/src/main.cpp
  for (int i = 0; i < 4; i++) {
    out.hfBandDay[i] = "--";
    out.hfBandNight[i] = "--";
  }
}

// Konwertuje czas UTC z hamqsl.com (format: "DD Mon YYYY at HHMM UTC") na czas lokalny
static String convertPropagationTimeToLocal(const String &utcTime) {
  if (utcTime.length() == 0 || utcTime == "--") return utcTime;
  
  // Sprawdź czy zawiera "UTC" - jeśli nie, zwróć oryginał
  int utcPos = utcTime.indexOf("UTC");
  if (utcPos < 0) return utcTime;
  
  // Sprawdź czy zawiera "at" - format: "DD Mon YYYY at HHMM UTC"
  int atPos = utcTime.indexOf(" at ");
  if (atPos < 0) return utcTime;
  
  // Wyciągnij czas HHMM
  int timeStart = atPos + 4; // Po " at "
  String timePart = utcTime.substring(timeStart, utcPos - 1); // -1 aby usunąć spację przed UTC
  timePart.trim();
  
  if (timePart.length() < 4) return utcTime;
  
  // Parsuj godzinę i minutę
  int hour = timePart.substring(0, 2).toInt();
  int minute = timePart.substring(2, 4).toInt();
  
  // Dodaj offset strefy czasowej i DST
  int dstOffset = 0;
  time_t now = time(nullptr);
  if (now > 100000) {
    struct tm utcTm;
    gmtime_r(&now, &utcTm);
    dstOffset = isEuropeanDST(&utcTm) ? 1 : 0;
  }
  int localHour = hour + timezoneHours + dstOffset;
  
  // Obsługa przejścia przez północ
  while (localHour < 0) localHour += 24;
  while (localHour >= 24) localHour -= 24;
  
  // Sformatuj lokalny czas
  String hh = (localHour < 10 ? "0" : "") + String(localHour);
  String mm = (minute < 10 ? "0" : "") + String(minute);
  
  // Zwróć sformatowany czas lokalny zachowując datę
  String datePart = utcTime.substring(0, atPos);
  return datePart + " " + hh + mm + " LOC";
}

static bool parsePropagationXml(const String &xml, PropagationData &out) {
  setPropagationBandDefaults(out);

  String sfi = extractXmlTagValue(xml, "solarflux");
  String kindex = extractXmlTagValue(xml, "kindex");
  String aindex = extractXmlTagValue(xml, "aindex");
  String updated = extractXmlTagValue(xml, "updated");

  sfi.trim();
  kindex.trim();
  aindex.trim();
  updated.trim();

  if (sfi.length() == 0 || kindex.length() == 0) {
    return false;
  }

  out.sfi = sfi;
  out.kindex = kindex;
  out.aindex = aindex.length() ? aindex : "--";
  out.updated = updated.length() ? convertPropagationTimeToLocal(updated) : "--";
  out.valid = true;
  out.lastError = "";
  out.fetchedAtMs = millis();

  for (int i = 0; i < 4; i++) {
    String day = extractBandCondition(xml, out.hfBandLabel[i].c_str(), "day");
    String night = extractBandCondition(xml, out.hfBandLabel[i].c_str(), "night");
    day.trim();
    night.trim();
    if (day.length() > 0) out.hfBandDay[i] = day;
    if (night.length() > 0) out.hfBandNight[i] = night;
  }

  return true;
}

bool fetchPropagationData() {
  if (WiFi.status() != WL_CONNECTED) {
    propagationData.lastError = "WiFi offline";
    return false;
  }

  WiFiClientSecure client;
  client.setInsecure();

  HTTPClient http;
  http.setTimeout(8000);
  if (!http.begin(client, PROPAGATION_URL)) {
    propagationData.lastError = "HTTP begin failed";
    return false;
  }

  int httpCode = http.GET();
  if (httpCode != HTTP_CODE_OK) {
    propagationData.lastError = "HTTP " + String(httpCode);
    http.end();
    return false;
  }

  String payload = http.getString();
  http.end();

  if (!parsePropagationXml(payload, propagationData)) {
    propagationData.lastError = "Parse error";
    propagationData.valid = false;
    return false;
  }

  return true;
}

void updateScreen3Clock() {
  if (!tftInitialized || currentScreen != 3 || inMenu) {
    return;
  }

  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, 1)) {
    return;
  }

  char timeBuffer[10];
  strftime(timeBuffer, 10, "%H:%M Z", &timeinfo);
  int timeWidth = strlen(timeBuffer) * 12;
  int timeX = 315 - timeWidth;

  tft.fillRect(timeX - 2, 4, timeWidth + 6, 24, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  tft.setCursor(timeX, 8);
  tft.print(timeBuffer);
}

uint32_t computeScreen3Signature() {
  const uint32_t fnvPrime = 16777619u;
  uint32_t hash = 2166136261u;

  hash ^= (uint32_t)propagationData.valid;
  hash *= fnvPrime;

  const String* fields[] = {
    &propagationData.sfi,
    &propagationData.kindex,
    &propagationData.aindex,
    &propagationData.updated,
    &propagationData.lastError
  };
  for (const String* field : fields) {
    for (size_t i = 0; i < field->length(); i++) {
      hash ^= (uint8_t)(*field)[i];
      hash *= fnvPrime;
    }
  }

  return hash;
}

static uint16_t conditionColor(String cond) {
  String up = cond;
  up.toUpperCase();
  if (up.indexOf("GOOD") >= 0) return TFT_GREEN;
  if (up.indexOf("FAIR") >= 0) return TFT_YELLOW;
  if (up.indexOf("POOR") >= 0) return TFT_RED;
  return TFT_LIGHTGREY;
}

void drawSunSpotsBody() {
  const int bodyTop = 32;
  const int bodyBottom = 220;
  tft.fillRect(0, bodyTop, 480, bodyBottom - bodyTop, TFT_BLACK);

  String sfiText = propagationData.valid && propagationData.sfi.length() ? propagationData.sfi : "--";
  String kText = propagationData.valid && propagationData.kindex.length() ? propagationData.kindex : "--";
  String aText = propagationData.valid && propagationData.aindex.length() ? propagationData.aindex : "--";
  String updatedText = propagationData.valid && propagationData.updated.length() ? propagationData.updated : "--";

  tft.setTextSize(2);
  tft.setTextColor(TFT_DARKGREY);
  tft.setCursor(10, 52);
  tft.print("SFI");

  tft.setTextSize(4);
  tft.setTextColor(TFT_GREEN);
  int sfiWidth = sfiText.length() * 24;
  tft.setCursor(460 - sfiWidth, 44);
  tft.print(sfiText);

  tft.setTextSize(2);
  tft.setTextColor(TFT_DARKGREY);
  tft.setCursor(10, 100);
  tft.print("K-INDEX");

  float kVal = kText.length() ? kText.toFloat() : -1.0f;
  uint16_t kColor = TFT_LIGHTGREY;
  if (kVal >= 0.0f) {
    kColor = (kVal < 4.0f) ? TFT_GREEN : (kVal < 6.0f) ? TFT_ORANGE : TFT_RED;
  }
  tft.setTextSize(4);
  tft.setTextColor(kColor);
  int kWidth = kText.length() * 24;
  tft.setCursor(460 - kWidth, 92);
  tft.print(kText);

  tft.setTextSize(2);
  tft.setTextColor(TFT_DARKGREY);
  tft.setCursor(10, 148);
  tft.print("A-INDEX");

