Tom50505050/esp32-ham-clock/src/main.cpp
  tft.setTextSize(4);
  tft.setTextColor(TFT_CYAN);
  int aWidth = aText.length() * 24;
  tft.setCursor(460 - aWidth, 140);
  tft.print(aText);

  tft.setTextSize(1);
  tft.setTextColor(TFT_DARKGREY);
  tft.setCursor(10, 190);
  tft.print("UPDATED");
  tft.setTextSize(2);
  tft.setTextColor(TFT_LIGHTGREY);
  tft.setCursor(10, 202);
  tft.print(updatedText);

  if (!propagationData.valid) {
    tft.setTextSize(1);
    tft.setTextColor(TFT_RED);
    tft.setCursor(10, 176);
    String err = propagationData.lastError.length() ? propagationData.lastError : tr(TR_NO_DATA);
    tft.print(sanitizePolishToAscii(String(tr(TR_ERROR_PREFIX))));
    tft.print(err);
  }
}

void updateScreen3Data() {
  if (!tftInitialized || currentScreen != 3 || inMenu) {
    return;
  }

  updateScreen3Clock();

  static uint32_t lastSig = 0;
  uint32_t currentSig = computeScreen3Signature();
  if (currentSig == lastSig) {
    return;
  }
  lastSig = currentSig;

  drawSunSpotsBody();
}

void drawSunSpots() {
  tft.fillScreen(TFT_BLACK);

  tft.fillRect(0, 0, 480, 32, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);

  // brak hamburger menu na ekranie Propagation

  tft.setTextSize(2);
  tft.setCursor(35, 8);
  tft.print((tftLanguage == TFT_LANG_EN) ? "PROPAGATION" : "PROPAGACJA");

  // Wyłączono - zegar tylko na górnym pasku
  /*
  struct tm timeinfo;
  if (getLocalTime(&timeinfo, 1)) {
    char timeBuffer[10];
    strftime(timeBuffer, 10, "%H:%M Z", &timeinfo);
    int timeWidth = strlen(timeBuffer) * 12;
    tft.setCursor(460 - timeWidth, 8);
    tft.print(timeBuffer);
  }
  */

  drawSunSpotsBody();

  // Strzałki nawigacyjne - duże, blisko krawędzi (takie same na wszystkich ekranach)
  int arrowY = 290;
  int arrowSize = 12;
  tft.fillTriangle(15, arrowY, 15 + arrowSize, arrowY - arrowSize, 15 + arrowSize, arrowY + arrowSize, TFT_RADIO_ORANGE);
  tft.fillTriangle(465, arrowY, 465 - arrowSize, arrowY - arrowSize, 465 - arrowSize, arrowY + arrowSize, TFT_RADIO_ORANGE);
  tft.setTextColor(0x52AA);
  tft.setTextSize(1);
  tft.setCursor(195, 286);
  tft.print("SWITCH SCREEN");
}

void updateScreen4Clock() {
  if (!tftInitialized || currentScreen != 4 || inMenu) {
    return;
  }

  struct tm timeinfo;
  if (!getTimeWithTimezone(&timeinfo)) {
    return;
  }

  char timeBuffer[6];
  strftime(timeBuffer, 6, "%H:%M", &timeinfo);
  int timeWidth = strlen(timeBuffer) * 12;
  int timeX = 475 - timeWidth;

  tft.fillRect(timeX - 2, 4, timeWidth + 6, 24, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  tft.setCursor(timeX, 8);
  tft.print(timeBuffer);
}

uint32_t computeScreen4Signature() {
  const uint32_t fnvPrime = 16777619u;
  uint32_t hash = 2166136261u;

  hash ^= (uint32_t)propagationData.valid;
  hash *= fnvPrime;

  for (int i = 0; i < 4; i++) {
    const String* fields[] = {
      &propagationData.hfBandLabel[i],
      &propagationData.hfBandFreq[i],
      &propagationData.hfBandDay[i],
      &propagationData.hfBandNight[i]
    };
    for (const String* field : fields) {
      for (size_t j = 0; j < field->length(); j++) {
        hash ^= (uint8_t)(*field)[j];
        hash *= fnvPrime;
      }
    }
  }

  for (size_t j = 0; j < propagationData.updated.length(); j++) {
    hash ^= (uint8_t)propagationData.updated[j];
    hash *= fnvPrime;
  }
  for (size_t j = 0; j < propagationData.lastError.length(); j++) {
    hash ^= (uint8_t)propagationData.lastError[j];
    hash *= fnvPrime;
  }

  return hash;
}

void drawBandInfoBody() {
  const int bodyTop = 32;
  const int bodyBottom = 220;
  tft.fillRect(0, bodyTop, 480, bodyBottom - bodyTop, TFT_BLACK);

  int yPos = 40;
  tft.setTextColor(TFT_DARKGREY);
  tft.setTextSize(2);
  tft.setCursor(5, yPos);
  tft.print("BAND");
  tft.setCursor(150, yPos);
  tft.print("DAY");
  tft.setCursor(320, yPos);
  tft.print("NIGHT");
  tft.drawFastHLine(0, yPos + 30, 480, TFT_DARKGREY);
  yPos += 26; //byÄąâ€šo 16

  for (int i = 0; i < 4; i++) {
    if (i % 2 == 0) {
      tft.fillRect(0, yPos - 2, 480, 28, TFT_TABLE_ALT_ROW_COLOR);
    }

    tft.setTextSize(2);
    tft.setTextColor(TFT_LIGHTGREY);
    tft.setCursor(5, yPos);
    tft.print(propagationData.hfBandLabel[i]);

    //tft.setTextColor(TFT_DARKGREY);
    //tft.setCursor(5, yPos + 9);
    //tft.print(propagationData.hfBandFreq[i]);

    tft.setTextSize(2);
    tft.setTextColor(conditionColor(propagationData.hfBandDay[i]));
    tft.setCursor(150, yPos - 2);
    tft.print(propagationData.hfBandDay[i]);

    tft.setTextColor(conditionColor(propagationData.hfBandNight[i]));
    tft.setCursor(320, yPos - 2);
    tft.print(propagationData.hfBandNight[i]);

    yPos += 30;
  }

  tft.setTextSize(1);
  tft.setTextColor(TFT_DARKGREY);
  tft.setCursor(10, 190);
  tft.print("UPDATED");
  tft.setTextSize(2);
  tft.setTextColor(TFT_LIGHTGREY);
  tft.setCursor(10, 202);
  tft.print(propagationData.updated.length() ? propagationData.updated : "--");

  if (!propagationData.valid) {
    tft.setTextSize(1);
    tft.setTextColor(TFT_RED);
    tft.setCursor(10, 176);
    String err = propagationData.lastError.length() ? propagationData.lastError : tr(TR_NO_DATA);
    tft.print(sanitizePolishToAscii(String(tr(TR_ERROR_PREFIX))));
    tft.print(err);
  }
}

void updateScreen4Data() {
  if (!tftInitialized || currentScreen != 4 || inMenu) {
    return;
  }

  // Wyłączono - zegar tylko na górnym pasku
  // updateScreen4Clock();

  static uint32_t lastSig = 0;
  uint32_t currentSig = computeScreen4Signature();
  if (currentSig == lastSig) {
    return;
  }
  lastSig = currentSig;

  drawBandInfoBody();
}

void drawBandInfo() {
  tft.fillScreen(TFT_BLACK);

  tft.fillRect(0, 0, 480, 32, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);

  int menuX = 8;
  int menuY = 10;
  //tft.fillRect(menuX, menuY, 18, 3, TFT_BLACK);
  //tft.fillRect(menuX, menuY + 6, 18, 3, TFT_BLACK);
  //tft.fillRect(menuX, menuY + 12, 18, 3, TFT_BLACK);

  tft.setTextSize(2);
  tft.setCursor(35, 8);
  tft.print("HF BAND INFO");

  // ZEGAR - rysowany osobno przez updateBandInfoClock()

  drawBandInfoBody();

  // Strzałki nawigacyjne - duże, blisko krawędzi (takie same na wszystkich ekranach)
  int arrowY = 290;
  int arrowSize = 12;
  tft.fillTriangle(15, arrowY, 15 + arrowSize, arrowY - arrowSize, 15 + arrowSize, arrowY + arrowSize, TFT_RADIO_ORANGE);
  tft.fillTriangle(465, arrowY, 465 - arrowSize, arrowY - arrowSize, 465 - arrowSize, arrowY + arrowSize, TFT_RADIO_ORANGE);
  tft.setTextColor(0x52AA);
  tft.setTextSize(1);
  tft.setCursor(195, 286);
  tft.print("SWITCH SCREEN");
}

bool fetchWeatherForecast(double lat, double lon);

bool fetchWeatherData() {
  if (WiFi.status() != WL_CONNECTED) {
    weatherData.lastError = "WiFi offline";
    weatherData.valid = false;
    return false;
  }
  if (weatherApiKey.length() == 0) {
    weatherData.lastError = "No API key";
    weatherData.valid = false;
    return false;
  }

