Tom50505050/esp32-ham-clock/src/main.cpp
  double lat = 0.0;
  double lon = 0.0;
  if (userLatLonValid) {
    lat = userLat;
    lon = userLon;
  } else if (userLocator.length() >= 4) {
    locatorToLatLon(userLocator, lat, lon);
  } else {
    weatherData.lastError = "No locator";
    weatherData.valid = false;
    return false;
  }

  // Reset prognoz przed nowym pobraniem
  weatherData.forecast3hValid = false;
  weatherData.forecastNextDayValid = false;
  for (uint8_t i = 0; i < WeatherData::DETAIL_COLS; i++) {
    weatherData.detailValid[i] = false;
  }

  WiFiClientSecure client;
  client.setInsecure();

  String langParam = (tftLanguage == TFT_LANG_EN) ? "en" : "pl";
  String url = "https://api.openweathermap.org/data/2.5/weather?lat=" +
               String(lat, 4) + "&lon=" + String(lon, 4) +
               "&appid=" + weatherApiKey + "&units=metric&lang=" + langParam;

  HTTPClient http;
  http.setTimeout(8000);
  if (!http.begin(client, url)) {
    weatherData.lastError = "HTTP begin failed";
    weatherData.valid = false;
    return false;
  }

  int httpCode = http.GET();
  if (httpCode != HTTP_CODE_OK) {
    weatherData.lastError = "HTTP " + String(httpCode);
    weatherData.valid = false;
    http.end();
    return false;
  }

  WiFiClient *stream = http.getStreamPtr();

  DynamicJsonDocument filter(512);
  filter["cod"] = true;
  filter["message"] = true;
  filter["name"] = true;
  filter["weather"][0]["description"] = true;
  filter["weather"][0]["icon"] = true;
  filter["weather"][0]["id"] = true;
  filter["main"]["temp"] = true;
  filter["main"]["humidity"] = true;
  filter["main"]["pressure"] = true;
  filter["wind"]["speed"] = true;

  DynamicJsonDocument doc(1536);
  DeserializationError err = deserializeJson(doc, *stream, DeserializationOption::Filter(filter));
  http.end();
  if (err) {
    weatherData.lastError = "JSON error";
    weatherData.valid = false;
    return false;
  }

  int cod = doc["cod"] | 0;
  if (cod != 200) {
    String msg = doc["message"] | "";
    weatherData.lastError = msg.length() ? msg : "API error";
    weatherData.valid = false;
    return false;
  }

  String desc = doc["weather"][0]["description"] | "";
  String cityName = doc["name"] | "";
  String icon = doc["weather"][0]["icon"] | ""; // 01d / 01n itp. do wykrycia pory dnia
  int weatherId = doc["weather"][0]["id"] | 800; // pobieranie kodu pogody
  float temp = doc["main"]["temp"] | 0.0f;
  int humidity = doc["main"]["humidity"] | 0;
  int pressure = doc["main"]["pressure"] | 0;
  float wind = doc["wind"]["speed"] | 0.0f;


  if (desc.equalsIgnoreCase("zachmurzenie umiarkowane")) {
    desc = "zachmurzenie";
  }

  weatherData.description = desc.length() ? desc : "--";
  weatherData.cityName = cityName;
  weatherData.iconCode = icon;
  weatherData.weatherId = weatherId; // kod pogody
  weatherData.tempC = temp;
  weatherData.humidity = humidity;
  weatherData.pressure = pressure;
  weatherData.windMs = wind;

  struct tm timeinfo;
  if (getLocalTime(&timeinfo, 1)) {
    char timeBuf[6];
    strftime(timeBuf, sizeof(timeBuf), "%H:%M", &timeinfo);
    weatherData.updated = String(timeBuf);
  } else {
    weatherData.updated = "--:--";
  }

  weatherData.valid = true;
  weatherData.lastError = "";
  weatherData.fetchedAtMs = millis();

  // Prognozy (3h i jutro)
  fetchWeatherForecast(lat, lon);

  // Pobierz dane o jakoÄąâ€şci powietrza (PM2.5 i PM10)
  fetchAirPollutionData(lat, lon);

  return true;
}

bool fetchWeatherForecast(double lat, double lon) {
  if (WiFi.status() != WL_CONNECTED || weatherApiKey.length() == 0) {
    return false;
  }

  WiFiClientSecure client;
  client.setInsecure();

  String langParam = (tftLanguage == TFT_LANG_EN) ? "en" : "pl";
  String url = "https://api.openweathermap.org/data/2.5/forecast?lat=" +
               String(lat, 4) + "&lon=" + String(lon, 4) +
               "&appid=" + weatherApiKey + "&units=metric&lang=" + langParam + "&cnt=40";

  HTTPClient http;
  http.setTimeout(8000);
  if (!http.begin(client, url)) {
    return false;
  }

  int httpCode = http.GET();
  if (httpCode != HTTP_CODE_OK) {
    http.end();
    return false;
  }

  WiFiClient *stream = http.getStreamPtr();

  DynamicJsonDocument filter(1024);
  filter["list"][0]["dt"] = true;
  filter["list"][0]["main"]["temp"] = true;
  filter["list"][0]["main"]["humidity"] = true;
  filter["list"][0]["wind"]["speed"] = true;
  filter["list"][0]["weather"][0]["description"] = true;
  filter["list"][0]["weather"][0]["id"] = true;
  filter["list"][0]["weather"][0]["icon"] = true;
  filter["city"]["name"] = true;

  DynamicJsonDocument doc(16384);
  DeserializationError err = deserializeJson(doc, *stream, DeserializationOption::Filter(filter));
  http.end();
  if (err) {
    return false;
  }

  JsonArray list = doc["list"].as<JsonArray>();
  if (list.isNull() || list.size() == 0) {
    return false;
  }

  if (weatherData.cityName.length() == 0) {
    String cityFromForecast = doc["city"]["name"] | "";
    if (cityFromForecast.length() > 0) {
      weatherData.cityName = cityFromForecast;
    }
  }

  const long nowUnix = (long)time(nullptr);
  const long targetOffsetsSec[WeatherData::DETAIL_COLS] = {
    3L * 3600L,
    6L * 3600L,
    24L * 3600L,
    48L * 3600L,
    72L * 3600L
  };
  const int fallbackIdx[WeatherData::DETAIL_COLS] = {0, 1, 8, 16, 24};
  
  // Uwzględnij DST (czas letni) w obliczeniach strefy czasowej
  struct tm utcTm;
  time_t nowTimeT = (time_t)nowUnix;
  gmtime_r(&nowTimeT, &utcTm);
  int dstOffset = isEuropeanDST(&utcTm) ? 1 : 0;
  const long timezoneOffsetSec = (long)(timezoneHours + dstOffset) * 3600L;
  
  const long nowLocalUnix = nowUnix + timezoneOffsetSec;
  const long baseLocalDayStart = (nowLocalUnix / 86400L) * 86400L;

  weatherData.nightTempValid[0] = false;
  weatherData.nightTempValid[1] = false;

  auto assignSlot = [&](uint8_t slot, JsonObject entry) {
    weatherData.detailTempC[slot] = entry["main"]["temp"] | 0.0f;
    weatherData.detailHumidity[slot] = entry["main"]["humidity"] | 0;
    weatherData.detailWindMs[slot] = entry["wind"]["speed"] | 0.0f;
    weatherData.detailWeatherId[slot] = entry["weather"][0]["id"] | 800;
    weatherData.detailIconCode[slot] = String((const char *)(entry["weather"][0]["icon"] | ""));
    weatherData.detailValid[slot] = true;
  };

