Tom50505050/esp32-ham-clock/src/main.cpp
  for (uint8_t slot = 0; slot < WeatherData::DETAIL_COLS; slot++) {
    int chosenIdx = -1;

    // Dla slotów 0 i 1 (+3h, +6h) - znajdź najbliższy czas do target
    // Dla slotów 2+ (dni) - znajdź najlepsze dopasowanie dnia (południe)
    if (slot >= 2 && nowUnix > 100000L) {
      const long targetDayStartLocal = baseLocalDayStart + (long)(slot - 1) * 86400L;
      const long targetNoonLocal = targetDayStartLocal + 12L * 3600L;
      long bestScore = 0x7FFFFFFF;

      for (uint16_t i = 0; i < list.size(); i++) {
        JsonObject entry = list[i];
        long dt = entry["dt"] | 0L;
        if (dt <= 0L) {
          continue;
        }

        long dtLocal = dt + timezoneOffsetSec;
        long entryDayStartLocal = (dtLocal / 86400L) * 86400L;
        if (entryDayStartLocal != targetDayStartLocal) {
          continue;
        }

        int localHour = (int)((dtLocal % 86400L) / 3600L);
        bool isDayHour = (localHour >= 9 && localHour <= 18);
        String iconCode = String((const char *)(entry["weather"][0]["icon"] | ""));
        bool iconIsDay = iconCode.endsWith("d");
        bool isDayCandidate = isDayHour || iconIsDay;

        long score = labs(dtLocal - targetNoonLocal);
        if (!isDayCandidate) {
          score += 12L * 3600L;
        }

        if (score < bestScore) {
          bestScore = score;
          chosenIdx = (int)i;
        }
      }
    }

    // Dla slotów 0 i 1 (+3h, +6h) lub jeśli nie znaleziono dopasowania dnia
    if (chosenIdx < 0 && nowUnix > 100000L) {
      long target = nowUnix + targetOffsetsSec[slot];
      long bestDiff = 0x7FFFFFFF;

      for (uint16_t i = 0; i < list.size(); i++) {
        JsonObject entry = list[i];
        long dt = entry["dt"] | 0L;
        if (dt <= 0L) {
          continue;
        }
        long diff = labs(dt - target);
        if (diff < bestDiff) {
          bestDiff = diff;
          chosenIdx = (int)i;
        }
      }
    }

    // Fallback gdy czas niezsynchronizowany lub brak dopasowania - użyj indeksów fallback
    if (chosenIdx < 0) {
      int idx = fallbackIdx[slot];
      if (idx < (int)list.size()) {
        chosenIdx = idx;
      } else if (list.size() > 0) {
        chosenIdx = list.size() - 1;  // Ostatni dostępny element
      }
    }

    if (chosenIdx >= 0 && chosenIdx < (int)list.size()) {
      assignSlot(slot, list[chosenIdx]);
    }
  }

  for (uint8_t daySlot = 0; daySlot < 2; daySlot++) {
    const long targetDayStartLocal = baseLocalDayStart + (long)(daySlot + 1) * 86400L;
    int bestNightIdx = -1;
    long bestNightScore = 0x7FFFFFFF;
    int bestAnyIdx = -1;
    float bestAnyTemp = 1000.0f;

    for (uint16_t i = 0; i < list.size(); i++) {
      JsonObject entry = list[i];
      long dt = entry["dt"] | 0L;
      if (dt <= 0L) {
        continue;
      }

      long dtLocal = dt + timezoneOffsetSec;
      long entryDayStartLocal = (dtLocal / 86400L) * 86400L;
      if (entryDayStartLocal != targetDayStartLocal) {
        continue;
      }

      float temp = entry["main"]["temp"] | 0.0f;
      if (bestAnyIdx < 0 || temp < bestAnyTemp) {
        bestAnyTemp = temp;
        bestAnyIdx = (int)i;
      }

      int localHour = (int)((dtLocal % 86400L) / 3600L);
      bool isNightHour = (localHour <= 6 || localHour >= 21);
      if (!isNightHour) {
        continue;
      }

      int refHour = (localHour >= 21) ? 24 + localHour : localHour;
      int refTarget = 26; // 02:00 w oknie 21..30
      long score = labs((long)refHour - (long)refTarget);
      if (score < bestNightScore) {
        bestNightScore = score;
        bestNightIdx = (int)i;
      }
    }

    int chosenNightIdx = (bestNightIdx >= 0) ? bestNightIdx : bestAnyIdx;
    if (chosenNightIdx >= 0 && chosenNightIdx < (int)list.size()) {
      JsonObject entry = list[chosenNightIdx];
      weatherData.nightTempC[daySlot] = entry["main"]["temp"] | 0.0f;
      weatherData.nightTempValid[daySlot] = true;
    }
  }

  if (weatherData.detailValid[0]) {
    weatherData.forecast3hTempC = weatherData.detailTempC[0];
    weatherData.forecast3hWindMs = weatherData.detailWindMs[0];
    weatherData.forecast3hDesc = "--";
    weatherData.forecast3hValid = true;
  }

  if (weatherData.detailValid[2]) {
    weatherData.forecastNextDayTempC = weatherData.detailTempC[2];
    weatherData.forecastNextDayWindMs = weatherData.detailWindMs[2];
    weatherData.forecastNextDayDesc = "--";
    weatherData.forecastNextDayValid = true;
  }

  bool anyDetailValid = false;
  for (uint8_t i = 0; i < WeatherData::DETAIL_COLS; i++) {
    if (weatherData.detailValid[i]) {
      anyDetailValid = true;
      break;
    }
  }

  return anyDetailValid;
}

bool fetchAirPollutionData(double lat, double lon) {
  if (WiFi.status() != WL_CONNECTED || weatherApiKey.length() == 0) {
    Serial.println("[AIR] No WiFi or API key");
    return false;
  }

  WiFiClientSecure client;
  client.setInsecure();

  String url = "https://api.openweathermap.org/data/2.5/air_pollution?lat=" +
               String(lat, 4) + "&lon=" + String(lon, 4) +
               "&appid=" + weatherApiKey;

  HTTPClient http;
  http.setTimeout(8000);
  if (!http.begin(client, url)) {
    return false;
  }

  int httpCode = http.GET();
  if (httpCode != HTTP_CODE_OK) {
    http.end();
    return false;
  }

  WiFiClient *stream = http.getStreamPtr();

  DynamicJsonDocument filter(256);
  filter["list"][0]["components"]["pm2_5"] = true;
  filter["list"][0]["components"]["pm10"] = true;

  DynamicJsonDocument doc(768);
  DeserializationError err = deserializeJson(doc, *stream, DeserializationOption::Filter(filter));
  http.end();
  if (err) {
    return false;
  }

  // Pobierz wartoÄąâ€şci PM2.5 i PM10 z komponentÄ‚łw
  JsonArray list = doc["list"].as<JsonArray>();
  if (list.isNull() || list.size() == 0) {
    return false;
  }

  JsonObject listItem = list[0];
  JsonObject components = listItem["components"].as<JsonObject>();
  if (components.isNull()) {
    Serial.println("[AIR] No components data");
    return false;
  }

