Tom50505050/esp32-ham-clock/src/main.cpp
  weatherData.pm25 = components["pm2_5"] | 0.0f;
  weatherData.pm10 = components["pm10"] | 0.0f;
  Serial.print("[AIR] PM2.5: ");
  Serial.print(weatherData.pm25);
  Serial.print(", PM10: ");
  Serial.println(weatherData.pm10);
  return true;
}

// Funkcja okreÄąâ€şlajĂ„â€¦ca kolor na podstawie wartoÄąâ€şci PM2.5
uint16_t getPM25Color(float pm25) {
  if (pm25 <= 12) return TFT_GREEN;      // Dobra
  if (pm25 <= 35) return TFT_YELLOW;     // Umiarkowana
  if (pm25 <= 55) return TFT_ORANGE;     // Niezdrowa dla wraÄąÄ˝liwych
  if (pm25 <= 150) return TFT_RED;       // Niezdrowa
  return 0xF800; // Ciemny czerwony - Bardzo niezdrowa
}

// Funkcja okreÄąâ€şlajĂ„â€¦ca kolor na podstawie wartoÄąâ€şci PM10
uint16_t getPM10Color(float pm10) {
  if (pm10 <= 20) return TFT_GREEN;      // Dobra
  if (pm10 <= 50) return TFT_YELLOW;     // Umiarkowana
  if (pm10 <= 100) return TFT_ORANGE;   // Niezdrowa dla wraÄąÄ˝liwych
  if (pm10 <= 200) return TFT_RED;      // Niezdrowa
  return 0xF800; // Ciemny czerwony - Bardzo niezdrowa
}

void updateScreen5Clock() {
  if (!tftInitialized ||
      (currentScreen != SCREEN_WEATHER_DSP && currentScreen != SCREEN_WEATHER_FORECAST) ||
      inMenu) {
    return;
  }

  struct tm timeinfo;
  if (!getTimeWithTimezone(&timeinfo)) {
    return;
  }

  char timeBuffer[6];
  strftime(timeBuffer, 6, "%H:%M", &timeinfo);
  int timeWidth = strlen(timeBuffer) * 12;
  int timeX = 475 - timeWidth;

  tft.fillRect(timeX - 2, 4, timeWidth + 6, 24, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  tft.setCursor(timeX, 8);
  tft.print(timeBuffer);
}

uint32_t computeScreen5Signature() {
  const uint32_t fnvPrime = 16777619u;
  uint32_t hash = 2166136261u;

  hash ^= (uint32_t)weatherData.valid;
  hash *= fnvPrime;
  bool footerVisible = (currentScreen == SCREEN_WEATHER_FORECAST)
                       ? isTableNavFooterVisible(SCREEN_WEATHER_FORECAST)
                       : isTableNavFooterVisible(SCREEN_WEATHER_DSP);
  hash ^= footerVisible ? 1u : 0u;
  hash *= fnvPrime;

  const String* fields[] = {&weatherData.cityName, &weatherData.description, &weatherData.updated, &weatherData.lastError};
  for (const String* field : fields) {
    for (size_t j = 0; j < field->length(); j++) {
      hash ^= (uint8_t)(*field)[j];
      hash *= fnvPrime;
    }
  }
  hash ^= (uint32_t)(weatherData.tempC * 10);
  hash *= fnvPrime;
  hash ^= (uint32_t)weatherData.humidity;
  hash *= fnvPrime;
  hash ^= (uint32_t)weatherData.pressure;
  hash *= fnvPrime;
  hash ^= (uint32_t)(weatherData.windMs * 10);
  hash *= fnvPrime;
  hash ^= (uint32_t)(weatherData.pm25 * 10);
  hash *= fnvPrime;
  hash ^= (uint32_t)(weatherData.pm10 * 10);
  hash *= fnvPrime;

  // Prognozy
  hash ^= (uint32_t)weatherData.forecast3hValid;
  hash *= fnvPrime;
  hash ^= (uint32_t)(weatherData.forecast3hTempC * 10);
  hash *= fnvPrime;
  hash ^= (uint32_t)(weatherData.forecast3hWindMs * 10);
  hash *= fnvPrime;
  for (size_t j = 0; j < weatherData.forecast3hDesc.length(); j++) {
    hash ^= (uint8_t)weatherData.forecast3hDesc[j];
    hash *= fnvPrime;
  }

  hash ^= (uint32_t)weatherData.forecastNextDayValid;
  hash *= fnvPrime;
  hash ^= (uint32_t)(weatherData.forecastNextDayTempC * 10);
  hash *= fnvPrime;
  hash ^= (uint32_t)(weatherData.forecastNextDayWindMs * 10);
  hash *= fnvPrime;
  for (size_t j = 0; j < weatherData.forecastNextDayDesc.length(); j++) {
    hash ^= (uint8_t)weatherData.forecastNextDayDesc[j];
    hash *= fnvPrime;
  }

  for (uint8_t i = 0; i < WeatherData::DETAIL_COLS; i++) {
    hash ^= (uint32_t)weatherData.detailValid[i];
    hash *= fnvPrime;
    hash ^= (uint32_t)(weatherData.detailTempC[i] * 10);
    hash *= fnvPrime;
    hash ^= (uint32_t)weatherData.detailHumidity[i];
    hash *= fnvPrime;
    hash ^= (uint32_t)(weatherData.detailWindMs[i] * 10);
    hash *= fnvPrime;
    hash ^= (uint32_t)weatherData.detailWeatherId[i];
    hash *= fnvPrime;
    for (size_t j = 0; j < weatherData.detailIconCode[i].length(); j++) {
      hash ^= (uint8_t)weatherData.detailIconCode[i][j];
      hash *= fnvPrime;
    }
  }

  return hash;
}

// Funkcja pomocnicza: Kolor wiatru zaleÄąÄ˝ny od prĂ„â„˘dkoÄąâ€şci (m/s)
uint16_t getWindColor(float speed) {
  if (speed < 5.0)  return TFT_GREEN;       // Bezpiecznie
  if (speed < 10.0) return TFT_YELLOW;      // Umiarkowanie
  if (speed < 15.0) return 0xFBE0;          // Silny (Orange)
  return TFT_RED;                           // Niebezpieczny dla anten
}

// Mapowanie kodu OWM na plik ikony (zgodnie z przygotowaną listą)
String weatherIconPathForId(int id, bool isNight) {
  const String base = "/icon50/";

  // 2xx burza
  if (id >= 200 && id <= 232) return base + "200.bmp";

  // 3xx mżawka
  if (id >= 300 && id <= 321) return base + "300.bmp";

  // 5xx deszcz
  if (id >= 500 && id <= 531) {
    if (id == 500 || id == 501) return base + "500.bmp";
    if (id == 502 || id == 503) return base + "502.bmp";
    if (id == 511 || id == 531) return base + "511.bmp";
    return base + "520.bmp";
  }

  // 6xx śnieg
  if (id >= 600 && id <= 622) {
    if (id == 600 || id == 601 || id == 602 || id == 620 || id == 621 || id == 622) return base + "600.bmp";
    // 611..616 (także 613/615/616) -> 611
    return base + "611.bmp";
  }

  // 7xx atmosfera
  if (id >= 700 && id <= 781) return base + "700.bmp";

  // 800 clear (dzień/noc)
  if (id == 800) return base + (isNight ? "800n.bmp" : "800.bmp");

  // 80x chmury
  if (id == 801 || id == 802) return base + (isNight ? "801n.bmp" : "801.bmp");
  if (id == 803 || id == 804) return base + "803.bmp";

  return base + "unknown.bmp";
}

// Funkcja pomocnicza: Rysowanie ikon pogodowych (priorytet: id -> plik BMP, fallback: opis)
void drawWeatherIcon(int x, int y, int weatherId, String desc) {
  desc.toLowerCase();

  // Dzień/noc z ikony OWM (np. 10d/10n). Jeśli brak, fallback na czas lokalny.
  bool isNight = false;
  if (weatherData.iconCode.endsWith("n")) {
    isNight = true;
  } else if (weatherData.iconCode.endsWith("d")) {
    isNight = false;
  } else {
    struct tm timeinfo;
    if (getLocalTime(&timeinfo, 1)) {
      isNight = (timeinfo.tm_hour < 6 || timeinfo.tm_hour >= 18);
    }
  }

  String iconFile = weatherIconPathForId(weatherId, isNight);

  // Najpierw próbujemy gotową ikonę BMP
  if (drawBmpFromFS(iconFile, x - 25, y - 25)) {
    return;
  }

