Tom50505050/esp32-ham-clock/src/main.cpp
  // Fallback: stare ikonki rysowane na podstawie opisu (gdy brak pliku)
  if (desc.indexOf("slon") >= 0 || desc.indexOf("clear") >= 0 || desc.indexOf("pogod") >= 0) {
    tft.fillCircle(x, y, 18, TFT_YELLOW); // Słońce
    for(int i=0; i<360; i+=45) {
       float rad = i * 0.01745;
       tft.drawLine(x+cos(rad)*22, y+sin(rad)*22, x+cos(rad)*32, y+sin(rad)*32, TFT_YELLOW);
    }
  } 
  else if (desc.indexOf("burz") >= 0 || desc.indexOf("thunder") >= 0) {
    tft.fillCircle(x, y-5, 12, TFT_DARKGREY); // Chmura burzowa
    tft.fillTriangle(x+2, y+8, x+10, y+8, x+4, y+22, TFT_YELLOW); // Błysk
  }
  else if (desc.indexOf("mza") >= 0 || desc.indexOf("drizzle") >= 0) {
    tft.fillCircle(x-10, y+5, 12, TFT_LIGHTGREY); // Chmura + mgławka
    tft.fillCircle(x+10, y+5, 12, TFT_LIGHTGREY);
    tft.fillCircle(x, y-5, 15, TFT_LIGHTGREY);
    tft.drawLine(x-6, y+10, x-8, y+16, TFT_CYAN);
    tft.drawLine(x+2, y+10, x, y+16, TFT_CYAN);
  }
  else if (desc.indexOf("snieg") >= 0 || desc.indexOf("snow") >= 0) {
    tft.fillCircle(x, y-5, 12, TFT_LIGHTGREY); // Chmura + śnieg
    tft.drawLine(x-6, y+12, x-2, y+16, TFT_WHITE);
    tft.drawLine(x-2, y+12, x-6, y+16, TFT_WHITE);
    tft.drawLine(x+2, y+12, x+6, y+16, TFT_WHITE);
    tft.drawLine(x+6, y+12, x+2, y+16, TFT_WHITE);
  }
  else if (desc.indexOf("mg") >= 0 || desc.indexOf("mist") >= 0 || desc.indexOf("fog") >= 0 || desc.indexOf("haze") >= 0) {
    tft.drawLine(x-18, y-2, x+18, y-2, TFT_LIGHTGREY); // Mgła
    tft.drawLine(x-20, y+4, x+20, y+4, TFT_LIGHTGREY);
    tft.drawLine(x-16, y+10, x+16, y+10, TFT_LIGHTGREY);
  }
  else if (desc.indexOf("sleet") >= 0 || desc.indexOf("deszcz ze sniegiem") >= 0) {
    tft.fillCircle(x, y-5, 12, TFT_LIGHTGREY); // Deszcz ze śniegiem
    tft.drawLine(x-6, y+10, x-8, y+18, TFT_CYAN);
    tft.drawLine(x+2, y+10, x, y+18, TFT_CYAN);
    tft.drawLine(x+6, y+12, x+2, y+16, TFT_WHITE);
    tft.drawLine(x+2, y+12, x+6, y+16, TFT_WHITE);
  }
  else if (desc.indexOf("zachmur") >= 0 || desc.indexOf("cloud") >= 0 || desc.indexOf("pochmurnie") >= 0) {
    tft.fillCircle(x-10, y+5, 12, TFT_LIGHTGREY); // Chmura
    tft.fillCircle(x+10, y+5, 12, TFT_LIGHTGREY);
    tft.fillCircle(x, y-5, 15, TFT_LIGHTGREY);
  }
  else if (desc.indexOf("deszcz") >= 0 || desc.indexOf("rain") >= 0) {
    tft.fillCircle(x, y-5, 12, TFT_DARKGREY); // Chmura deszczowa
    tft.drawLine(x-5, y+10, x-8, y+20, TFT_CYAN);
    tft.drawLine(x+5, y+10, x+2, y+20, TFT_CYAN);
    tft.drawLine(x, y+12, x-3, y+22, TFT_CYAN);
  } else {
    tft.drawCircle(x, y, 15, TFT_WHITE); // Ikona domyślna (okrąg)
  }
}

// Główna funkcja ciała ekranu pogodowego
void drawWeatherBody() {
  const int bodyTop = 32;
  const int bodyBottom = 220;
  
  // Czyszczenie obszaru roboczego
  tft.fillRect(0, bodyTop, 480, bodyBottom - bodyTop, TFT_BLACK);

  if (!weatherData.valid) {
    tft.setTextColor(TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(50, 110);
    tft.print("WAITING FOR DATA...");
    return;
  }

  // 1. IKONA I OPIS (Prawa strona) - dostosowane do 480px
  drawWeatherIcon(400, 70, weatherData.weatherId, weatherData.description);

  // Opis pogody z polskimi znakami, czcionka VLW 20px
  bool fontLoaded = false;
  int descY = 105;
  int descX = 400; // Przesunięte bardziej w prawo dla 480px
  if (littleFsReady && LittleFS.exists(ROBOTO_FONT12_FILE)) {
    tft.loadFont(ROBOTO_FONT12_NAME, LittleFS);
    fontLoaded = true;
    tft.setTextColor(TFT_LIGHTGREY);
    tft.setTextDatum(MC_DATUM);
    tft.drawString(weatherData.description, descX, descY);
    tft.setCursor(20, 120);
    tft.print(tr(TR_HUMIDITY));  // Font VLW obsługuje polskie znaki
    tft.setCursor(20, 144);
    tft.print(tr(TR_PRESSURE));
    tft.setCursor(20, 168);
    tft.print(tr(TR_WIND));
    tft.unloadFont();
  } else {
    tft.setTextSize(1);
    tft.setTextColor(TFT_LIGHTGREY);
    String descAscii = sanitizePolishToAscii(weatherData.description);
    int fallbackX = descX - (descAscii.length() * 3);
    tft.setCursor(fallbackX, descY);
    tft.print(descAscii);
    tft.setTextSize(1);
    tft.setTextColor(TFT_DARKGREY);
    tft.setCursor(20, 120);
    tft.print(sanitizePolishToAscii(String(tr(TR_HUMIDITY))));
    tft.setCursor(20, 145);
    tft.print(sanitizePolishToAscii(String(tr(TR_PRESSURE))));
    tft.setCursor(20, 170);
    tft.print(sanitizePolishToAscii(String(tr(TR_WIND))));
  }

  // 2. TEMPERATURA (Lewa strona) - większa dla 480px
  tft.setTextSize(2);
  tft.setTextColor(TFT_DARKGREY);
  tft.setCursor(20, 45);
  tft.print(sanitizePolishToAscii(String(tr(TR_TEMPERATURE))));

  tft.setTextSize(6); // Większa temperatura
  tft.setTextColor(TFT_CYAN);
  tft.setCursor(20, 70);
  tft.print(String(weatherData.tempC, 1));
  tft.setTextSize(3);
  tft.print(" C");

  // 3. PARAMETRY SZCZEGÓŁOWE - dostosowane do 480px
  int startY = 120;
  int valueX = 180; // Więcej miejsca na wartości
  
  // WILGOTNOŚĆ
  tft.setTextSize(2);
  tft.setTextColor(TFT_WHITE);
  tft.setCursor(valueX, startY);
  tft.print(String(weatherData.humidity) + "%");

  // CIŚNIENIE
  tft.setTextSize(2);
  tft.setTextColor(TFT_WHITE);
  tft.setCursor(valueX, startY + 30);
  tft.print(String(weatherData.pressure) + " hPa");

  // WIATR
  tft.setTextSize(2);
  tft.setTextColor(getWindColor(weatherData.windMs));
  tft.setCursor(valueX, startY + 60);
  tft.print(String(weatherData.windMs, 1) + " m/s");

  // PM2.5 i PM10 - lepsze rozmieszczenie dla 480px
  tft.setTextSize(2);
  
  // PM2.5
  tft.setTextColor(TFT_WHITE);
  tft.setCursor(280, startY);
  tft.print("PM2.5: ");
  uint16_t pm25Color = getPM25Color(weatherData.pm25);
  tft.setTextColor(pm25Color);
  tft.print(String(weatherData.pm25, 1));
  
  // PM10
  tft.setTextColor(TFT_WHITE);
  tft.setCursor(280, startY + 30);
  tft.print("PM10: ");
  uint16_t pm10Color = getPM10Color(weatherData.pm10);
  tft.setTextColor(pm10Color);
  tft.print(String(weatherData.pm10, 1));

}

static void drawWeatherDetailIconCell(int x, int y, int weatherId, const String &iconCode) {
  bool isNight = false;
  if (iconCode.endsWith("n")) {
    isNight = true;
  } else if (iconCode.endsWith("d")) {
    isNight = false;
  } else {
    struct tm timeinfo;
    if (getLocalTime(&timeinfo, 1)) {
      isNight = (timeinfo.tm_hour < 6 || timeinfo.tm_hour >= 18);
    }
  }

  String iconFile = weatherIconPathForId(weatherId, isNight);
  if (!drawBmpFromFS(iconFile, x - 25, y - 25)) {
    tft.drawCircle(x, y, 10, TFT_LIGHTGREY);
  }
}

static void buildWeatherDetailHeaders(String headers[WEATHER_DETAIL_COLS]) {
  headers[0] = (tftLanguage == TFT_LANG_EN) ? "+3h" : "+3godz";
  headers[1] = (tftLanguage == TFT_LANG_EN) ? "+6h" : "+6godz";

  struct tm timeinfo;
  if (getTimeWithTimezone(&timeinfo)) {
    static const char *daysPl[7] = {"Nd", "Pn", "Wt", "Sr", "Czw", "Pt", "Sob"};
    static const char *daysEn[7] = {"Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"};
    const char **days = (tftLanguage == TFT_LANG_EN) ? daysEn : daysPl;

    for (uint8_t i = 0; i < 3; i++) {
      int dayIdx = (timeinfo.tm_wday + 1 + i) % 7;
      headers[i + 2] = String(days[dayIdx]);
    }
  } else {
    headers[2] = "D+1";
    headers[3] = "D+2";
    headers[4] = "D+3";
  }
}

void drawWeatherDetailPage() {
  const int bodyTop = 32;
  const int bodyBottom = 220;
  const int bodyLeft = 2;
  const int bodyRight = 478;  // Dla wyświetlacza 480px
  const int colCount = WeatherData::DETAIL_COLS;
  const int colW = (bodyRight - bodyLeft + 1) / colCount;

  tft.fillRect(0, bodyTop, 480, bodyBottom - bodyTop, TFT_BLACK);

  if (!weatherData.valid) {
    tft.setTextColor(TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(12, 96);
    tft.print(weatherData.lastError.length() ? weatherData.lastError : tr(TR_NO_DATA));
    return;
  }

  String headers[WeatherData::DETAIL_COLS];
  buildWeatherDetailHeaders(headers);

