Tom50505050/esp32-ham-clock/src/main.cpp
  const int yHeader = 38;
  const int yTemp = 78;
  const int yNight = 98;
  const int yHum = 121;
  const int yWind = 152;
  const int yIcon = 183;

  tft.fillRect(bodyLeft, bodyTop + 2, bodyRight - bodyLeft + 1, 31, TFT_TABLE_ALT_ROW_COLOR);

  for (int i = 1; i < colCount; i++) {
    int vx = bodyLeft + i * colW;
    tft.drawFastVLine(vx, bodyTop + 2, bodyBottom - bodyTop - 4, TFT_DARKGREY);
  }

  for (int i = 0; i < colCount; i++) {
    int colX = bodyLeft + i * colW;
    int cx = colX + (colW / 2);

    String hdr = sanitizePolishToAscii(headers[i]);
    tft.setTextSize(2);
    int hdrW = hdr.length() * 12;
    tft.setTextColor(TFT_LIGHTGREY);
    tft.setCursor(cx - hdrW / 2, yHeader);
    tft.print(hdr);

    tft.setTextSize(1);

    if (!weatherData.detailValid[i]) {
      tft.setTextColor(TFT_DARKGREY);
      tft.setCursor(cx - 6, yTemp);
      tft.print("--");
      tft.setCursor(cx - 6, yNight);
      tft.print("--");
      tft.setCursor(cx - 6, yHum);
      tft.print("--");
      tft.setCursor(cx - 6, yWind);
      tft.print("--");
      continue;
    }

    String tempText = String(weatherData.detailTempC[i], 1);
    String humText = String(weatherData.detailHumidity[i]) + "%";
    String windText = String(weatherData.detailWindMs[i], 1) + "m/s";

    tft.setTextSize(2);
    tft.setTextColor(TFT_CYAN);
    int tempX = cx - ((int)tempText.length() * 6);
    tft.setCursor(tempX, yTemp);
    tft.print(tempText);
    tft.drawCircle(tempX + ((int)tempText.length() * 12) + 3, yTemp + 3, 2, TFT_CYAN);

    tft.setTextSize(1);
    tft.setTextColor(TFT_LIGHTGREY);
    String nightText = "--";
    if (i >= 2 && i <= 3 && weatherData.nightTempValid[i - 2]) {
      nightText = String(weatherData.nightTempC[i - 2], 1) + "C";
    }
    tft.setCursor(cx - ((int)nightText.length() * 3), yNight);
    tft.print(nightText);

    tft.setTextSize(2);
    tft.setTextColor(TFT_WHITE);
    tft.setCursor(cx - ((int)humText.length() * 6), yHum);
    tft.print(humText);

    tft.setTextSize(1);
    tft.setTextColor(getWindColor(weatherData.detailWindMs[i]));
    tft.setCursor(cx - ((int)windText.length() * 3), yWind);
    tft.print(windText);

    drawWeatherDetailIconCell(cx - 25, yIcon, weatherData.detailWeatherId[i], weatherData.detailIconCode[i]);
  }
}

static void drawWeatherFooterArea(ScreenType screenId) {
  tft.fillRect(0, 220, 480, 20, TFT_BLACK);

  if (isTableNavFooterVisible(screenId)) {
    drawSwitchScreenFooter();
    return;
  }

  // WIZUALIZACJA JAKOŚCI POWIETRZA (AQI) - nad napisem lokalizacji
  if (weatherData.valid) {
    const int barY = 222; // Pozycja paska AQI (nad tekstem lokalizacji)
    const int barWidth = 100;
    const int barHeight = 6;
    const int barX = 240 - (barWidth / 2); // Wyśrodkowane

    // Kolor na podstawie PM2.5 (gorsze zanieczyszczenie decyduje)
    uint16_t aqiColor = getPM25Color(weatherData.pm25);
    String aqiLabel = "AQI: ";
    if (weatherData.pm25 <= 12) aqiLabel += "DOBRA";
    else if (weatherData.pm25 <= 35) aqiLabel += "UMIARK.";
    else if (weatherData.pm25 <= 55) aqiLabel += "NIEZDROWA";
    else aqiLabel += "SZKODLIWA";

    // Rysuj pasek jakości powietrza
    tft.fillRect(barX, barY, barWidth, barHeight, TFT_DARKGREY);
    tft.fillRect(barX + 1, barY + 1, barWidth - 2, barHeight - 2, aqiColor);

    // Etykieta AQI po lewej stronie paska
    tft.setTextSize(1);
    tft.setTextColor(TFT_WHITE);
    tft.setCursor(5, barY);
    tft.print(aqiLabel);

    // Wartości PM2.5/PM10 po prawej stronie
    tft.setTextColor(getPM25Color(weatherData.pm25));
    tft.setCursor(350, barY);
    tft.print("PM2.5:" + String(weatherData.pm25, 0));
    tft.setTextColor(getPM10Color(weatherData.pm10));
    tft.setCursor(420, barY);
    tft.print("PM10:" + String(weatherData.pm10, 0));
  }

  // Tekst lokalizacji (niżej, y=230 zamiast 226 aby zrobić miejsce na AQI)
  String cityLabel = weatherData.cityName;
  cityLabel.trim();
  if (cityLabel.length() == 0) {
    cityLabel = "--";
  }
  cityLabel = sanitizePolishToAscii(cityLabel);

  const String prefix = (tftLanguage == TFT_LANG_EN)
                        ? "Weather for location: "
                        : "Pogoda dla lokalizacji: ";
  const int maxChars = 52;
  int maxCityChars = maxChars - (int)prefix.length();
  if (maxCityChars < 3) {
    maxCityChars = 3;
  }
  if ((int)cityLabel.length() > maxCityChars) {
    cityLabel = cityLabel.substring(0, maxCityChars - 3) + "...";
  }
  String footerLabel = prefix + cityLabel;

  tft.setTextColor(0x52AA);
  tft.setTextSize(1);
  int footerWidth = footerLabel.length() * 6;
  int footerX = (480 - footerWidth) / 2;
  if (footerX < 2) {
    footerX = 2;
  }
  tft.setCursor(footerX, 230);
  tft.print(footerLabel);
}

void updateScreen5Data() {
  if (!tftInitialized ||
      (currentScreen != SCREEN_WEATHER_DSP && currentScreen != SCREEN_WEATHER_FORECAST) ||
      inMenu) {
    return;
  }

  // Wyłączono - zegar rysowany przez updateWeatherClock
  // updateScreen5Clock();

  static uint32_t lastWeatherSig = 0;
  static uint32_t lastForecastSig = 0;
  uint32_t currentSig = computeScreen5Signature();

  if (currentScreen == SCREEN_WEATHER_FORECAST) {
    if (currentSig == lastForecastSig) {
      return;
    }
    lastForecastSig = currentSig;
    drawWeatherDetailPage();
    drawWeatherFooterArea(SCREEN_WEATHER_FORECAST);
    return;
  }

  if (currentSig == lastWeatherSig) {
    return;
  }
  lastWeatherSig = currentSig;

  drawWeatherBody();
  drawWeatherFooterArea(SCREEN_WEATHER_DSP);
}

void drawWeather() {
  tft.fillScreen(TFT_BLACK);

  tft.fillRect(0, 0, 480, 32, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);

  drawHamburgerMenuButton3D(5, 7);

  tft.setTextSize(2);
  tft.setCursor(35, 8);
  tft.print(tr(TR_WEATHER));

  // ZEGAR - rysowany osobno przez updateWeatherClock()

  drawWeatherBody();
  drawWeatherFooterArea(SCREEN_WEATHER_DSP);
}

void drawWeatherForecast() {
  tft.fillScreen(TFT_BLACK);

  tft.fillRect(0, 0, 480, 32, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);

