Tom50505050/esp32-ham-clock/src/main.cpp
  drawHamburgerMenuButton3D(5, 7);

  const char *detailHeader = (tftLanguage == TFT_LANG_EN) ? "Weather forecast" : "Prognoza pogody";
  tft.setTextSize(2);
  tft.setCursor(35, 8);
  tft.print(detailHeader);

  // ZEGAR - rysowany osobno przez updateWeatherForecastClock()

  drawWeatherDetailPage();
  drawWeatherFooterArea(SCREEN_WEATHER_FORECAST);
}

void setupMatrix() {
  for (int i = 0; i < numDrops; i++) {
    drops[i].x = i * MATRIX_COL_SPACING; // Rozstawienie kolumn
    resetMatrixDropRandom(i);
  }
  matrixInitialized = true;
}

void drawMatrixBackground(int bodyTop, int bodyBottom) {
  const int charStep = 8; // wysokość znaku przy setTextSize(1)
  const int charW = 6;    // szerokość znaku przy setTextSize(1)
  bool anyIntroActive = false;
  for (int i = 0; i < numDrops; i++) {
    int drawX = drops[i].x;
    int drawY = bodyTop + drops[i].y;
    bool dropIntroActive = (matrixIntroActive && drops[i].introActive);

    if (matrixIntroActive && !dropIntroActive && !drops[i].introParticipates) {
      continue;
    }

    if (dropIntroActive) {
      unsigned long introElapsed = millis() - matrixIntroStartMs;
      if (introElapsed >= (unsigned long)drops[i].introDelayMs) {
        unsigned long activeMs = introElapsed;
        float relY = (float)drops[i].introStartY +
                     ((float)((int)activeMs - drops[i].introDelayMs) * drops[i].introSpeedPxPerMs);
        drawY = bodyTop + (int)relY;
      } else {
        drawY = bodyTop + drops[i].introStartY;
      }

      int bodyRelY = drawY - bodyTop;
      if (bodyRelY > (bodyBottom - bodyTop)) {
        drops[i].introActive = false;
        dropIntroActive = false;
        resetMatrixDropRandom(i);
        drawY = bodyTop + drops[i].y;
      } else {
        anyIntroActive = true;
      }
    }

    if (drawX < 0 || drawX > (480 - 6)) {
      if (!dropIntroActive) {
        drops[i].y += drops[i].speed;
        if (drops[i].y > (bodyBottom - bodyTop)) {
          resetMatrixDropRandom(i);
        }
      }
      continue;
    }
    tft.setTextSize(1);
    for (int j = 0; j < drops[i].len; j++) {
      int charY = drawY + (j * charStep);
      if (charY >= bodyTop && charY < bodyBottom) {
        // Blokuj znak tła, jeśli jego prostokąt przecina obszar maski zegara.
        if (drawX < (clockMaskX + clockMaskW) && (drawX + charW) > clockMaskX &&
            charY < (clockMaskY + clockMaskH) && (charY + charStep) > clockMaskY) {
          continue;
        }
        int denom = (drops[i].len > 1) ? (drops[i].len - 1) : 1;
        uint8_t t = (uint8_t)((255 * j) / denom); // 0 (ciemno) -> 255 (jasno)
        // Najniższa litera (głowa) ma być wyraźnie jaśniejsza od drugiej.
        if (j == drops[i].len - 1) {
          t = 255;
        } else if (drops[i].len > 1 && j == drops[i].len - 2) {
          t = min<uint8_t>(t, 135);
        }
        uint16_t color = (j == drops[i].len - 1)
               ? TFT_WHITE
               : lerpColor565(TFT_BLACK, MATRIX_BRIGHTGREEN, t);
        tft.setTextColor(color);
        tft.setCursor(drawX, charY);
        char ch = (j == drops[i].len - 1) ? drops[i].headChar : (char)random(33, 126);
        tft.print(ch);
      }
    }

    if (!dropIntroActive) {
      drops[i].y += drops[i].speed;

      // Reset kropli, gdy wypadnie poza obszar
      if (drops[i].y > (bodyBottom - bodyTop)) {
        resetMatrixDropRandom(i);
      }
    }
  }

  matrixIntroActive = anyIntroActive;
}

void clearMatrixArea(int bodyTop, int bodyBottom) {
  int bodyH = bodyBottom - bodyTop;
  if (clockMaskW <= 0 || clockMaskH <= 0) {
    tft.fillRect(0, bodyTop, SCREEN10_WIDTH, bodyH, TFT_BLACK);
    return;
  }

  int leftW = clockMaskX;
  int rightX = clockMaskX + clockMaskW;
  int rightW = SCREEN10_WIDTH - rightX;
  int topH = clockMaskY - bodyTop;
  int bottomY = clockMaskY + clockMaskH;
  int bottomH = bodyBottom - bottomY;

  if (topH > 0) {
    tft.fillRect(0, bodyTop, SCREEN10_WIDTH, topH, TFT_BLACK);
  }
  if (bottomH > 0) {
    tft.fillRect(0, bottomY, SCREEN10_WIDTH, bottomH, TFT_BLACK);
  }
  if (leftW > 0) {
    tft.fillRect(0, clockMaskY, leftW, clockMaskH, TFT_BLACK);
  }
  if (rightW > 0) {
    tft.fillRect(rightX, clockMaskY, rightW, clockMaskH, TFT_BLACK);
  }
}

void drawMatrixStatic() {
  //tft.fillRect(0, 0, 480, SCREEN10_HEADER_H, TFT_RADIO_ORANGE);
  //tft.setTextColor(TFT_BLACK);
  //tft.setTextSize(2);
 // tft.setCursor(10, 8);
  //tft.print("ZEGAR");

  // StrzaÄąâ€ški nawigacyjne na dole ekranu
  //tft.fillTriangle(10, 230, 20, 222, 20, 238, TFT_RADIO_ORANGE);
  //tft.fillTriangle(310, 230, 300, 222, 300, 238, TFT_RADIO_ORANGE);
  //tft.setTextColor(0x52AA); // Ciemny szary
  //tft.setTextSize(1);
  //tft.setCursor(125, 226);
  //tft.print("SWITCH SCREEN");
}

void drawMatrixFrame() {
  unsigned long now = millis();
  static unsigned long lastMatrixUpdateMs = 0;
  
  // Aktualizuj matrix co 50ms dla płynnego efektu
  if (now - lastMatrixUpdateMs >= 50) {
    lastMatrixUpdateMs = now;
    
    // Rysuj tło matrix na całym ekranie
    drawMatrixBackground(0, SCREEN10_HEIGHT);
  }
  
  // Zegar w stylu Matrix - większy i na środku
  String timeLocal = getTimezoneTimeString("%H:%M:%S", 9);
  const int MATRIX_TEXT_SIZE = 4; // Większy rozmiar
  const int timeCharW = 8 * MATRIX_TEXT_SIZE;
  const int timeCharH = 8 * MATRIX_TEXT_SIZE;
  const int timeWidth = 8 * timeCharW;
  const int timeHeight = timeCharH;
  const int timeX = (SCREEN10_WIDTH - timeWidth) / 2;
  const int timeY = (SCREEN10_HEIGHT - timeHeight) / 2 - 40; // Wyżej na środku
  
  // Rysuj zegar tylko gdy się zmienił
  if (timeLocal != lastClockText) {
    // Efekt świecący - rysuj z cieniem
    tft.setTextSize(MATRIX_TEXT_SIZE);
    
    // Cień/aura wokół tekstu (poświata)
    for (int offset = 3; offset >= 1; offset--) {
      uint16_t glowColor = (offset == 1) ? MATRIX_BRIGHTGREEN : 
                          (offset == 2) ? 0x03E0 : 0x01E0;
      tft.setTextColor(glowColor);
      tft.setCursor(timeX + offset, timeY + offset);
      tft.print(timeLocal);
      tft.setCursor(timeX - offset, timeY + offset);
      tft.print(timeLocal);
      tft.setCursor(timeX + offset, timeY - offset);
      tft.print(timeLocal);
      tft.setCursor(timeX - offset, timeY - offset);
      tft.print(timeLocal);
    }
    
    // Główny tekst - jasnozielony
    tft.setTextColor(MATRIX_BRIGHTGREEN);
    tft.setCursor(timeX, timeY);
    tft.print(timeLocal);
    
    // Data pod zegarem w stylu Matrix
    struct tm timeinfo;
    if (getLocalTime(&timeinfo, 1)) {
      char dateStr[20];
      strftime(dateStr, sizeof(dateStr), "%d.%m.%Y", &timeinfo);
      
      int dateTextSize = 2;
      int dateCharW = 8 * dateTextSize;
      int dateWidth = strlen(dateStr) * dateCharW;
      int dateX = (SCREEN10_WIDTH - dateWidth) / 2;
      int dateY = timeY + timeHeight + 20;
      
