Tom50505050/esp32-ham-clock/src/main.cpp
      // Cień daty
      tft.setTextSize(dateTextSize);
      tft.setTextColor(0x03E0);
      tft.setCursor(dateX + 1, dateY + 1);
      tft.print(dateStr);
      
      // Główna data
      tft.setTextColor(MATRIX_BRIGHTGREEN);
      tft.setCursor(dateX, dateY);
      tft.print(dateStr);
    }
    
    lastClockText = timeLocal;
  }
}

// Funkcja rysująca elegancki analogowy zegar (wygaszacz ekranu)
void drawAnalogClock() {
  unsigned long now = millis();
  
  // Aktualizuj co ~100ms (10 FPS - wystarczy dla zegara analogowego)
  if (now - lastBounceClockUpdateMs >= 100) {
    lastBounceClockUpdateMs = now;
    
    // Pobierz aktualny czas
    struct tm timeinfo;
    if (!getLocalTime(&timeinfo, 1)) return;
    
    int hour = timeinfo.tm_hour;
    int minute = timeinfo.tm_min;
    int second = timeinfo.tm_sec;
    int day = timeinfo.tm_mday;
    int month = timeinfo.tm_mon + 1;
    int year = timeinfo.tm_year + 1900;
    
    // Środek zegara
    const int cx = 240;
    const int cy = 145;  // Nieco wyżej aby zrobić miejsce na datę
    const int r = 130;   // Promień tarczy
    
    // Gradientowe tło - elegancki niebieski
    for (int y = 0; y < 320; y++) {
      uint8_t intensity = 15 + (y * 25) / 320;  // Gradient od góry do dołu
      uint16_t bgColor = ((intensity & 0x1F) << 11) | ((intensity & 0x3F) << 5) | (intensity & 0x1F);
      tft.drawFastHLine(0, y, 480, bgColor);
    }
    
    // Zewnętrzna obramowanie tarczy - metaliczne złoto/srebro
    for (int i = 8; i >= 0; i--) {
      uint16_t ringColor;
      if (i == 0) ringColor = 0xFFE0;      // Złoty zewnętrzny
      else if (i < 3) ringColor = 0xC618;  // Srebrny
      else ringColor = 0x4A49;             // Ciemny metal
      tft.drawCircle(cx, cy, r + i, ringColor);
    }
    
    // Główne tło tarczy - głęboki niebieski
    tft.fillCircle(cx, cy, r, 0x0015);
    
    // Wewnętrzny pierścień dekoracyjny
    for (int i = 3; i >= 0; i--) {
      tft.drawCircle(cx, cy, r - 10 - i, 0xC618);  // Srebrny pierścień
    }
    
    // Drugie wewnętrzne tło
    tft.fillCircle(cx, cy, r - 14, 0x000C);
    
    // Cyfry rzymskie na tarczy
    const char* romanNums[] = {"", "I", "II", "III", "IV", "V", "VI", "VII", "VIII", "IX", "X", "XI", "XII"};
    for (int i = 1; i <= 12; i++) {
      float angle = (i * 30 - 90) * PI / 180;
      int numX = cx + (r - 25) * cos(angle);
      int numY = cy + (r - 25) * sin(angle);
      
      tft.setTextSize(1);
      tft.setTextColor(0xC618);
      int textW = strlen(romanNums[i]) * 6;
      tft.setCursor(numX - textW/2, numY - 4);
      tft.print(romanNums[i]);
    }
    
    // Kreski godzinowe
    for (int i = 0; i < 60; i++) {
      float angle = i * 6 * PI / 180;
      int len = (i % 5 == 0) ? 12 : 6;
      uint16_t color = (i % 5 == 0) ? TFT_WHITE : 0x8410;
      int x1 = cx + (r - 15) * cos(angle);
      int y1 = cy + (r - 15) * sin(angle);
      int x2 = cx + (r - 15 - len) * cos(angle);
      int y2 = cy + (r - 15 - len) * sin(angle);
      tft.drawLine(x1, y1, x2, y2, color);
    }
    
    // Oblicz kąty wskazówek
    float hourAngle = (timeinfo.tm_hour % 12) * 30 + timeinfo.tm_min * 0.5 - 90;
    float minAngle = timeinfo.tm_min * 6 - 90;
    float secAngle = timeinfo.tm_sec * 6 - 90;
    
    hourAngle *= PI / 180;
    minAngle *= PI / 180;
    secAngle *= PI / 180;
    
    // Wskazówka godzinowa
    int hx = cx + (r * 0.5) * cos(hourAngle);
    int hy = cy + (r * 0.5) * sin(hourAngle);
    tft.drawLine(cx, cy, hx, hy, TFT_WHITE);
    tft.drawLine(cx+1, cy, hx+1, hy, TFT_WHITE);
    tft.drawLine(cx, cy+1, hx, hy+1, TFT_WHITE);
    int mLen = r * 0.75;
    int mX = cx + mLen * cos(minAngle);
    int mY = cy + mLen * sin(minAngle);
    tft.drawLine(cx, cy, mX, mY, 0xC618);
    tft.drawLine(cx-1, cy, mX-1, mY, 0xC618);
    tft.drawLine(cx+1, cy, mX+1, mY, 0xC618);
    tft.drawLine(cx, cy-1, mX, mY-1, 0xC618);
    tft.drawLine(cx, cy+1, mX, mY+1, 0xC618);
    tft.drawLine(cx+2, cy+2, mX+2, mY+2, 0x0005);
    
    // Wskazówka sekundowa (elegancka, czerwona z kontrastem)
    int sLen = r * 0.88;
    int sX = cx + sLen * cos(secAngle);
    int sY = cy + sLen * sin(secAngle);
    tft.drawLine(cx, cy, sX, sY, TFT_RED);
    tft.drawLine(cx-1, cy, sX-1, sY, 0xF800);
    tft.drawLine(cx+1, cy, sX+1, sY, 0xF800);
    // Koniec wskazówki (mała kropka)
    tft.fillCircle(sX, sY, 4, TFT_RED);
    
    // Środek zegara - elegancki medalion
    tft.fillCircle(cx, cy, 12, 0xC618);   // Srebrna obwódka
    tft.fillCircle(cx, cy, 10, 0xFFE0);   // Złote wypełnienie
    tft.fillCircle(cx, cy, 6, 0x0015);    // Niebieskie centrum
    tft.fillCircle(cx, cy, 3, TFT_RED);   // Czerwona kropka
    
    // Napis marki na górze tarczy
    tft.setTextSize(1);
    tft.setTextColor(0xC618);
    tft.setCursor(cx - 25, cy - r + 35);
    tft.print("HAM RADIO");
    
    // Data na dole ekranu (pod zegarem)
    char dateStr[32];
    snprintf(dateStr, sizeof(dateStr), "%02d.%02d.%d", timeinfo.tm_mday, timeinfo.tm_mon + 1, timeinfo.tm_year + 1900);
    tft.setTextSize(2);
    int dateW = tft.textWidth(dateStr);
    // Cień daty
    tft.setTextColor(0x0005);
    tft.setCursor(cx - dateW/2 + 2, cy + r + 25 + 2);
    tft.print(dateStr);
    // Główna data - złota
    tft.setTextColor(0xFFE0);
    tft.setCursor(cx - dateW/2, cy + r + 25);
    tft.print(dateStr);
    
    // Dodatkowy napis "AUTOMATIC"
    tft.setTextSize(1);
    tft.setTextColor(0x8410);
    tft.setCursor(cx - 30, cy - r + 50);
    tft.print("AUTOMATIC");
  }
}

// Funkcja rysująca cyfrowy zegar odbijający się (stary bouncing clock)
void drawDigitalClock() {
  unsigned long now = millis();
  static String lastTimeStr = "";
  static bool firstDraw = true;
  
  // Aktualizuj co ~100ms
  if (now - lastBounceClockUpdateMs >= 100) {
    lastBounceClockUpdateMs = now;
    
    // Pobierz aktualny czas
    String timeStr = getTimezoneTimeString("%H:%M:%S", 9);
    
    // Rysuj tylko gdy się zmienił lub pierwszy raz
    if (firstDraw || timeStr != lastTimeStr) {
      firstDraw = false;
      lastTimeStr = timeStr;
      
      // Wyczyść ekran tylko raz
      if (firstDraw) {
        tft.fillScreen(TFT_BLACK);
      }
      
      // Oblicz pozycję - wyśrodkowany
      int textW = timeStr.length() * BOUNCE_CLOCK_CHAR_W;
      int centerX = SCREEN10_WIDTH / 2;
      int centerY = SCREEN10_HEIGHT / 2;
      int x = centerX - textW / 2;
      int y = centerY - BOUNCE_CLOCK_CHAR_H / 2;
      
      // Wyczyść obszar zegara (prostokąt w centrum)
      tft.fillRect(x - 20, y - 20, textW + 40, BOUNCE_CLOCK_CHAR_H + 40, TFT_BLACK);
      
      // Efekt neonowy - cień
      tft.setTextSize(BOUNCE_CLOCK_TEXT_SIZE);
      tft.setTextColor(0x0410); // Ciemny niebieski cień
      tft.setCursor(x + 4, y + 4);
      tft.print(timeStr);
      
      // Główny tekst - cyfrowy zielony
      tft.setTextColor(0x07E0); // Jasny zielony
      tft.setCursor(x, y);
      tft.print(timeStr);
      
      // Dodaj ramkę wokół zegara
      tft.drawRect(x - 10, y - 10, textW + 20, BOUNCE_CLOCK_CHAR_H + 20, 0x07E0);
      tft.drawRect(x - 8, y - 8, textW + 16, BOUNCE_CLOCK_CHAR_H + 16, 0x0410);
      
      // Data pod zegarem
      struct tm timeinfo;
      if (getLocalTime(&timeinfo, 1)) {
        char dateStr[20];
        strftime(dateStr, sizeof(dateStr), "%d-%m-%Y", &timeinfo);
        tft.setTextSize(2);
        tft.setTextColor(0x07E0);
        int dateW = strlen(dateStr) * 12;
        tft.setCursor(centerX - dateW/2, y + BOUNCE_CLOCK_CHAR_H + 25);
        tft.print(dateStr);
      }
    }
  }
}

