Tom50505050/esp32-ham-clock/src/main.cpp
static void drawUnlisOuterRing() {
  tft.drawCircle(UNLIS_CENTER_X, UNLIS_CENTER_Y, UNLIS_OUTER_R, TFT_YELLOW);
  // Black outer outline masks red artifacts outside the yellow ring.
  tft.drawCircle(UNLIS_CENTER_X, UNLIS_CENTER_Y, UNLIS_OUTER_R + 1, TFT_BLACK);
  tft.drawCircle(UNLIS_CENTER_X, UNLIS_CENTER_Y, UNLIS_OUTER_R + 2, TFT_BLACK);
}

static void drawUnlisTarget() {
  if (unlisTargetActive) {
    float a = unlisTargetAngleDeg * (float)M_PI / 180.0f;
    int r = unlisTargetOuter ? UNLIS_OUTER_R : UNLIS_INNER_R;
    int tx = UNLIS_CENTER_X + (int)(sinf(a) * (float)r);
    int ty = UNLIS_CENTER_Y - (int)(cosf(a) * (float)r);
    int targetRadius = unlisTargetOuter ? 6 : 4;
    tft.fillCircle(tx, ty, targetRadius, TFT_RED);
  }

  if (unlisSecondTargetActive) {
    float a2 = unlisSecondTargetAngleDeg * (float)M_PI / 180.0f;
    int r2 = unlisSecondTargetOuter ? UNLIS_OUTER_R : UNLIS_INNER_R;
    int tx2 = UNLIS_CENTER_X + (int)(sinf(a2) * (float)r2);
    int ty2 = UNLIS_CENTER_Y - (int)(cosf(a2) * (float)r2);
    int targetRadius2 = unlisSecondTargetOuter ? 6 : 4;
    tft.fillCircle(tx2, ty2, targetRadius2, TFT_RED);
  }

  if (unlisGreenStationActive) {
    float ag = unlisGreenStationAngleDeg * (float)M_PI / 180.0f;
    int rg = unlisGreenStationOuter ? UNLIS_OUTER_R : UNLIS_INNER_R;
    int txg = UNLIS_CENTER_X + (int)(sinf(ag) * (float)rg);
    int tyg = UNLIS_CENTER_Y - (int)(cosf(ag) * (float)rg);
    tft.fillCircle(txg, tyg, 4, TFT_GREEN);
  }
}

static void drawUnlisArrows(float angleDeg) {
  float a = angleDeg * (float)M_PI / 180.0f;
  int yx = UNLIS_CENTER_X + (int)(sinf(a) * (float)UNLIS_OUTER_R);
  int yy = UNLIS_CENTER_Y - (int)(cosf(a) * (float)UNLIS_OUTER_R);
  int bx = UNLIS_CENTER_X - (int)(sinf(a) * (float)UNLIS_INNER_R);
  int by = UNLIS_CENTER_Y + (int)(cosf(a) * (float)UNLIS_INNER_R);

  tft.drawLine(UNLIS_CENTER_X, UNLIS_CENTER_Y, yx, yy, TFT_YELLOW);
  tft.drawLine(UNLIS_CENTER_X, UNLIS_CENTER_Y, bx, by, TFT_BLUE);
}

static void drawUnlisGameOver() {
  tft.fillRect(60, 96, 200, 48, TFT_BLACK);
  tft.drawRect(60, 96, 200, 48, TFT_RED);
  tft.setTextColor(TFT_RED);
  tft.setTextSize(2);
  const char* txt = "BAJO JAJO";
  int tw = (int)strlen(txt) * 12;
  tft.setCursor(60 + (200 - tw) / 2, 112);
  tft.print(txt);
}

void unlisStopGame() {
  unlisRunning = false;
  unlisGameOver = false;
  unlisIntroVisible = true;
  unlisIntroNeedsRedraw = true;
  unlisGameOverNeedsRedraw = false;
  unlisRunningUiNeedsRedraw = false;
  unlisTargetActive = false;
  unlisSecondTargetActive = false;
  unlisGreenStationActive = false;
  unlisArrowPrevValid = false;
  unlisUiNeedsRefreshOnTargetChange = true;
  unlisTimerDrawnValid = false;
}

void unlisStartResetGame() {
  unlisRunning = true;
  unlisGameOver = false;
  unlisIntroVisible = false;
  unlisIntroNeedsRedraw = false;
  unlisGameOverNeedsRedraw = false;
  unlisRunningUiNeedsRedraw = true;
  unlisCaught = 0;
  unlisMissed = 0;
  unlisElapsedSecFrozen = 0;
  unlisGameStartMs = millis();
  unlisLastFrameMs = millis();
  unlisScanAngleDeg = 0.0f;
  unlisPrevScanAngleDeg = 0.0f;
  unlisArrowPrevValid = false;
  unlisTargetActive = false;
  unlisSecondTargetActive = false;
  unlisGreenStationActive = false;
  unlisOuterEdgeNeedsClean = true;
  unlisResetPttCooldown(millis());
  unlisUiNeedsRefreshOnTargetChange = true;
  unlisTimerDrawnValid = false;
  unlisNextSpawnMs = millis() + random(200UL, 700UL);
  unlisSecondTargetNextSpawnMs = millis() + UNLIS_SECOND_TARGET_DELAY_MS + random(500UL, 3000UL);
  unlisGreenStationNextSpawnMs = millis() + random(UNLIS_GREEN_STATION_RESPAWN_MIN_MS, UNLIS_GREEN_STATION_RESPAWN_MAX_MS + 1UL);
}

static void unlisSpawnTarget(unsigned long nowMs) {
  bool targetOuter = true;
  float targetAngle = 0.0f;
  unlisGenerateRandomTarget(targetOuter, targetAngle);

  unlisTargetActive = true;
  unlisTargetOuter = targetOuter;
  unlisTargetAngleDeg = targetAngle;
  unlisTargetShownMs = nowMs;
  unlisOuterEdgeNeedsClean = true;
  unlisResetPttCooldown(nowMs);
  unlisUiNeedsRefreshOnTargetChange = true;
}

void unlisHandlePttPress(unsigned long nowMs) {
  if (!unlisRunning || unlisGameOver) return;

  unsigned long pttCooldownMs = unlisCurrentPttCooldownMs();
  if ((nowMs - unlisLastPttPressMs) < pttCooldownMs) return;
  unlisLastPttPressMs = nowMs;

  const int hitPx = 14;

  if (unlisGreenStationActive && unlisArrowHitsTarget(unlisGreenStationOuter, unlisGreenStationAngleDeg, hitPx)) {
    if (unlisCaught > 0) {
      unlisCaught--;
    }
    unlisGreenStationActive = false;
    unlisGreenStationNextSpawnMs = nowMs + random(UNLIS_GREEN_STATION_RESPAWN_MIN_MS, UNLIS_GREEN_STATION_RESPAWN_MAX_MS + 1UL);
    unlisUiNeedsRefreshOnTargetChange = true;
    return;
  }

  bool hitAnyUnlis = false;
  if (unlisTargetActive && unlisArrowHitsTarget(unlisTargetOuter, unlisTargetAngleDeg, hitPx)) {
    unlisCaught++;
    unlisTargetActive = false;
    hitAnyUnlis = true;
  }
  if (unlisSecondTargetActive && unlisArrowHitsTarget(unlisSecondTargetOuter, unlisSecondTargetAngleDeg, hitPx)) {
    unlisCaught++;
    unlisSecondTargetActive = false;
      unlisSecondTargetNextSpawnMs = nowMs + random(UNLIS_SECOND_TARGET_RESPAWN_MIN_MS, UNLIS_SECOND_TARGET_RESPAWN_MAX_MS + 1UL);
    hitAnyUnlis = true;
  }

  if (hitAnyUnlis) {
    unlisResetPttCooldown(nowMs);
    if (!unlisTargetActive && !unlisSecondTargetActive) {
      unlisNextSpawnMs = nowMs + random(UNLIS_TARGET_RESPAWN_MIN_MS, UNLIS_TARGET_RESPAWN_MAX_MS + 1UL);
    }
    unlisUiNeedsRefreshOnTargetChange = true;
  }
}

void drawUnlisHunter() {
  unlisIntroVisible = true;
  unlisIntroNeedsRedraw = true;
  unlisGameOverNeedsRedraw = false;
  unlisRunningUiNeedsRedraw = false;

  unlisRunning = false;
  unlisGameOver = false;
  unlisTargetActive = false;
  unlisSecondTargetActive = false;
  unlisGreenStationActive = false;
  unlisOuterEdgeNeedsClean = false;
  unlisArrowPrevValid = false;
  unlisElapsedSecFrozen = 0;
  unlisUiNeedsRefreshOnTargetChange = true;
  unlisTimerDrawnValid = false;
}

