Tom50505050/esp32-ham-clock/src/main.cpp
void updateUnlisHunter() {
  if (!tftInitialized || currentScreen != SCREEN_UNLIS_HUNTER || inMenu) {
    return;
  }

  if (!unlisRunning && !unlisGameOver) {
    if (unlisIntroVisible && unlisIntroNeedsRedraw) {
      tft.fillScreen(TFT_BLACK);
      drawUnlisHud();
      drawUnlisIntroText();
      unlisIntroNeedsRedraw = false;
    }
    return;
  }

  if (unlisGameOver) {
    if (unlisGameOverNeedsRedraw) {
      tft.fillScreen(TFT_BLACK);
      drawUnlisHud();
      drawUnlisOuterRing();
      drawUnlisRadarBase();
      drawUnlisArrows(unlisScanAngleDeg);
      drawUnlisGameOver();
      unlisGameOverNeedsRedraw = false;
    }
    return;
  }

  if (unlisRunningUiNeedsRedraw) {
    tft.fillScreen(TFT_BLACK);
    drawUnlisButtons();
    drawUnlisOuterRing();
    drawUnlisBandLegend();
    unlisUiNeedsRefreshOnTargetChange = true;
    unlisTimerDrawnValid = false;
    unlisRunningUiNeedsRedraw = false;
  }

  unsigned long nowMs = millis();
  if ((nowMs - unlisLastFrameMs) < UNLIS_FRAME_MS) {
    return;
  }

  float dt = (float)(nowMs - unlisLastFrameMs) / 1000.0f;
  unlisLastFrameMs = nowMs;

  if (unlisRunning && !unlisGameOver) {
    unlisScanAngleDeg = normalizeDeg360(unlisScanAngleDeg + (unlisCurrentScanDegPerSec() * dt));

    if (!unlisTargetActive && !unlisSecondTargetActive && nowMs >= unlisNextSpawnMs) {
      unlisSpawnTarget(nowMs);
    }

    unsigned long gameElapsedMs = nowMs - unlisGameStartMs;
    if (gameElapsedMs >= UNLIS_SECOND_TARGET_DELAY_MS &&
        !unlisSecondTargetActive &&
        nowMs >= unlisSecondTargetNextSpawnMs) {
      unlisGenerateRandomTarget(unlisSecondTargetOuter, unlisSecondTargetAngleDeg);
      unlisSecondTargetActive = true;
      unlisSecondTargetShownMs = nowMs;
      unlisOuterEdgeNeedsClean = true;
      unlisResetPttCooldown(nowMs);
      unlisUiNeedsRefreshOnTargetChange = true;
    }

    if (!unlisGreenStationActive && nowMs >= unlisGreenStationNextSpawnMs) {
      unlisGenerateRandomTarget(unlisGreenStationOuter, unlisGreenStationAngleDeg);
      unlisGreenStationActive = true;
      unlisGreenStationShownMs = nowMs;
      unlisGreenStationNextSpawnMs = nowMs + random(UNLIS_GREEN_STATION_RESPAWN_MIN_MS, UNLIS_GREEN_STATION_RESPAWN_MAX_MS + 1UL);
      unlisUiNeedsRefreshOnTargetChange = true;
    }

    if (unlisTargetActive && (nowMs - unlisTargetShownMs) >= unlisCurrentTargetLifeMs()) {
      unlisTargetActive = false;
      unlisResetPttCooldown(nowMs);
      unlisMissed++;
      if (unlisMissed >= 3) {
        unlisElapsedSecFrozen = (nowMs - unlisGameStartMs) / 1000UL;
        unlisGameOver = true;
        unlisRunning = false;
        unlisTargetActive = false;
        unlisSecondTargetActive = false;
        unlisGreenStationActive = false;
        unlisGameOverNeedsRedraw = true;
        unlisUiNeedsRefreshOnTargetChange = true;
      } else {
        if (!unlisSecondTargetActive) {
          unlisNextSpawnMs = nowMs + random(UNLIS_TARGET_RESPAWN_MIN_MS, UNLIS_TARGET_RESPAWN_MAX_MS + 1UL);
        }
        unlisUiNeedsRefreshOnTargetChange = true;
      }
    }

    if (unlisSecondTargetActive && (nowMs - unlisSecondTargetShownMs) >= unlisCurrentTargetLifeMs()) {
      unlisSecondTargetActive = false;
      unlisSecondTargetNextSpawnMs = nowMs + random(UNLIS_SECOND_TARGET_RESPAWN_MIN_MS, UNLIS_SECOND_TARGET_RESPAWN_MAX_MS + 1UL);
      unlisResetPttCooldown(nowMs);
      unlisMissed++;
      if (unlisMissed >= 3) {
        unlisElapsedSecFrozen = (nowMs - unlisGameStartMs) / 1000UL;
        unlisGameOver = true;
        unlisRunning = false;
        unlisTargetActive = false;
        unlisSecondTargetActive = false;
        unlisGreenStationActive = false;
        unlisGameOverNeedsRedraw = true;
      } else if (!unlisTargetActive) {
        unlisNextSpawnMs = nowMs + random(UNLIS_TARGET_RESPAWN_MIN_MS, UNLIS_TARGET_RESPAWN_MAX_MS + 1UL);
      }
      unlisUiNeedsRefreshOnTargetChange = true;
    }

    if (unlisGreenStationActive && (nowMs - unlisGreenStationShownMs) >= UNLIS_GREEN_STATION_LIFE_MS) {
      unlisGreenStationActive = false;
      unlisUiNeedsRefreshOnTargetChange = true;
    }
  }

  // Clear and redraw only radar zone; keep static buttons untouched.
  tft.fillCircle(UNLIS_CENTER_X, UNLIS_CENTER_Y, UNLIS_OUTER_R - 1, TFT_BLACK);

  bool redrawOuterRingNow = false;

  if (unlisOuterEdgeNeedsClean) {
    // Before drawing a new target, clean ring edge.
    for (int r = UNLIS_OUTER_R - 2; r <= UNLIS_OUTER_R + 6; r++) {
      tft.drawCircle(UNLIS_CENTER_X, UNLIS_CENTER_Y, r, TFT_BLACK);
    }
    redrawOuterRingNow = true;
    unlisOuterEdgeNeedsClean = false;
  }

  bool scoreMarkersRedrawn = false;
  if (unlisUiNeedsRefreshOnTargetChange) {
    drawUnlisScoreAndMissMarkers();
    unlisUiNeedsRefreshOnTargetChange = false;
    scoreMarkersRedrawn = true;
  }

  // Keep ring above left score/marker area and redraw after those elements.
  if (redrawOuterRingNow || scoreMarkersRedrawn) {
    drawUnlisOuterRing();
  }

  unsigned long elapsedSec = (nowMs - unlisGameStartMs) / 1000UL;
  if (!unlisTimerDrawnValid || elapsedSec != unlisLastTimerSecDrawn) {
    drawUnlisTimerValue(elapsedSec);
    unlisLastTimerSecDrawn = elapsedSec;
    unlisTimerDrawnValid = true;
  }

  // Keep radar and moving gameplay elements on top of the screen.
  drawUnlisRadarBase();
  drawUnlisTarget();
  drawUnlisArrows(unlisScanAngleDeg);
  unlisPrevScanAngleDeg = unlisScanAngleDeg;
  unlisArrowPrevValid = true;
}

// ========== Ekrany pomocnicze ==========

// Ekrany 6-10: Puste (tylko napis)
void drawScreenEmpty(int screenNum) {
  tft.setTextColor(TFT_BLACK, TFT_WHITE);
  tft.setTextSize(3);
  
  String screenText = String(tr(TR_PAGE)) + " " + String(screenNum);
  int textWidth = screenText.length() * 18;
  int xPos = (480 - textWidth) / 2;
  int yPos = 110; // WyÄąâ€şrodkowane w pionie
  
  tft.setCursor(xPos, yPos);
  tft.print(screenText);

  // Strzałki nawigacyjne - duże, blisko krawędzi (takie same na wszystkich ekranach)
  int arrowY = 290;
  int arrowSize = 12;
  tft.fillTriangle(15, arrowY, 15 + arrowSize, arrowY - arrowSize, 15 + arrowSize, arrowY + arrowSize, TFT_RADIO_ORANGE);
  tft.fillTriangle(465, arrowY, 465 - arrowSize, arrowY - arrowSize, 465 - arrowSize, arrowY + arrowSize, TFT_RADIO_ORANGE);
  
  // Opcjonalny opis między strzałkami (małą czcionką)
  tft.setTextColor(0x52AA); // Ciemny szary
  tft.setTextSize(1);
  tft.setCursor(195, 286);
  tft.print("SWITCH SCREEN");
}

// Rysuj strzałki nawigacyjne < >
void drawNavigationArrows() {
  // Intentionally empty: nawigacja przez dotyk bez elementÄ‚łw UI
}

