Tom50505050/esp32-ham-clock/src/main.cpp
  int perpX = (int)round(cos(angleRad));
  int perpY = (int)round(sin(angleRad));
  tft.drawLine(centerX, centerY, tipX, tipY, TFT_CYAN);
  tft.drawLine(centerX + perpX, centerY + perpY, tipX + perpX, tipY + perpY, TFT_CYAN);
  tft.fillCircle(tipX, tipY, 2, TFT_CYAN);
  tft.fillCircle(centerX, centerY, 1, TFT_CYAN);

  String bearingTxt = String((int)(bearingDeg + 0.5f)) + "d";
  int txtX = centerX - (bearingTxt.length() * 3);
  tft.setTextColor(TFT_WHITE);
  tft.setCursor(txtX, centerY + radius + 2);
  tft.print(bearingTxt);
}

static void drawAprsAlertFrame(bool pulseOn) {
  const int frameX = 10;
  const int frameY = 55;
  const int frameW = 460;
  const int frameH = 260;
  uint16_t color = pulseOn ? TFT_RADIO_ORANGE : TFT_DARKGREY;
  tft.drawRect(frameX, frameY, frameW, frameH, color);
  tft.drawRect(frameX + 1, frameY + 1, frameW - 2, frameH - 2, color);
}

static void drawAprsAlertCloseButton() {
  tft.fillRoundRect(APRS_ALERT_CLOSE_BTN_X, APRS_ALERT_CLOSE_BTN_Y, APRS_ALERT_CLOSE_BTN_W, APRS_ALERT_CLOSE_BTN_H, 5, TFT_RADIO_ORANGE);
  tft.drawRoundRect(APRS_ALERT_CLOSE_BTN_X, APRS_ALERT_CLOSE_BTN_Y, APRS_ALERT_CLOSE_BTN_W, APRS_ALERT_CLOSE_BTN_H, 5, TFT_BLACK);
  tft.drawLine(APRS_ALERT_CLOSE_BTN_X + 7, APRS_ALERT_CLOSE_BTN_Y + 7,
               APRS_ALERT_CLOSE_BTN_X + APRS_ALERT_CLOSE_BTN_W - 8, APRS_ALERT_CLOSE_BTN_Y + APRS_ALERT_CLOSE_BTN_H - 8, TFT_BLACK);
  tft.drawLine(APRS_ALERT_CLOSE_BTN_X + APRS_ALERT_CLOSE_BTN_W - 8, APRS_ALERT_CLOSE_BTN_Y + 7,
               APRS_ALERT_CLOSE_BTN_X + 7, APRS_ALERT_CLOSE_BTN_Y + APRS_ALERT_CLOSE_BTN_H - 8, TFT_BLACK);
  tft.drawLine(APRS_ALERT_CLOSE_BTN_X + 8, APRS_ALERT_CLOSE_BTN_Y + 7,
               APRS_ALERT_CLOSE_BTN_X + APRS_ALERT_CLOSE_BTN_W - 7, APRS_ALERT_CLOSE_BTN_Y + APRS_ALERT_CLOSE_BTN_H - 8, TFT_BLACK);
  tft.drawLine(APRS_ALERT_CLOSE_BTN_X + 7, APRS_ALERT_CLOSE_BTN_Y + 8,
               APRS_ALERT_CLOSE_BTN_X + APRS_ALERT_CLOSE_BTN_W - 8, APRS_ALERT_CLOSE_BTN_Y + APRS_ALERT_CLOSE_BTN_H - 7, TFT_BLACK);
  tft.drawLine(APRS_ALERT_CLOSE_BTN_X + APRS_ALERT_CLOSE_BTN_W - 7, APRS_ALERT_CLOSE_BTN_Y + 7,
               APRS_ALERT_CLOSE_BTN_X + 8, APRS_ALERT_CLOSE_BTN_Y + APRS_ALERT_CLOSE_BTN_H - 8, TFT_BLACK);
  tft.drawLine(APRS_ALERT_CLOSE_BTN_X + APRS_ALERT_CLOSE_BTN_W - 8, APRS_ALERT_CLOSE_BTN_Y + 8,
               APRS_ALERT_CLOSE_BTN_X + 7, APRS_ALERT_CLOSE_BTN_Y + APRS_ALERT_CLOSE_BTN_H - 7, TFT_BLACK);
}

static bool isAprsAlertCloseButtonHit(uint16_t x, uint16_t y) {
  int hitX = APRS_ALERT_CLOSE_BTN_X + ((APRS_ALERT_CLOSE_BTN_W - APRS_ALERT_CLOSE_HIT_W) / 2);
  int hitY = APRS_ALERT_CLOSE_BTN_Y + ((APRS_ALERT_CLOSE_BTN_H - APRS_ALERT_CLOSE_HIT_H) / 2);
  if (hitX < 0) hitX = 0;
  if (hitY < 0) hitY = 0;

  int hitRight = hitX + APRS_ALERT_CLOSE_HIT_W;
  int hitBottom = hitY + APRS_ALERT_CLOSE_HIT_H;
  if (hitRight > 480) hitRight = 480;
  if (hitBottom > 320) hitBottom = 320;

  return x >= hitX && x < hitRight && y >= hitY && y < hitBottom;
}

static void dismissAprsAlertScreen() {
  if (!aprsAlertScreenActive) {
    return;
  }
  aprsAlertScreenActive = false;
  drawScreen(currentScreen);
  if (currentScreen == SCREEN_HAM_CLOCK) {
    updateScreen1();
  }
}

static void setRgbLedChannel(uint8_t pin, bool on) {
  digitalWrite(pin, on ? LOW : HIGH);
}

static void applyRgbLedState(bool redOn, bool greenOn, bool blueOn) {
  setRgbLedChannel(RGB_LED_RED_PIN, redOn);
  setRgbLedChannel(RGB_LED_GREEN_PIN, greenOn);
  setRgbLedChannel(RGB_LED_BLUE_PIN, blueOn);
}

static void initStatusRgbLed() {
  pinMode(RGB_LED_RED_PIN, OUTPUT);
  pinMode(RGB_LED_GREEN_PIN, OUTPUT);
  pinMode(RGB_LED_BLUE_PIN, OUTPUT);

  rgbLedPrevWifiConnected = false;
  rgbRedBlinkLastToggleMs = millis();
  rgbRedBlinkStateOn = false;
  rgbBlueAprsAlertActive = false;
  rgbBlueAprsAlertUntilMs = 0;
  rgbBlueAprsLastToggleMs = 0;
  rgbBlueAprsStateOn = false;

  applyRgbLedState(false, false, false);
}

static int normalizeLedAlertDurationMs(int durationMs) {
  if (durationMs < 100) return 100;
  if (durationMs > 60000) return 60000;
  return durationMs;
}

static void applyLedAlertDurationMs(int durationMs) {
  ledAlertDurationMs = normalizeLedAlertDurationMs(durationMs);
}

static int normalizeLedAlertBlinkMs(int blinkMs) {
  if (blinkMs < 50) return 50;
  if (blinkMs > 5000) return 5000;
  return blinkMs;
}

static void applyLedAlertBlinkMs(int blinkMs) {
  ledAlertBlinkMs = normalizeLedAlertBlinkMs(blinkMs);
}

static void triggerAprsRgbLedAlert() {
  if (!enableLedAlert) {
    return;
  }

  unsigned long nowMs = millis();
  rgbBlueAprsAlertActive = true;
  rgbBlueAprsAlertUntilMs = nowMs + (unsigned long)ledAlertDurationMs;
  rgbBlueAprsLastToggleMs = nowMs;
  rgbBlueAprsStateOn = true;
  applyRgbLedState(false, false, true);
}

static void updateStatusRgbLed() {
  unsigned long nowMs = millis();

  if (rgbBlueAprsAlertActive) {
    if ((long)(nowMs - rgbBlueAprsAlertUntilMs) >= 0) {
      rgbBlueAprsAlertActive = false;
      rgbBlueAprsStateOn = false;
    } else if (nowMs - rgbBlueAprsLastToggleMs >= (unsigned long)ledAlertBlinkMs) {
      rgbBlueAprsLastToggleMs = nowMs;
      rgbBlueAprsStateOn = !rgbBlueAprsStateOn;
    }

    if (rgbBlueAprsAlertActive) {
      applyRgbLedState(false, false, rgbBlueAprsStateOn);
      return;
    }
  }

  applyRgbLedState(false, false, false);
}

void ALERT_Screen(const APRSStation &station) {
  if (!tftInitialized) {
    return;
  }

  aprsAlertScreenStation = station;
  aprsAlertScreenActive = true;
  aprsAlertScreenUntilMs = millis() + ((unsigned long)aprsAlertScreenSeconds * 1000UL);
  aprsAlertFrameLastToggleMs = millis();
  aprsAlertFramePulseOn = true;

  tft.fillScreen(TFT_BLACK);
  
  // Górny pasek z nagłówkiem
  tft.fillRect(0, 0, 480, 45, TFT_RADIO_ORANGE);
  tft.drawFastHLine(0, 44, 480, 0x8410);

  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(3);
  const String headerText = "APRS ALERT";
  const int headerX = (480 - ((int)headerText.length() * 18)) / 2;
  tft.setCursor(headerX, 10);
  tft.print(headerText);
  
  drawAprsAlertCloseButton();

  // Główna ramka wokół zawartości
  const int frameX = 10;
  const int frameY = 55;
  const int frameW = 460;
  const int frameH = 260;
  tft.drawRect(frameX, frameY, frameW, frameH, TFT_RADIO_ORANGE);
  tft.drawRect(frameX + 1, frameY + 1, frameW - 2, frameH - 2, TFT_DARKGREY);

  String callsign = station.callsign;
  callsign.toUpperCase();
  if (callsign.length() == 0) {
    callsign = "-";
  }

  // ZNAK WYWOŁAWCZY - duży, wyśrodkowany w ramce
  tft.setTextColor(TFT_WHITE);
  int callTextSize = (callsign.length() <= 6) ? 6 : 5;
  tft.setTextSize(callTextSize);
  int charWidth = (callTextSize == 6) ? 36 : 30;
  int callX = frameX + (frameW - (callsign.length() * charWidth)) / 2;
  int callY = frameY + 20;
  
  // Ramka wokół znaku
  int callBoxPadding = 10;
  int callBoxW = callsign.length() * charWidth + 2 * callBoxPadding;
  int callBoxH = charWidth + callBoxPadding;
  int callBoxX = frameX + (frameW - callBoxW) / 2;
  tft.drawRect(callBoxX, callY - 5, callBoxW, callBoxH, TFT_WHITE);
  tft.drawRect(callBoxX + 1, callY - 4, callBoxW - 2, callBoxH - 2, TFT_RADIO_ORANGE);
  
  tft.setCursor(callX, callY);
  tft.print(callsign);

  // Częstotliwość pod znakiem
  String freqText = "-";
  if (station.freqMHz > 0.0f) {
    freqText = String(station.freqMHz, 3) + " MHz";
  }
  tft.setTextColor(TFT_LIGHTGREY);
  tft.setTextSize(3);
  int freqX = frameX + (frameW - (freqText.length() * 18)) / 2;
  tft.setCursor(freqX, callY + callBoxH + 10);
  tft.print(freqText);

  // KOMPAS i ODLEGŁOŚĆ - na dole ramki, obok siebie
  String distanceText = "- km";
  if (station.hasLatLon && station.distance > 0.0f) {
    distanceText = String(station.distance, 1) + " km";
  }
  
  // Kompas po lewej - wyżej
  const int compassX = frameX + 80;
  const int compassY = frameY + frameH - 130;
  const int compassR = 40;
  
  bool hasBearing = false;
  float bearingDeg = 0.0f;
  if (userLatLonValid && station.hasLatLon) {
    hasBearing = true;
    bearingDeg = calculateBearing(userLat, userLon, (double)station.lat, (double)station.lon);
  }
  drawAprsAlertCompass(compassX, compassY, compassR, hasBearing, bearingDeg);

  // Odległość pod kompasem
  tft.setTextColor(TFT_RADIO_ORANGE);
  tft.setTextSize(2);
  int distX = compassX - ((int)distanceText.length() * 12) / 2;
  tft.setCursor(distX, compassY + compassR + 15);
  tft.print(distanceText);

