Tom50505050/esp32-ham-clock/src/main.cpp
  // Ikona stacji po prawej stronie (bez opisu, tylko ikona)
  String iconShort = getAPRSSymbolShort(station);
  uint16_t iconColor = TFT_WHITE;
  if (iconShort == "CAR") {
    iconColor = TFT_RED;
  } else if (iconShort == "HOUSE") {
    iconColor = TFT_YELLOW;
  } else if (iconShort == "HUMAN") {
    iconColor = TFT_BLUE;
  }
  
  int iconCenterX = frameX + frameW - 130;
  int iconCenterY = frameY + frameH - 140;
  
  if (iconShort == "CAR") {
    drawAprsAlertCarIcon(iconCenterX, iconCenterY, iconColor);
  } else if (iconShort == "HOUSE") {
    drawAprsAlertHouseIcon(iconCenterX, iconCenterY);
  } else if (iconShort == "HUMAN") {
    drawAprsAlertHumanIcon(iconCenterX, iconCenterY);
  } else {
    // Domyślnie dom
    drawAprsAlertHouseIcon(iconCenterX, iconCenterY);
  }

  // Typ stacji pod ikoną - dostosowany do nowej pozycji
  tft.setTextColor(TFT_LIGHTGREY);
  tft.setTextSize(2);
  String iconDesc = getAprsAlertSymbolDescription(station);
  int descX = iconCenterX - ((int)iconDesc.length() * 12) / 2;
  tft.setCursor(descX, iconCenterY + 55);
  tft.print(iconDesc);
}

void updateAlertScreenTimeout() {
  if (!aprsAlertScreenActive) {
    return;
  }

  unsigned long nowMs = millis();
  if (nowMs - aprsAlertFrameLastToggleMs >= APRS_ALERT_FRAME_PULSE_MS) {
    aprsAlertFrameLastToggleMs = nowMs;
    aprsAlertFramePulseOn = !aprsAlertFramePulseOn;
    drawAprsAlertFrame(aprsAlertFramePulseOn);
  }

  if ((long)(millis() - aprsAlertScreenUntilMs) < 0) {
    return;
  }

  dismissAprsAlertScreen();
}

// WyciĂ„â€¦gnij czĂ„â„˘stotliwoÄąâ€şĂ„â€ˇ z komentarza APRS (MHz)
bool extractAPRSFrequencyMHz(const String &text, float &outMHz) {
  const int len = text.length();
  for (int i = 0; i < len; i++) {
    char c = text.charAt(i);
    if (isDigit(c) && (i == 0 || !isDigit(text.charAt(i - 1)))) {
      int j = i;
      bool hasDot = false;
      while (j < len) {
        char cj = text.charAt(j);
        if (cj == '.') {
          if (hasDot) break;
          hasDot = true;
          j++;
          continue;
        }
        if (!isDigit(cj)) break;
        j++;
      }
      if (j <= i) continue;

      String numStr = text.substring(i, j);
      float value = numStr.toFloat();
      if (value <= 0.0f) continue;

      int k = j;
      while (k < len && (text.charAt(k) == ' ' || text.charAt(k) == '\t')) {
        k++;
      }
      if (k + 2 < len) {
        char m1 = text.charAt(k);
        char m2 = text.charAt(k + 1);
        char m3 = text.charAt(k + 2);
        if ((m1 == 'M' || m1 == 'm') && (m2 == 'H' || m2 == 'h') && (m3 == 'Z' || m3 == 'z')) {
          outMHz = value;
          return true;
        }
      }

      // Bez jednostki: akceptuj tylko liczby dziesiĂ„â„˘tne w paÄąâ€şmie VHF/UHF
      if (hasDot && value >= 30.0f && value <= 1000.0f) {
        outMHz = value;
        return true;
      }
    }
  }
  return false;
}

// Konwersja Maidenhead Locator do wspÄ‚łÄąâ€šrzĂ„â„˘dnych geograficznych
void locatorToLatLon(String locator, double &lat, double &lon) {
  if (locator.length() < 4) {
    lat = 0;
    lon = 0;
    return;
  }
  
  // Pierwsze 2 znaki - kwadrat (field)
  char c1 = toupper(locator.charAt(0));
  char c2 = toupper(locator.charAt(1));
  lon = (c1 - 'A') * 20 - 180;
  lat = (c2 - 'A') * 10 - 90;
  
  // NastĂ„â„˘pne 2 znaki - kwadrat (square)
  if (locator.length() >= 4) {
    int n1 = locator.charAt(2) - '0';
    int n2 = locator.charAt(3) - '0';
    lon += n1 * 2;
    lat += n2 * 1;
  }
  
  // ÄąĹˇrodek kwadratu
  lon += 1;
  lat += 0.5;
}

void updateUserLatLonFromLocator() {
  if (userLocator.length() >= 4) {
    locatorToLatLon(userLocator, userLat, userLon);
    userLatLonValid = true;
  } else {
    userLat = 0.0;
    userLon = 0.0;
    userLatLonValid = false;
  }
}

// SprawdÄąĹź czy tekst wspÄ‚łÄąâ€šrzĂ„â„˘dnych ma tylko cyfry i kropkĂ„â„˘ (nie obsÄąâ€šugujemy formatÄ‚łw skompresowanych)
static bool isAprsNumeric(const String &raw_aprs) {
    if (raw_aprs.length() == 0) {
        return false;
    }
    int dotCount = 0;
    for (size_t i = 0; i < raw_aprs.length(); i++) {
        char c = raw_aprs.charAt(i);
        if (c == '.') {
            dotCount++;
            if (dotCount > 1) {
                return false;
            }
        } else if (!isDigit(c)) {
            return false;
        }
    }
    return true;
}

// Konwersja surowej pozycji APRS na stopnie dziesiĂ„â„˘tne
// Konwersja formatu APRS (DDMM.mmN lub DDDMM.mmE) na stopnie dziesiĂ„â„˘tne
// Format APRS: DDMM.mm dla szerokoÄąâ€şci, DDDMM.mm dla dÄąâ€šugoÄąâ€şci
float convertToDecimal(String raw_aprs, char direction) {
    if (raw_aprs.length() < 4) {
        LOGV_PRINTF("[APRS] convertToDecimal: za krÄ‚łtki string: %s\n", raw_aprs.c_str());
        return NAN;
    }
    if (!isAprsNumeric(raw_aprs)) {
        LOGV_PRINTF("[APRS] convertToDecimal: nie-numeryczny format: %s\n", raw_aprs.c_str());
        return NAN;
    }

    double degrees = 0.0;
    double minutes = 0.0;

    if (direction == 'N' || direction == 'S') {
        // SzerokoÄąâ€şĂ„â€ˇ (Latitude): pierwsze 2 znaki to stopnie (DDMM.mm)
        // PrzykÄąâ€šad: "5202.40" -> degrees=52, minutes=02.40
        if (raw_aprs.length() >= 2) {
            String degStr = raw_aprs.substring(0, 2);
            degrees = degStr.toDouble();
        }
        if (raw_aprs.length() > 2) {
            String minStr = raw_aprs.substring(2);
            minutes = minStr.toDouble();
        }
    } else if (direction == 'E' || direction == 'W') {
        // DÄąâ€šugoÄąâ€şĂ„â€ˇ (Longitude): pierwsze 3 znaki to stopnie (DDDMM.mm)
        // PrzykÄąâ€šad: "01655.12" -> degrees=016, minutes=55.12
        if (raw_aprs.length() >= 3) {
            String degStr = raw_aprs.substring(0, 3);
            degrees = degStr.toDouble();
        }
        if (raw_aprs.length() > 3) {
            String minStr = raw_aprs.substring(3);
            minutes = minStr.toDouble();
        }
    } else {
        LOGV_PRINTF("[APRS] convertToDecimal: nieznany kierunek: %c\n", direction);
        return NAN;
    }

    // Walidacja zakresÄ‚łw
    if (direction == 'N' || direction == 'S') {
        if (degrees < 0 || degrees > 90 || minutes < 0 || minutes >= 60) {
            LOGV_PRINTF("[APRS] convertToDecimal: nieprawidÄąâ€šowa szerokoÄąâ€şĂ„â€ˇ: %s%c (deg=%.1f, min=%.2f)\n", 
                       raw_aprs.c_str(), direction, degrees, minutes);
            return NAN;
        }
    } else {
        if (degrees < 0 || degrees > 180 || minutes < 0 || minutes >= 60) {
            LOGV_PRINTF("[APRS] convertToDecimal: nieprawidÄąâ€šowa dÄąâ€šugoÄąâ€şĂ„â€ˇ: %s%c (deg=%.1f, min=%.2f)\n", 
                       raw_aprs.c_str(), direction, degrees, minutes);
            return NAN;
        }
    }

