Tom50505050/esp32-ham-clock/src/main.cpp
    double decimal = degrees + (minutes / 60.0);

    // JeÄąâ€şli PoÄąâ€šudnie (S) lub ZachÄ‚łd (W), wynik musi byĂ„â€ˇ ujemny
    if (direction == 'S' || direction == 'W') {
        decimal = -decimal;
    }

    LOGV_PRINTF("[APRS] convertToDecimal: %s%c -> %.6f (deg=%.0f, min=%.2f)\n", 
               raw_aprs.c_str(), direction, decimal, degrees, minutes);

    return (float)decimal;
}

// ===== APRS Mic-E / Compressed / Uncompressed decoding (ported from ESP32APRS_Audio) =====
static bool validSymTableCompressed(char c) {
    return (c == '/' || c == '\\' || (c >= 0x41 && c <= 0x5A) || (c >= 0x61 && c <= 0x6A)); // [\/\\A-Za-j]
}

static bool validSymTableUncompressed(char c) {
    return (c == '/' || c == '\\' || (c >= 0x41 && c <= 0x5A) || (c >= 0x30 && c <= 0x39)); // [\/\\A-Z0-9]
}

static bool parseFixedUnsigned(const char *src, int offset, int digits, unsigned int &out) {
  out = 0;
  for (int i = 0; i < digits; i++) {
    char c = src[offset + i];
    if (c < '0' || c > '9') {
      return false;
    }
    out = out * 10U + (unsigned int)(c - '0');
  }
  return true;
}

static int aprsMicECommentBodyOffset(const unsigned char *body, size_t len) {
  const size_t kMicEFixedLen = 8; // lon(3) + spd/crs(3) + sym(2)
  if (!body || len <= kMicEFixedLen) {
    return (int)kMicEFixedLen;
  }

  size_t idx = kMicEFixedLen;
  unsigned char marker = body[idx];

  // Optional Mic-E telemetry may start with '`', '\'', 0x1C or 0x1D.
  if (marker == 0x60 || marker == 0x27 || marker == 0x1C || marker == 0x1D) {
    size_t probe = idx + 1;
    size_t telemetryLen = 0;
    while (probe < len && telemetryLen < 10) {
      unsigned char c = body[probe];
      if (c < 0x21 || c > 0x7B) {
        break;
      }
      telemetryLen++;
      probe++;
    }

    // Skip telemetry only when it looks like a valid telemetry block.
    if (telemetryLen >= 2) {
      idx = probe;
    }
  }

  return (int)idx;
}

static bool aprsLatLonInRange(float lat, float lon) {
  if (isnan(lat) || isnan(lon)) return false;
  if (lat < -90.0f || lat > 90.0f) return false;
  if (lon < -180.0f || lon > 180.0f) return false;
  // APRS parser conventions: 0,0 is treated as invalid/no position.
  if (fabsf(lat) < 0.0001f && fabsf(lon) < 0.0001f) return false;
  return true;
}

static String normalizeAprsParsedComment(const String &rawComment) {
  String out;
  out.reserve(rawComment.length());
  for (size_t i = 0; i < rawComment.length(); i++) {
    char c = rawComment.charAt(i);
    if (c == '\r' || c == '\n') {
      out += ' ';
      continue;
    }
    if ((unsigned char)c >= 32 || c == '\t') {
      out += c;
    }
  }
  out.trim();
  return out;
}

static bool parseAprsUncompressed(const char *body, size_t len, float &lat, float &lon, char &symTable, char &symCode) {
    if (len < 19) {
        return false;
    }
    char posbuf[20];
    memcpy(posbuf, body, 19);
    posbuf[19] = 0;

    // Position ambiguity handling
    if (posbuf[2] == ' ') posbuf[2] = '3';
    if (posbuf[3] == ' ') posbuf[3] = '5';
    if (posbuf[5] == ' ') posbuf[5] = '5';
    if (posbuf[6] == ' ') posbuf[6] = '5';
    if (posbuf[12] == ' ') posbuf[12] = '3';
    if (posbuf[13] == ' ') posbuf[13] = '5';
    if (posbuf[15] == ' ') posbuf[15] = '5';
    if (posbuf[16] == ' ') posbuf[16] = '5';

    if (posbuf[4] != '.' || posbuf[14] != '.') {
      return false;
    }

    unsigned int latDeg = 0, latMin = 0, latMinFrag = 0;
    unsigned int lonDeg = 0, lonMin = 0, lonMinFrag = 0;
    if (!parseFixedUnsigned(posbuf, 0, 2, latDeg) ||
      !parseFixedUnsigned(posbuf, 2, 2, latMin) ||
      !parseFixedUnsigned(posbuf, 5, 2, latMinFrag) ||
      !parseFixedUnsigned(posbuf, 9, 3, lonDeg) ||
      !parseFixedUnsigned(posbuf, 12, 2, lonMin) ||
      !parseFixedUnsigned(posbuf, 15, 2, lonMinFrag)) {
        return false;
    }

    char latHemi = posbuf[7];
    symTable = posbuf[8];
    char lonHemi = posbuf[17];
    symCode = posbuf[18];

    if (!validSymTableUncompressed(symTable)) {
        symTable = 0;
    }

    bool isSouth = (latHemi == 'S' || latHemi == 's');
    bool isWest = (lonHemi == 'W' || lonHemi == 'w');
    if (!isSouth && latHemi != 'N' && latHemi != 'n') return false;
    if (!isWest && lonHemi != 'E' && lonHemi != 'e') return false;
    if (latDeg > 90 || lonDeg > 180) return false;
    if (latMin >= 60 || lonMin >= 60) return false;

    lat = (float)latDeg + (float)latMin / 60.0f + (float)latMinFrag / 6000.0f;
    lon = (float)lonDeg + (float)lonMin / 60.0f + (float)lonMinFrag / 6000.0f;
    if (isSouth) lat = -lat;
    if (isWest) lon = -lon;
    return aprsLatLonInRange(lat, lon);
}

static bool parseAprsCompressed(const char *body, size_t len, float &lat, float &lon, char &symTable, char &symCode) {
    if (len < 13) {
        return false;
    }
    symTable = body[0];
    symCode = body[9];
    if (!validSymTableCompressed(symTable)) return false;
    for (int i = 1; i <= 8; i++) {
        if (body[i] < 0x21 || body[i] > 0x7b) return false;
    }

    int lat1 = (body[1] - 33);
    int lat2 = (body[2] - 33);
    int lat3 = (body[3] - 33);
    int lat4 = (body[4] - 33);
    lat1 = ((((lat1 * 91) + lat2) * 91) + lat3) * 91 + lat4;

    int lon1 = (body[5] - 33);
    int lon2 = (body[6] - 33);
    int lon3 = (body[7] - 33);
    int lon4 = (body[8] - 33);
    lon1 = ((((lon1 * 91) + lon2) * 91) + lon3) * 91 + lon4;

    lat = 90.0f - ((float)(lat1) / 380926.0f);
    lon = -180.0f + ((float)(lon1) / 190463.0f);

    if (symTable >= 'a' && symTable <= 'j') {
        symTable -= 81; // a-j -> 0-9
    }
    return aprsLatLonInRange(lat, lon);
}

static bool parseAprsMicE(const char *dstcall, const unsigned char *body, size_t len,
                          float &lat, float &lon, char &symTable, char &symCode) {
    if (!dstcall || strlen(dstcall) != 6) return false;
    if (len < 8) return false;

    // Validate destination callsign format
    for (int i = 0; i < 3; i++) {
        if (!((dstcall[i] >= '0' && dstcall[i] <= '9') ||
              (dstcall[i] >= 'A' && dstcall[i] <= 'L') ||
              (dstcall[i] >= 'P' && dstcall[i] <= 'Z'))) {
            return false;
        }
    }
    for (int i = 3; i < 6; i++) {
        if (!((dstcall[i] >= '0' && dstcall[i] <= '9') ||
              (dstcall[i] == 'L') ||
              (dstcall[i] >= 'P' && dstcall[i] <= 'Z'))) {
            return false;
        }
    }

    // Validate info field
    if (body[0] < 0x26 || body[0] > 0x7f) return false;
    if (body[1] < 0x26 || body[1] > 0x61) return false;
    if (body[2] < 0x1c || body[2] > 0x7f) return false;
    if (body[3] < 0x1c || body[3] > 0x7f) return false;
    if (body[4] < 0x1c || body[4] > 0x7d) return false;
    if (body[5] < 0x1c || body[5] > 0x7f) return false;
    if ((body[6] < 0x21 || body[6] > 0x7b) && body[6] != 0x7d) return false;
    if (body[7] != '/' && body[7] != '\\') return false;

