Tom50505050/esp32-ham-clock/src/main.cpp
    char dst[7];
    strncpy(dst, dstcall, 6);
    dst[6] = 0;

    for (char *p = dst; *p; p++) {
        if (*p >= 'A' && *p <= 'J') *p -= 'A' - '0';
        else if (*p >= 'P' && *p <= 'Y') *p -= 'P' - '0';
        else if (*p == 'K' || *p == 'L' || *p == 'Z') *p = '_';
    }

    int posAmbiguity = 0;
    if (dst[5] == '_') { dst[5] = '5'; posAmbiguity = 1; }
    if (dst[4] == '_') { dst[4] = '5'; posAmbiguity = 2; }
    if (dst[3] == '_') { dst[3] = '5'; posAmbiguity = 3; }
    if (dst[2] == '_') { dst[2] = '3'; posAmbiguity = 4; }
    if (dst[1] == '_' || dst[0] == '_') return false;

    unsigned int latDeg = 0, latMin = 0, latMinFrag = 0;
    if (!parseFixedUnsigned(dst, 0, 2, latDeg) ||
      !parseFixedUnsigned(dst, 2, 2, latMin) ||
      !parseFixedUnsigned(dst, 4, 2, latMinFrag)) {
      return false;
    }
    lat = (float)latDeg + (float)latMin / 60.0f + (float)latMinFrag / 6000.0f;
    if (dstcall[3] <= 0x4c) lat = -lat;

    unsigned int lonDeg = body[0] - 28;
    if (dstcall[4] >= 0x50) lonDeg += 100;
    if (lonDeg >= 180 && lonDeg <= 189) lonDeg -= 80;
    else if (lonDeg >= 190 && lonDeg <= 199) lonDeg -= 190;

    unsigned int lonMin = body[1] - 28;
    if (lonMin >= 60) lonMin -= 60;
    unsigned int lonMinFrag = body[2] - 28;

    switch (posAmbiguity) {
        case 0:
            lon = (float)lonDeg + (float)lonMin / 60.0f + (float)lonMinFrag / 6000.0f;
            break;
        case 1:
            lon = (float)lonDeg + (float)lonMin / 60.0f + (float)(lonMinFrag - lonMinFrag % 10 + 5) / 6000.0f;
            break;
        case 2:
            lon = (float)lonDeg + ((float)lonMin + 0.5f) / 60.0f;
            break;
        case 3:
            lon = (float)lonDeg + (float)(lonMin - lonMin % 10 + 5) / 60.0f;
            break;
        case 4:
            lon = (float)lonDeg + 0.5f;
            break;
        default:
            return false;
    }

    if (dstcall[5] >= 0x50) lon = -lon;

    symCode = body[6];
    symTable = body[7];
    return aprsLatLonInRange(lat, lon);
}

static bool parseAprsAdvancedPosition(const String &line, APRSStation &station) {
    int gtPos = line.indexOf('>');
    if (gtPos < 0) return false;
    int colonPos = line.indexOf(':', gtPos + 1);
    if (colonPos < 0) return false;

    String dstPath = line.substring(gtPos + 1, colonPos);
    int commaPos = dstPath.indexOf(',');
    String dstcall = (commaPos >= 0) ? dstPath.substring(0, commaPos) : dstPath;
    dstcall.trim();
    if (dstcall.length() == 0) return false;

    String payload = line.substring(colonPos + 1);
    if (payload.length() == 0) return false;

    char packettype = payload.charAt(0);
    const char *body = payload.c_str() + 1;
    size_t bodyLen = payload.length() > 0 ? (size_t)(payload.length() - 1) : 0;

    float lat = 0.0f, lon = 0.0f;
    char symTable = 0, symCode = 0;
    bool ok = false;
    int commentOffset = -1; // offset in payload
    String objectOrItemName = "";

    if (packettype == '`' || packettype == '\'') {
        ok = parseAprsMicE(dstcall.c_str(), (const unsigned char *)body, bodyLen, lat, lon, symTable, symCode);
      if (ok) commentOffset = 1 + aprsMicECommentBodyOffset((const unsigned char *)body, bodyLen);
    } else if (packettype == '!' || packettype == '=' || packettype == '/' || packettype == '@') {
        size_t offset = 1;
        if ((packettype == '/' || packettype == '@') && bodyLen >= 7) {
            body += 7;
            bodyLen -= 7;
            offset += 7;
        }
        if (bodyLen > 0) {
            char poschar = body[0];
            if (validSymTableCompressed(poschar)) {
                ok = parseAprsCompressed(body, bodyLen, lat, lon, symTable, symCode);
                if (ok) commentOffset = (int)(offset + 13);
            } else if (poschar >= '0' && poschar <= '9') {
                ok = parseAprsUncompressed(body, bodyLen, lat, lon, symTable, symCode);
                if (ok) commentOffset = (int)(offset + 19);
            }
        }
    } else if (packettype == ';') {
      // Object: name + (* or _) + timestamp(7) + position
      int nameEnd = -1;
      for (int i = 0; i < (int)bodyLen && i < 15; i++) {
        if (body[i] == '*' || body[i] == '_') {
          nameEnd = i;
          break;
        }
      }
      if (nameEnd >= 0) {
        objectOrItemName = payload.substring(1, 1 + nameEnd);
        objectOrItemName.trim();
      }
      if (nameEnd >= 0 && (nameEnd + 8) < (int)bodyLen) {
        const char *posBody = body + nameEnd + 8;
        size_t posLen = bodyLen - (nameEnd + 8);
            char poschar = posBody[0];
            if (validSymTableCompressed(poschar)) {
                ok = parseAprsCompressed(posBody, posLen, lat, lon, symTable, symCode);
          if (ok) commentOffset = 1 + nameEnd + 8 + 13;
            } else if (poschar >= '0' && poschar <= '9') {
                ok = parseAprsUncompressed(posBody, posLen, lat, lon, symTable, symCode);
          if (ok) commentOffset = 1 + nameEnd + 8 + 19;
            }
        }
    } else if (packettype == ')') {
        // Item: name ends with ! or _
        int nameEnd = -1;
        for (int i = 0; i < 9 && i < (int)bodyLen; i++) {
            if (body[i] == '!' || body[i] == '_') {
                nameEnd = i;
                break;
            }
        }
        if (nameEnd >= 0 && (nameEnd + 1) < (int)bodyLen) {
        objectOrItemName = payload.substring(1, 1 + nameEnd);
        objectOrItemName.trim();
            const char *posBody = body + nameEnd + 1;
            size_t posLen = bodyLen - (nameEnd + 1);
            char poschar = posBody[0];
            if (validSymTableCompressed(poschar)) {
                ok = parseAprsCompressed(posBody, posLen, lat, lon, symTable, symCode);
                if (ok) commentOffset = 1 + nameEnd + 1 + 13;
            } else if (poschar >= '0' && poschar <= '9') {
                ok = parseAprsUncompressed(posBody, posLen, lat, lon, symTable, symCode);
                if (ok) commentOffset = 1 + nameEnd + 1 + 19;
            }
        }
    }

    if (!ok) {
        return false;
    }

    station.lat = lat;
    station.lon = lon;
    station.hasLatLon = aprsLatLonInRange(lat, lon);
    if (!station.hasLatLon) {
      return false;
    }
    if (symCode != 0) {
        station.symbol = String(symCode);
    }
    if (symTable != 0) {
        station.symbolTable = String(symTable);
    }

