Tom50505050/esp32-ham-clock/src/main.cpp
    if (objectOrItemName.length() > 0) {
      // Dla raportów Object/Item użyj nazwy obiektu jako identyfikatora stacji.
      station.callsign = objectOrItemName;
    }

    if (commentOffset > 0 && commentOffset < payload.length()) {
      station.comment = normalizeAprsParsedComment(payload.substring(commentOffset));
    }
    return true;
}

// Obliczanie odlegÄąâ€šoÄąâ€şci metodĂ„â€¦ Haversine (km)
// UÄąÄ˝ywa double dla wiĂ„â„˘kszej precyzji obliczeÄąâ€ž
// UÄąÄ˝ywa promienia Ziemi 6366.71 km (jak w ESP32APRS_Audio) dla zgodnoÄąâ€şci z aprs.fi
float calculateDistance(double lat1, double lon1, double lat2, double lon2) {
    const double r = 6366.71; // PromieÄąâ€ž Ziemi w km (uÄąÄ˝ywany przez ESP32APRS_Audio i aprs.fi)
    const double dLat = (lat2 - lat1) * M_PI / 180.0;
    const double dLon = (lon2 - lon1) * M_PI / 180.0;

    const double a = sin(dLat/2.0) * sin(dLat/2.0) +
                     cos(lat1 * M_PI / 180.0) * cos(lat2 * M_PI / 180.0) *
                     sin(dLon/2.0) * sin(dLon/2.0);
    const double c = 2.0 * atan2(sqrt(a), sqrt(1.0 - a));
    
    return (float)(r * c); // Wynik w km
}

// Oblicz azymut początkowy (0..360), gdzie 0 = Północ
float calculateBearing(double lat1, double lon1, double lat2, double lon2) {
    const double phi1 = lat1 * M_PI / 180.0;
    const double phi2 = lat2 * M_PI / 180.0;
    const double dLon = (lon2 - lon1) * M_PI / 180.0;

    const double y = sin(dLon) * cos(phi2);
    const double x = cos(phi1) * sin(phi2) - sin(phi1) * cos(phi2) * cos(dLon);
    double bearingDeg = atan2(y, x) * 180.0 / M_PI;
    if (bearingDeg < 0.0) {
      bearingDeg += 360.0;
    }
    return (float)bearingDeg;
}

String formatDistanceOrCountry(const DXSpot &spot, size_t maxLen) {
  if (spot.country.length() > 0) {
    String c = spot.country;
    c.trim();
    if (c.length() > maxLen) {
      c = c.substring(0, maxLen);
    }
    return c;
  }
  return "-";
}

// OkreÄąâ€şlanie pasma na podstawie czĂ„â„˘stotliwoÄąâ€şci (kHz) wg bandplanu
String getBand(float freq) {
  // Normalize to kHz so both kHz (DX cluster) and MHz (POTA API) inputs map correctly
  float freqKHz = freq;
  if (freqKHz > 0.0f && freqKHz < 1000.0f) {
    freqKHz *= 1000.0f;
  }

  if (freqKHz >= 1810 && freqKHz <= 2000) return "240m";
  if (freqKHz >= 3500 && freqKHz <= 3800) return "80m";
  if (freqKHz >= 7000 && freqKHz <= 7200) return "40m";
  if (freqKHz >= 10100 && freqKHz <= 10150) return "30m";
  if (freqKHz >= 14000 && freqKHz <= 14350) return "20m";
  if (freqKHz >= 18068 && freqKHz <= 18168) return "17m";
  if (freqKHz >= 21000 && freqKHz <= 21450) return "15m";
  if (freqKHz >= 24890 && freqKHz <= 24990) return "12m";
  if (freqKHz >= 28000 && freqKHz <= 29700) return "10m";
  return "Other";
}

// OkreÄąâ€şlanie modulacji na podstawie komentarza
String getMode(String comment) {
  comment.toUpperCase();
  if (comment.indexOf("CW") >= 0) return "CW";
  if (comment.indexOf("FT4") >= 0) return "FT4";
  if (comment.indexOf("FT8") >= 0) return "FT8";
  if (comment.indexOf("SSB") >= 0 || comment.indexOf("USB") >= 0 || comment.indexOf("LSB") >= 0) return "SSB";
  return "SSB"; // DomyÄąâ€şlnie SSB
}

String extractXmlTagValue(const String &xml, const String &tag) {
  String openTag = "<" + tag + ">";
  String closeTag = "</" + tag + ">";
  int start = xml.indexOf(openTag);
  if (start < 0) return "";
  start += openTag.length();
  int end = xml.indexOf(closeTag, start);
  if (end < 0) return "";
  return xml.substring(start, end);
}

// Funkcja do URL-encodowania stringów (używana przy QRZ)
static String urlEncode(const String& value) {
  String encoded = "";
  char c;
  for (size_t i = 0; i < value.length(); i++) {
    c = value.charAt(i);
    if (c == ' ') {
      encoded += "%20";
    } else if (c == '!') {
      encoded += "%21";
    } else if (c == '"') {
      encoded += "%22";
    } else if (c == '#') {
      encoded += "%23";
    } else if (c == '$') {
      encoded += "%24";
    } else if (c == '%') {
      encoded += "%25";
    } else if (c == '&') {
      encoded += "%26";
    } else if (c == '\'') {
      encoded += "%27";
    } else if (c == '(') {
      encoded += "%28";
    } else if (c == ')') {
      encoded += "%29";
    } else if (c == '*') {
      encoded += "%2A";
    } else if (c == '+') {
      encoded += "%2B";
    } else if (c == ',') {
      encoded += "%2C";
    } else if (c == '/') {
      encoded += "%2F";
    } else if (c == ':') {
      encoded += "%3A";
    } else if (c == ';') {
      encoded += "%3B";
    } else if (c == '<') {
      encoded += "%3C";
    } else if (c == '=') {
      encoded += "%3D";
    } else if (c == '>') {
      encoded += "%3E";
    } else if (c == '?') {
      encoded += "%3F";
    } else if (c == '@') {
      encoded += "%40";
    } else if (c == '[') {
      encoded += "%5B";
    } else if (c == '\\') {
      encoded += "%5C";
    } else if (c == ']') {
      encoded += "%5D";
    } else if (c == '^') {
      encoded += "%5E";
    } else if (c == '_') {
      encoded += "%5F";
    } else if (c == '`') {
      encoded += "%60";
    } else if (c == '{') {
      encoded += "%7B";
    } else if (c == '|') {
      encoded += "%7C";
    } else if (c == '}') {
      encoded += "%7D";
    } else if (c == '.') {
      encoded += "%2E";
    } else if (c == '-') {
      encoded += "%2D";
    } else if (c < '0' || (c > '9' && c < 'A') || (c > 'Z' && c < 'a') || (c > 'z' && c < 127)) {
      // Kodowanie wszystkich innych znaków specjalnych i znaków > 127 (UTF-8)
      char hex[4];
      snprintf(hex, sizeof(hex), "%%%02X", (unsigned char)c);
      encoded += hex;
    } else {
      encoded += c;
    }
  }
  return encoded;
}

bool ensureQrzSession(String &sessionKey) {
  static String cachedKey = "";
  static unsigned long cachedAt = 0;
  const unsigned long SESSION_TTL_MS = 30UL * 60UL * 1000UL; // 30 minut

  if (qrzUsername.length() == 0 || qrzPassword.length() == 0) {
    qrzStatus = "QRZ: no credentials";
    return false;
  }

  unsigned long now = millis();
  if (cachedKey.length() > 0 && (now - cachedAt) < SESSION_TTL_MS) {
    sessionKey = cachedKey;
    qrzStatus = "QRZ: session ok";
    return true;
  }

  String url = "https://xmldata.qrz.com/xml/current/?username=" + urlEncode(qrzUsername) +
               ";password=" + urlEncode(qrzPassword);
  
  // Debug log - pokaż URL z zamaskowanym hasłem
  String debugUrl = "https://xmldata.qrz.com/xml/current/?username=" + urlEncode(qrzUsername) +
                    ";password=*** (len=" + String(qrzPassword.length()) + ")";
  Serial.println("[QRZ DEBUG] URL: " + debugUrl);
  Serial.println("[QRZ DEBUG] Username: " + qrzUsername + " (len=" + String(qrzUsername.length()) + ")");
  Serial.println("[QRZ DEBUG] Pass len: " + String(qrzPassword.length()));
  
