Tom50505050/esp32-ham-clock/src/main.cpp
  // Pokaż pierwsze i ostatnie 3 znaki zakodowanego hasła (dla weryfikacji)
  String encodedPass = urlEncode(qrzPassword);
  String passPreview = encodedPass.substring(0, 6) + "..." + encodedPass.substring(encodedPass.length()-6);
  Serial.println("[QRZ DEBUG] Encoded pass preview: " + passPreview + " (total len=" + String(encodedPass.length()) + ")");
  
  HTTPClient http;
  http.setTimeout(3000);
  http.begin(url);
  int code = http.GET();
  if (code != 200) {
    http.end();
    qrzStatus = "QRZ: login http " + String(code);
    return false;
  }
  String body = http.getString();
  http.end();

  String err = extractXmlTagValue(body, "Error");
  if (err.length() == 0) {
    err = extractXmlTagValue(body, "error");
  }

  String key = extractXmlTagValue(body, "Key");
  if (key.length() == 0) {
    key = extractXmlTagValue(body, "key");
  }
  if (key.length() == 0) {
    if (err.length() > 0) {
      qrzStatus = "QRZ: login " + err;
      Serial.print("[QRZ] Login error: ");
      Serial.println(err);
    } else {
      qrzStatus = "QRZ: login failed";
      Serial.println("[QRZ] Login failed - no session key and no error message");
      Serial.println("[QRZ] Response body (first 500 chars):");
      Serial.println(body.substring(0, 500));
    }
    return false;
  }

  cachedKey = key;
  cachedAt = now;
  sessionKey = key;
  qrzStatus = "QRZ: login ok";
  Serial.println("[QRZ] Session OK");
  return true;
}

// ========== CALLOOK.INFO API (Free alternative to QRZ) ==========
bool fetchCallookCallsignInfo(const String &callsign, String &outGrid, String &outCountry,
                               String &outName, String &outEmail, String &outQth, double &outLat, double &outLon, bool &outHasLatLon) {
  if (!wifiConnected || WiFi.status() != WL_CONNECTED) {
    return false;
  }

  outGrid = "";
  outCountry = "";
  outName = "";
  outEmail = "";
  outQth = "";
  outLat = 0.0;
  outLon = 0.0;
  outHasLatLon = false;

  String call = callsign;
  call.toUpperCase();
  call.trim();
  if (call.length() == 0) return false;

  // Check cache first
  unsigned long now = millis();
  for (int i = 0; i < QRZ_CACHE_SIZE; i++) {
    if (qrzCache[i].callsign == call && (now - qrzCache[i].fetchedAtMs) < QRZ_CACHE_TTL_MS) {
      outGrid = qrzCache[i].grid;
      outCountry = qrzCache[i].country;
      outName = qrzCache[i].name;
      outEmail = qrzCache[i].email;
      outQth = qrzCache[i].qth;
      outLat = qrzCache[i].lat;
      outLon = qrzCache[i].lon;
      outHasLatLon = qrzCache[i].hasLatLon;
      return (outGrid.length() > 0 || outCountry.length() > 0 || outName.length() > 0);
    }
  }

  String url = "https://callook.info/" + call + "/json";
  HTTPClient http;
  http.setTimeout(5000);
  http.begin(url);
  int code = http.GET();
  if (code != 200) {
    http.end();
    Serial.print("[CALLOOK] HTTP error: ");
    Serial.println(code);
    return false;
  }
  String body = http.getString();
  http.end();

  // Parse JSON response
  DynamicJsonDocument doc(1024);
  DeserializationError err = deserializeJson(doc, body);
  if (err) {
    Serial.print("[CALLOOK] JSON parse error: ");
    Serial.println(err.c_str());
    return false;
  }

  // Check if callsign exists
  if (doc["status"] == "INVALID") {
    Serial.println("[CALLOOK] Callsign not found");
    return false;
  }

  // Extract data
  const char* name = doc["name"];
  if (name) outName = String(name);
  
  const char* grid = doc["location"]["gridsquare"];
  if (grid) outGrid = String(grid);
  
  const char* country = doc["address"]["country"];
  if (country) outCountry = String(country);
  
  // Build QTH from address line2 (format: "CITY, STATE ZIP")
  const char* addressLine2 = doc["address"]["line2"];
  if (addressLine2) {
    String addr = String(addressLine2);
    // Extract city and state from "CITY, STATE ZIP" format
    int commaPos = addr.indexOf(',');
    if (commaPos > 0) {
      String city = addr.substring(0, commaPos);
      String stateZip = addr.substring(commaPos + 1);
      stateZip.trim();
      // Extract just state (2 letters before space or zip)
      int spacePos = stateZip.indexOf(' ');
      String state = (spacePos > 0) ? stateZip.substring(0, spacePos) : stateZip;
      outQth = city + ", " + state;
    } else {
      outQth = addr;
    }
  }

  // Get coordinates
  float lat = doc["location"]["latitude"] | 0.0f;
  float lon = doc["location"]["longitude"] | 0.0f;
  if (lat != 0.0f && lon != 0.0f) {
    outLat = lat;
    outLon = lon;
    outHasLatLon = true;
  }

  // Save to cache
  int oldestIdx = 0;
  unsigned long oldestMs = qrzCache[0].fetchedAtMs;
  for (int i = 1; i < QRZ_CACHE_SIZE; i++) {
    if (qrzCache[i].fetchedAtMs < oldestMs) {
      oldestMs = qrzCache[i].fetchedAtMs;
      oldestIdx = i;
    }
  }
  qrzCache[oldestIdx].callsign = call;
  qrzCache[oldestIdx].grid = outGrid;
  qrzCache[oldestIdx].country = outCountry;
  qrzCache[oldestIdx].name = outName;
  qrzCache[oldestIdx].email = outEmail;
  qrzCache[oldestIdx].qth = outQth;
  qrzCache[oldestIdx].lat = (float)outLat;
  qrzCache[oldestIdx].lon = (float)outLon;
  qrzCache[oldestIdx].hasLatLon = outHasLatLon;
  qrzCache[oldestIdx].fetchedAtMs = now;

  Serial.print("[CALLOOK] Fetched: ");
  Serial.print(call);
  Serial.print(" - Name: '");
  Serial.print(outName);
  Serial.print("', Grid: '");
  Serial.print(outGrid);
  Serial.print("', QTH: '");
  Serial.print(outQth);
  Serial.println("'");

  return (outGrid.length() > 0 || outCountry.length() > 0 || outName.length() > 0);
}

// ========== HAMQTH.COM API (Free, global) ==========
// Dodaj mapowanie prefiksu na przybliżony lokalizator
String getApproximateGridFromCallsign(const String &callsign) {
  if (callsign.length() < 2) return "";
  
  // Mapowanie prefiksów na przybliżone lokatory (centrum kraju)
  String prefix = callsign.substring(0, 2);
  prefix.toUpperCase();
  
  // Europa
  if (callsign.startsWith("SP")) return "JO92ii";      // Poland
  if (callsign.startsWith("SQ")) return "JO92ii";      // Poland
  if (callsign.startsWith("SO")) return "JO92ii";    // Poland
  if (callsign.startsWith("HF")) return "JO92ii";    // Poland
  if (callsign.startsWith("SR")) return "JO92ii";    // Poland
  if (callsign.startsWith("SN")) return "JO92ii";    // Poland
  if (callsign.startsWith("3Z")) return "JO92ii";    // Poland
  if (callsign.startsWith("DL")) return "JO62qm";    // Germany
  if (callsign.startsWith("DO")) return "JO62qm";    // Germany
  if (callsign.startsWith("DA")) return "JO62qm";    // Germany
  if (callsign.startsWith("G"))  return "IO91vl";    // England
  if (callsign.startsWith("M"))  return "IO91vl";    // England
  if (callsign.startsWith("2E")) return "IO91vl";    // England
  if (callsign.startsWith("GM")) return "IO86je";    // Scotland
  if (callsign.startsWith("GW")) return "IO81fm";    // Wales
  if (callsign.startsWith("F"))  return "JN18dv";    // France
  if (callsign.startsWith("TM")) return "JN18dv";    // France
  if (callsign.startsWith("ON")) return "JO20fm";    // Belgium
  if (callsign.startsWith("PA")) return "JO22db";    // Netherlands
  if (callsign.startsWith("PB")) return "JO22db";    // Netherlands
  if (callsign.startsWith("PH")) return "JO22db";    // Netherlands
  if (callsign.startsWith("PI")) return "JO22db";    // Netherlands
  if (callsign.startsWith("HB")) return "JN46bt";    // Switzerland
  if (callsign.startsWith("HE")) return "JN46bt";    // Switzerland
  if (callsign.startsWith("OE")) return "JN77tx";    // Austria
  if (callsign.startsWith("OK")) return "JN79jw";    // Czech Republic
  if (callsign.startsWith("OL")) return "JN79jw";    // Czech Republic
  if (callsign.startsWith("OM")) return "JN88ss";    // Slovakia
  if (callsign.startsWith("HA")) return "JN97nm";    // Hungary
  if (callsign.startsWith("SV")) return "KM17uw";    // Greece
  if (callsign.startsWith("5B")) return "KM64ft";    // Cyprus
  if (callsign.startsWith("C3")) return "JN02tw";    // Andorra
  if (callsign.startsWith("CT")) return "IM57nh";    // Portugal
  if (callsign.startsWith("CU")) return "IM57nh";    // Portugal
  if (callsign.startsWith("EA")) return "IN80dj";    // Spain
  if (callsign.startsWith("EB")) return "IN80dj";    // Spain
  if (callsign.startsWith("EC")) return "IN80dj";    // Spain
  if (callsign.startsWith("ED")) return "IN80dj";    // Spain
  if (callsign.startsWith("EI")) return "IO63ci";    // Ireland
  if (callsign.startsWith("EJ")) return "IO63ci";    // Ireland
  if (callsign.startsWith("EK")) return "LM28cx";    // Armenia
  if (callsign.startsWith("EL")) return "JJ06px";    // Liberia
  if (callsign.startsWith("ER")) return "KN37bs";    // Moldova
  if (callsign.startsWith("ES")) return "KO29ih";    // Estonia
  if (callsign.startsWith("ET")) return "JM55bt";    // Ethiopia
  if (callsign.startsWith("EU")) return "JO34qd";    // Belarus
  if (callsign.startsWith("EV")) return "KO33tw";    // Latvia
  if (callsign.startsWith("EW")) return "KO43lb";    // Lithuania
  if (callsign.startsWith("EX")) return "MN52ct";    // Kyrgyzstan
  if (callsign.startsWith("EY")) return "MM47nx";    // Tajikistan
  if (callsign.startsWith("EZ")) return "LM49qp";    // Turkmenistan
  if (callsign.startsWith("I"))  return "JN62ra";    // Italy
  if (callsign.startsWith("IS")) return "JN62ra";    // Italy (Sardinia)
  if (callsign.startsWith("IZ")) return "JN62ra";    // Italy
  if (callsign.startsWith("IT")) return "JN62ra";    // Italy
  if (callsign.startsWith("LA")) return "JO59jp";    // Norway
  if (callsign.startsWith("LB")) return "JO59jp";    // Norway
  if (callsign.startsWith("LC")) return "JO59jp";    // Norway
  if (callsign.startsWith("LD")) return "JO59jp";    // Norway
  if (callsign.startsWith("LE")) return "JO59jp";    // Norway
  if (callsign.startsWith("LF")) return "JO59jp";    // Norway
  if (callsign.startsWith("LG")) return "JO59jp";    // Norway
  if (callsign.startsWith("LH")) return "JO59jp";    // Norway
  if (callsign.startsWith("LI")) return "JO59jp";    // Norway
  if (callsign.startsWith("LJ")) return "JO59jp";    // Norway
  if (callsign.startsWith("LK")) return "JO59jp";    // Norway
  if (callsign.startsWith("LL")) return "JO59jp";    // Norway
  if (callsign.startsWith("LM")) return "JO59jp";    // Norway
  if (callsign.startsWith("LN")) return "JO59jp";    // Norway
  if (callsign.startsWith("LZ")) return "KN12pr";    // Bulgaria
  if (callsign.startsWith("S5")) return "JN75cv";    // Slovenia
  if (callsign.startsWith("S7")) return "LL38on";    // Seychelles
  if (callsign.startsWith("S9")) return "JI12hf";    // Sao Tome
  if (callsign.startsWith("SA")) return "JP80jq";    // Sweden
  if (callsign.startsWith("SB")) return "JP80jq";    // Sweden
  if (callsign.startsWith("SC")) return "JP80jq";    // Sweden
  if (callsign.startsWith("SD")) return "JP80jq";    // Sweden
  if (callsign.startsWith("SE")) return "JP80jq";    // Sweden
  if (callsign.startsWith("SF")) return "JP80jq";    // Sweden
  if (callsign.startsWith("SG")) return "JP80jq";    // Sweden
  if (callsign.startsWith("SH")) return "JP80jq";    // Sweden
  if (callsign.startsWith("SI")) return "JP80jq";    // Sweden
  if (callsign.startsWith("SJ")) return "JP80jq";    // Sweden
  if (callsign.startsWith("SK")) return "JP80jq";    // Sweden
  if (callsign.startsWith("SL")) return "JP80jq";    // Sweden
  if (callsign.startsWith("SM")) return "JP80jq";    // Sweden
  if (callsign.startsWith("SN")) return "JO92ii";    // Poland
  if (callsign.startsWith("TA")) return "KM69kw";    // Turkey
  if (callsign.startsWith("TB")) return "KM69kw";    // Turkey
  if (callsign.startsWith("TC")) return "KM69kw";    // Turkey
  if (callsign.startsWith("TD")) return "KM69kw";    // Turkey
  if (callsign.startsWith("TF")) return "HP94mf";    // Iceland
  if (callsign.startsWith("TG")) return "EK44qm";    // Guatemala
  if (callsign.startsWith("TI")) return "EK70wf";    // Costa Rica
  if (callsign.startsWith("TJ")) return "JJ53rm";    // Cameroon
  if (callsign.startsWith("TK")) return "JN43ji";    // Corsica
  if (callsign.startsWith("TL")) return "JJ48qx";    // Central Africa
  if (callsign.startsWith("TN")) return "JN53dl";    // Congo
  if (callsign.startsWith("TR")) return "JJ47nm";    // Gabon
  if (callsign.startsWith("TT")) return "JJ66af";    // Chad
  if (callsign.startsWith("TU")) return "IJ85ml";    // Ivory Coast
  if (callsign.startsWith("TY")) return "JJ16aa";    // Benin
  if (callsign.startsWith("TZ")) return "IJ52ei";    // Mali
  if (callsign.startsWith("UA")) return "KO85ss";    // Russia (European)
  if (callsign.startsWith("UB")) return "KO85ss";    // Russia
  if (callsign.startsWith("UC")) return "KO85ss";    // Russia
  if (callsign.startsWith("UD")) return "KO85ss";    // Russia
  if (callsign.startsWith("UE")) return "KO85ss";    // Russia
  if (callsign.startsWith("UF")) return "KO85ss";    // Russia
  if (callsign.startsWith("UG")) return "KO85ss";    // Russia
  if (callsign.startsWith("UH")) return "KO85ss";    // Russia
  if (callsign.startsWith("UI")) return "KO85ss";    // Russia
  if (callsign.startsWith("UJ")) return "KO85ss";    // Russia
  if (callsign.startsWith("UK")) return "KO85ss";    // Russia
  if (callsign.startsWith("UL")) return "KO85ss";    // Russia
  if (callsign.startsWith("UM")) return "KO85ss";    // Russia
  if (callsign.startsWith("UN")) return "KO85ss";    // Russia
  if (callsign.startsWith("UO")) return "KO85ss";    // Russia
  if (callsign.startsWith("UP")) return "KO85ss";    // Russia
  if (callsign.startsWith("UQ")) return "KO85ss";    // Russia
  if (callsign.startsWith("UR")) return "KO50dm";    // Ukraine
  if (callsign.startsWith("US")) return "KO50dm";    // Ukraine
  if (callsign.startsWith("UT")) return "KO50dm";    // Ukraine
  if (callsign.startsWith("UU")) return "KO50dm";    // Ukraine
  if (callsign.startsWith("UV")) return "KO50dm";    // Ukraine
  if (callsign.startsWith("UW")) return "KO50dm";    // Ukraine
  if (callsign.startsWith("UX")) return "KO50dm";    // Ukraine
  if (callsign.startsWith("UY")) return "KO50dm";    // Ukraine
  if (callsign.startsWith("UZ")) return "KO50dm";    // Ukraine
  if (callsign.startsWith("YU")) return "JN94sd";    // Serbia
  if (callsign.startsWith("YT")) return "JN94sd";    // Serbia
  if (callsign.startsWith("YZ")) return "KN05fx";    // Macedonia
  if (callsign.startsWith("ZA")) return "JM99ah";    // Albania
  if (callsign.startsWith("ZB")) return "JM99ah";    // Albania
  if (callsign.startsWith("ZC")) return "JM99ah";    // Albania
  if (callsign.startsWith("ZD")) return "JM99ah";    // Albania
  if (callsign.startsWith("ZE")) return "JM99ah";    // Albania
  if (callsign.startsWith("Y2")) return "FM07vx";    // Germany (V Rhodes)
  if (callsign.startsWith("Y3")) return "FM07vx";    // Germany (V Rhodes)
  if (callsign.startsWith("Y4")) return "FM07vx";    // Germany (V Rhodes)
  if (callsign.startsWith("Y5")) return "FM07vx";    // Germany (V Rhodes)
  
  // USA / Kanada (Callook działa, ale dla pewności)
  if (callsign.startsWith("K"))  return "EM48to";    // USA (rough center)
  if (callsign.startsWith("N"))  return "EM48to";    // USA
  if (callsign.startsWith("W"))  return "EM48to";    // USA
  if (callsign.startsWith("AA")) return "EM48to";    // USA
  if (callsign.startsWith("AB")) return "EM48to";    // USA
  if (callsign.startsWith("AC")) return "EM48to";    // USA
  if (callsign.startsWith("AD")) return "EM48to";    // USA
  if (callsign.startsWith("AE")) return "EM48to";    // USA
  if (callsign.startsWith("AF")) return "EM48to";    // USA
  if (callsign.startsWith("AG")) return "EM48to";    // USA
  if (callsign.startsWith("AH")) return "EM48to";    // USA
  if (callsign.startsWith("AI")) return "EM48to";    // USA
  if (callsign.startsWith("AJ")) return "EM48to";    // USA
  if (callsign.startsWith("AK")) return "EM48to";    // USA
  if (callsign.startsWith("AL")) return "EM48to";    // USA
  if (callsign.startsWith("VE")) return "FN25bh";    // Canada
  if (callsign.startsWith("VA")) return "FN25bh";    // Canada
  if (callsign.startsWith("VY")) return "FN25bh";    // Canada
  if (callsign.startsWith("VO")) return "FN25bh";    // Canada
  
  return ""; // Nieznany prefiks
}

bool fetchHamQthCallsignInfo(const String &callsign, String &outGrid, String &outCountry,
                               String &outName, String &outEmail, String &outQth, double &outLat, double &outLon, bool &outHasLatLon) {
  if (!wifiConnected || WiFi.status() != WL_CONNECTED) {
    return false;
  }

  outGrid = "";
  outCountry = "";
  outName = "";
  outEmail = "";
  outQth = "";
  outLat = 0.0;
  outLon = 0.0;
  outHasLatLon = false;

  String call = callsign;
  call.toUpperCase();
  call.trim();
  if (call.length() == 0) return false;

