Tom50505050/esp32-ham-clock/src/main.cpp
  // Check cache first
  unsigned long now = millis();
  for (int i = 0; i < QRZ_CACHE_SIZE; i++) {
    if (qrzCache[i].callsign == call && (now - qrzCache[i].fetchedAtMs) < QRZ_CACHE_TTL_MS) {
      outGrid = qrzCache[i].grid;
      outCountry = qrzCache[i].country;
      outName = qrzCache[i].name;
      outEmail = qrzCache[i].email;
      outQth = qrzCache[i].qth;
      outLat = qrzCache[i].lat;
      outLon = qrzCache[i].lon;
      outHasLatLon = qrzCache[i].hasLatLon;
      return (outGrid.length() > 0 || outCountry.length() > 0 || outName.length() > 0);
    }
  }

  // HamQTH API - no login required for basic info
  String url = "https://www.hamqth.com/dxcc_json.php?callsign=" + call + "&apikey=ESP32HAMCLOCK";
  HTTPClient http;
  http.setTimeout(5000);
  http.begin(url);
  int code = http.GET();
  if (code != 200) {
    http.end();
    Serial.print("[HAMQTH] HTTP error: ");
    Serial.println(code);
    return false;
  }
  String body = http.getString();
  http.end();

  // Parse JSON response
  DynamicJsonDocument doc(1024);
  DeserializationError err = deserializeJson(doc, body);
  if (err) {
    Serial.print("[HAMQTH] JSON parse error: ");
    Serial.println(err.c_str());
    return false;
  }

  // Check if callsign found
  const char* error = doc["error"];
  if (error) {
    Serial.print("[HAMQTH] Error: ");
    Serial.println(error);
    return false;
  }

  // Extract data
  const char* name = doc["name"];
  if (name) outName = String(name);
  
  const char* grid = doc["grid"];
  if (grid) outGrid = String(grid);
  
  const char* country = doc["country"];
  if (country) outCountry = String(country);
  
  const char* qth = doc["qth"];
  if (qth) outQth = String(qth);
  
  // Get coordinates from grid if available
  if (outGrid.length() >= 4) {
    locatorToLatLon(outGrid, outLat, outLon);
    outHasLatLon = true;
  } else {
    // Brak grid z API - spróbuj przybliżony z prefiksu
    String approxGrid = getApproximateGridFromCallsign(call);
    if (approxGrid.length() >= 4) {
      outGrid = approxGrid + " (approx)";
      locatorToLatLon(approxGrid, outLat, outLon);
      outHasLatLon = true;
      Serial.print("[HAMQTH] Using approximate grid from prefix: ");
      Serial.println(approxGrid);
    }
  }

  // Save to cache
  int oldestIdx = 0;
  unsigned long oldestMs = qrzCache[0].fetchedAtMs;
  for (int i = 1; i < QRZ_CACHE_SIZE; i++) {
    if (qrzCache[i].fetchedAtMs < oldestMs) {
      oldestMs = qrzCache[i].fetchedAtMs;
      oldestIdx = i;
    }
  }
  qrzCache[oldestIdx].callsign = call;
  qrzCache[oldestIdx].grid = outGrid;
  qrzCache[oldestIdx].country = outCountry;
  qrzCache[oldestIdx].name = outName;
  qrzCache[oldestIdx].email = outEmail;
  qrzCache[oldestIdx].qth = outQth;
  qrzCache[oldestIdx].lat = (float)outLat;
  qrzCache[oldestIdx].lon = (float)outLon;
  qrzCache[oldestIdx].hasLatLon = outHasLatLon;
  qrzCache[oldestIdx].fetchedAtMs = now;

  Serial.print("[HAMQTH] Fetched: ");
  Serial.print(call);
  Serial.print(" - Name: '");
  Serial.print(outName);
  Serial.print("', Grid: '");
  Serial.print(outGrid);
  Serial.print("', Country: '");
  Serial.print(outCountry);
  Serial.println("'");

  return (outGrid.length() > 0 || outCountry.length() > 0 || outName.length() > 0);
}

bool fetchQrzCallsignInfo(const String &callsign, String &outGrid, String &outCountry,
                          String &outName, String &outEmail, String &outQth, double &outLat, double &outLon, bool &outHasLatLon) {
  if (!wifiConnected || WiFi.status() != WL_CONNECTED) {
    qrzStatus = "QRZ: no wifi";
    return false;
  }

  outGrid = "";
  outCountry = "";
  outName = "";
  outEmail = "";
  outQth = "";
  outLat = 0.0;
  outLon = 0.0;
  outHasLatLon = false;

  String call = callsign;
  call.toUpperCase();
  unsigned long now = millis();
  for (int i = 0; i < QRZ_CACHE_SIZE; i++) {
    if (qrzCache[i].callsign == call && (now - qrzCache[i].fetchedAtMs) < QRZ_CACHE_TTL_MS) {
      outGrid = qrzCache[i].grid;
      outCountry = qrzCache[i].country;
      outName = qrzCache[i].name;
      outEmail = qrzCache[i].email;
      outQth = qrzCache[i].qth;
      outLat = qrzCache[i].lat;
      outLon = qrzCache[i].lon;
      outHasLatLon = qrzCache[i].hasLatLon;
      return (outGrid.length() > 0 || outCountry.length() > 0 || outName.length() > 0);
    }
  }

  String sessionKey;
  if (!ensureQrzSession(sessionKey)) {
    return false;
  }

  String url = "https://xmldata.qrz.com/xml/current/?s=" + sessionKey +
               ";callsign=" + callsign;
  HTTPClient http;
  http.setTimeout(3000);
  http.begin(url);
  int code = http.GET();
  if (code != 200) {
    http.end();
    qrzStatus = "QRZ: lookup http " + String(code);
    return false;
  }
  String body = http.getString();
  http.end();

  // Obsługa błędu sesji - spróbuj raz odświeżyć
  if (body.indexOf("Session Timeout") >= 0 || body.indexOf("Invalid session") >= 0) {
    String dummy;
    ensureQrzSession(dummy);
    qrzStatus = "QRZ: session expired";
    return false;
  }

  String grid = extractXmlTagValue(body, "grid");
  String country = extractXmlTagValue(body, "country");
  String name = extractXmlTagValue(body, "name");
  if (name.length() == 0) {
    name = extractXmlTagValue(body, "Name");  // Capitalized variant
  }
  if (name.length() == 0) {
    name = extractXmlTagValue(body, "fname");  // First name
  }
  if (name.length() == 0) {
    name = extractXmlTagValue(body, "Fname");  // Capitalized first name
  }
  String email = extractXmlTagValue(body, "email");
  if (email.length() == 0) {
    email = extractXmlTagValue(body, "Email");  // Capitalized variant
  }
  String qth = extractXmlTagValue(body, "qth");
  if (qth.length() == 0) {
    qth = extractXmlTagValue(body, "Qth");  // Capitalized variant
    if (qth.length() == 0) {
      qth = extractXmlTagValue(body, "QTH");  // All caps variant
    }
  }
  String latStr = extractXmlTagValue(body, "lat");
  String lonStr = extractXmlTagValue(body, "lon");
  grid.trim();
  country.trim();
  name.trim();
  if (country.length() == 0) {
    country = extractXmlTagValue(body, "dxcc");
    country.trim();
  }

