Tom50505050/esp32-ham-clock/src/main.cpp
bool isQrzQueued(const String &callsign) {
  String normalized = callsign;
  normalized.trim();
  normalized.toUpperCase();
  for (int i = 0; i < qrzQueueLen; i++) {
    String queuedCall = qrzQueue[i].callsign;
    queuedCall.toUpperCase();
    if (queuedCall == normalized) {
      return true;
    }
  }
  return false;
}

void enqueueQrzLookup(const String &callsign) {
  String normalized = callsign;
  normalized.trim();
  normalized.toUpperCase();
  if (normalized.length() == 0) {
    return;
  }
  if (qrzQueueLen >= QRZ_QUEUE_SIZE) {
    return;
  }
  if (isQrzQueued(normalized)) {
    return;
  }

  // Nie dodawaj do kolejki, jeżeli mamy już świeży wpis w cache ze wszystkimi danymi.
  String grid;
  String country;
  String name;
  String email;
  String qth;
  double lat = 0.0;
  double lon = 0.0;
  bool hasLatLon = false;
  if (getQrzCacheFresh(normalized, grid, country, name, email, qth, lat, lon, hasLatLon, QRZ_CACHE_TTL_MS)) {
    return;
  }

  PendingQrzLookup item;
  item.callsign = normalized;
  item.nextTryMs = millis();
  item.attempts = 0;
  qrzQueue[qrzQueueLen++] = item;
}

// Pobierz spoty POTA z publicznego API i uzupełnij bufor + kolejkę QRZ
bool fetchPotaApi() {
  if (!wifiConnected) return false;
  auto decodeToSpots = [&](JsonDocument &doc) -> bool {
    JsonArray arr;
    if (doc.is<JsonArray>()) {
      arr = doc.as<JsonArray>();
    } else if (doc["spots"].is<JsonArray>()) {
      arr = doc["spots"].as<JsonArray>();
    }
    if (arr.isNull() || arr.size() == 0) {
      return false;
    }

    potaSpotCount = 0;
    for (JsonObject spot : arr) {
      if (potaSpotCount >= MAX_POTA_SPOTS) break;
      DXSpot s;
      s.time = spot["activatorLastSpotTime"] | spot["spotTime"] | "";
      s.callsign = spot["activator"] | spot["call"] | spot["callsign"] | "";
      float freq = 0.0f;
      if (spot["frequency"].is<float>() || spot["frequency"].is<double>()) {
        freq = spot["frequency"].as<float>();
      } else if (spot["frequency"].is<int>() || spot["frequency"].is<long>()) {
        freq = (float)spot["frequency"].as<long>();
      } else if (spot["frequency"].is<const char*>() || spot["frequency"].is<String>()) {
        String fstr = spot["frequency"].as<String>();
        freq = fstr.toFloat();
      }
      if (freq > 0) {
        s.frequency = freq / 1000.0f;
      } else {
        s.frequency = 0.0f;
      }
      s.band = getBand(s.frequency);
      s.mode = spot["mode"] | "";
      s.mode.toUpperCase();
      if (s.mode.length() == 0) {
        s.mode = getMode(spot["comments"] | "");
      }
      s.country = spot["country"] | "";
      s.spotter = spot["spotter"] | "";
      s.comment = spot["comments"] | "";
      s.distance = 0;
      s.hasLatLon = false;
      applyQrzCacheToSpot(s, QRZ_CACHE_TTL_MS);
      compactDxSpotStrings(s);
      potaSpots[potaSpotCount++] = s;
      if (s.country.length() == 0 && s.callsign.length() > 0) {
        enqueueQrzLookup(s.callsign);
      }
    }
    return potaSpotCount > 0;
  };

  HTTPClient http;
  http.setTimeout(15000);
  if (!http.begin(potaApiUrl)) {
    Serial.println("[POTA] http.begin failed");
    return false;
  }
  int code = http.GET();
  if (code != HTTP_CODE_OK) {
    Serial.print("[POTA] HTTP GET failed: ");
    Serial.print(code);
    Serial.print(" - ");
    Serial.println(http.errorToString(code));
    http.end();
    return false;
  }
  int contentLength = http.getSize();
  Serial.print("[POTA] HTTP ");
  Serial.print(code);
  Serial.print(", content-length=");
  Serial.print(contentLength);
  Serial.println(" (may be -1 if chunked)");

  WiFiClient *stream = http.getStreamPtr();
  DynamicJsonDocument filter(512);
  JsonObject filterRootArray = filter[0].to<JsonObject>();
  filterRootArray["activatorLastSpotTime"] = true;
  filterRootArray["spotTime"] = true;
  filterRootArray["activator"] = true;
  filterRootArray["call"] = true;
  filterRootArray["callsign"] = true;
  filterRootArray["frequency"] = true;
  filterRootArray["mode"] = true;
  filterRootArray["country"] = true;
  filterRootArray["spotter"] = true;
  filterRootArray["comments"] = true;

  DynamicJsonDocument doc(200000);
  DeserializationError err = deserializeJson(doc, *stream, DeserializationOption::Filter(filter));
  http.end();
  bool parsedOk = (!err && decodeToSpots(doc));
  if (!parsedOk) {
    if (err) {
      Serial.print("[POTA] Filtered JSON parse error: ");
      Serial.print(err.c_str());
      Serial.print(" (content-length was ");
      Serial.print(contentLength);
      Serial.println(")");
    }
    Serial.println("[POTA] Filtered parse empty - retrying without filter");

    HTTPClient retry;
    retry.setTimeout(8000);
    if (!retry.begin(potaApiUrl)) {
      return false;
    }
    int retryCode = retry.GET();
    if (retryCode != HTTP_CODE_OK) {
      retry.end();
      return false;
    }
    WiFiClient *retryStream = retry.getStreamPtr();
    DynamicJsonDocument fullDoc(400000);
    DeserializationError retryErr = deserializeJson(fullDoc, *retryStream);
    retry.end();
    if (retryErr) {
      Serial.print("[POTA] Fallback JSON parse error: ");
      Serial.println(retryErr.c_str());
      return false;
    }
    if (!decodeToSpots(fullDoc)) {
      Serial.println("[POTA] Fallback parse also returned 0 spots");
      return false;
    }
  }

  // Posortuj malejąco po czasie (ISO string porównuje się leksykograficznie poprawnie)
  for (int i = 0; i < potaSpotCount - 1; i++) {
    for (int j = i + 1; j < potaSpotCount; j++) {
      if (potaSpots[j].time > potaSpots[i].time) {
        DXSpot tmp = potaSpots[i];
        potaSpots[i] = potaSpots[j];
        potaSpots[j] = tmp;
      }
    }
  }

  return potaSpotCount > 0;
}

void removeQrzQueueAt(int idx) {
  if (idx < 0 || idx >= qrzQueueLen) {
    return;
  }
  for (int i = idx; i < qrzQueueLen - 1; i++) {
    qrzQueue[i] = qrzQueue[i + 1];
  }
  qrzQueueLen--;
}

void updateSpotsWithQrz(const String &callsign, const String &grid,
                        const String &country, const String &name, double lat, double lon, bool hasLatLon) {
  bool updated = false;
  bool updatedPota = false;
  if (!userLatLonValid && userLocator.length() >= 4) {
    double tmpLat = 0.0;
    double tmpLon = 0.0;
    locatorToLatLon(userLocator, tmpLat, tmpLon);
    userLat = tmpLat;
    userLon = tmpLon;
    userLatLonValid = true;
  }
  lockDxSpots();
  for (int i = 0; i < spotCount; i++) {
    if (!spots[i].callsign.equalsIgnoreCase(callsign)) {
      continue;
    }

    if (grid.length() >= 4) {
      spots[i].locator = grid;
    }
    if (country.length() > 0) {
      spots[i].country = country;
    }
    if (name.length() > 0) {
      spots[i].name = name;
    }

