Tom50505050/esp32-ham-clock/src/main.cpp
  WiFiClient client;
  client.setTimeout(1200);
  if (!client.connect(hamalertHost.c_str(), hamalertPort)) {
    Serial.println("[HAMALERT] connect failed");
    return false;
  }
  Serial.println("[HAMALERT] connected");

  hamalertSpotCount = 0;
  String line;
  line.reserve(HAMALERT_MAX_LINE_LEN + 16);

  // Odczytaj ewentualny banner/prompt przed logowaniem
  unsigned long preLoginUntil = millis() + 1200;
  while (millis() < preLoginUntil && client.connected()) {
    while (client.available()) {
      char c = (char)client.read();
      if (c == '\r') continue;
      if (c == '\n') {
        if (line.length() > 0) {
          Serial.print("[HAMALERT] < ");
          Serial.println(line);
        }
        line = "";
      } else if (line.length() < HAMALERT_MAX_LINE_LEN) {
        line += c;
      }
    }
    delay(2);
    yield();
  }
  if (line.length() > 0) {
    Serial.print("[HAMALERT] < ");
    Serial.println(line);
    line = "";
  }

  // HamAlert telnet wymaga username + password
  Serial.print("[HAMALERT] > username: ");
  Serial.println(login);
  client.print(login);
  client.print("\n");

  delay(180);
  Serial.print("[HAMALERT] > password: (");
  Serial.print(hamalertPassword.length());
  Serial.println(" chars)");
  client.print(hamalertPassword);
  client.print("\n");

  delay(220);
  Serial.println("[HAMALERT] > set/json");
  client.print("set/json\n");

  delay(240);
  Serial.println("[HAMALERT] > sh/dx 30");
  client.print("sh/dx 30\n");

  const unsigned long started = millis();
  unsigned long lastRx = millis();
  const unsigned long totalTimeoutMs = 9000;
  const unsigned long idleTimeoutMs = 1800;
  int parsedOkCount = 0;
  int parsedFailCount = 0;
  int diagLineCount = 0;

  while (client.connected() && (millis() - started) < totalTimeoutMs) {
    while (client.available()) {
      char c = (char)client.read();
      lastRx = millis();
      if (c == '\r') {
        continue;
      }
      if (c == '\n') {
        if (line.length() > 0) {
          DXSpot s;
          if (parseHamalertSpotLine(line, s)) {
            addHamalertSpot(s);
            parsedOkCount++;
            if (hamalertSpotCount >= MAX_POTA_SPOTS) {
              break;
            }
          } else {
            parsedFailCount++;
            String lowerLine = line;
            lowerLine.toLowerCase();
            if (lowerLine.indexOf("invalid") >= 0 || lowerLine.indexOf("error") >= 0 || lowerLine.indexOf("denied") >= 0 ||
                lowerLine.indexOf("login") >= 0 || lowerLine.indexOf("password") >= 0 || lowerLine.indexOf("failed") >= 0) {
              Serial.print("[HAMALERT] server: ");
              Serial.println(line);
            } else if (diagLineCount < 8) {
              Serial.print("[HAMALERT] line(unparsed): ");
              Serial.println(line);
              diagLineCount++;
            }
          }
        }
        line = "";
      } else if (line.length() < HAMALERT_MAX_LINE_LEN) {
        line += c;
      }
    }
    if ((millis() - lastRx) > idleTimeoutMs && hamalertSpotCount > 0) {
      break;
    }
    if (hamalertSpotCount >= MAX_POTA_SPOTS) {
      break;
    }
    yield();
    delay(2);
  }

  if (line.length() > 0 && hamalertSpotCount < MAX_POTA_SPOTS) {
    DXSpot s;
    if (parseHamalertSpotLine(line, s)) {
      addHamalertSpot(s);
      parsedOkCount++;
    } else {
      parsedFailCount++;
    }
  }

  client.stop();
  Serial.print("[HAMALERT] done: spots=");
  Serial.print(hamalertSpotCount);
  Serial.print(", parsed_ok=");
  Serial.print(parsedOkCount);
  Serial.print(", parsed_fail=");
  Serial.println(parsedFailCount);
  return hamalertSpotCount > 0;
}

// ========== APRS-IS FUNKCJE ==========

// PoÄąâ€šĂ„â€¦cz z serwerem APRS-IS
void connectToAPRS() {
  Serial.println("[APRS] connectToAPRS() START");
  
  if (!wifiConnected) {
    Serial.println("[APRS] WiFi nie poÄąâ€šĂ„â€¦czony - wyjÄąâ€şcie");
    return;
  }
  
  if (aprsClient.connected()) {
    // JeÄąâ€şli konfiguracja siĂ„â„˘ zmieniÄąâ€ša, rozÄąâ€šĂ„â€¦cz i poÄąâ€šĂ„â€¦cz ponownie
    Serial.println("[APRS] JuÄąÄ˝ poÄąâ€šĂ„â€¦czony - sprawdzam czy potrzeba reconnect...");
    // MoÄąÄ˝na dodaĂ„â€ˇ sprawdzenie czy konfiguracja siĂ„â„˘ zmieniÄąâ€ša, ale na razie zostawiamy jak jest
    // W razie potrzeby reconnect nastĂ„â€¦pi automatycznie przez watchdog
    return;
  }
  
  unsigned long now = millis();
  if (now - lastAPRSAttempt < 5000) {
    return; // Cichy return - nie spamuj logu
  }
  
  lastAPRSAttempt = now;
  
  Serial.print("[APRS] ÄąÂĂ„â€¦czenie z APRS-IS: ");
  Serial.print(aprsIsHost);
  Serial.print(":");
  Serial.println(aprsIsPort);
  
  // Diagnostyka DNS
  IPAddress resolvedIp;
  if (WiFi.hostByName(aprsIsHost.c_str(), resolvedIp)) {
    Serial.print("DNS OK: ");
    Serial.print(aprsIsHost);
    Serial.print(" -> ");
    Serial.println(resolvedIp);
  } else {
    Serial.print("DNS FAIL dla hosta: ");
    Serial.println(aprsIsHost);
  }
  
  Serial.println("[APRS] WywoÄąâ€šanie aprsClient.connect()...");
  unsigned long connectStart = millis();
  
  // Ustaw timeout poÄąâ€šĂ„â€¦czenia (300 sekund jak w wymaganiach)
  aprsClient.setTimeout(300);
  
  if (aprsClient.connect(aprsIsHost.c_str(), aprsIsPort)) {
    unsigned long connectTime = millis() - connectStart;
    Serial.print("[APRS] PoÄąâ€šĂ„â€¦czono z APRS-IS! (czas: ");
    Serial.print(connectTime);
    Serial.println("ms)");
    aprsConnected = true;
    aprsBuffer = "";
    aprsLoginSent = false;
    lastAPRSRxMs = millis();
    
    // Zaplanuj wysÄąâ€šanie loginu
    delay(500); // KrÄ‚łtkie opÄ‚łÄąĹźnienie przed loginem
    sendAPRSLogin();
  } else {
    unsigned long connectTime = millis() - connectStart;
    Serial.print("[APRS] BÄąâ€šĂ„â€¦d poÄąâ€šĂ„â€¦czenia z APRS-IS (czas: ");
    Serial.print(connectTime);
    Serial.println("ms)");
    aprsConnected = false;
  }
  Serial.println("[APRS] connectToAPRS() END");
}

// Wyślij login do APRS-IS
void sendAPRSLogin() {
  if (!aprsConnected || !aprsClient.connected()) {
    Serial.println("[APRS] Nie mozna wysłać loginu - brak połączenia");
    return;
  }
  
  // Format loginu: user Callsign pass 23123 vers ESP32-HAM-CLOCK 1.2
  String login = "user ";
  login += getAprsTxCallsignWithSsid();
  login += " pass ";
  login += String(aprsPasscode);
  login += " vers ESP32-HAM-CLOCK 1.2";
  
  Serial.print("[APRS] Wysyłanie loginu: ");
  Serial.println(login);
  
  aprsClient.println(login);
  aprsLoginSent = true;
  lastAPRSRxMs = millis();
  
  // Po zalogowaniu wyÄąâ€şlij filtr
  delay(500);
  sendAPRSFilter();
}

// WyÄąâ€şlij komendĂ„â„˘ filtra do APRS-IS
void sendAPRSFilter() {
  if (!aprsConnected || !aprsClient.connected()) {
    Serial.println("[APRS] Nie moÄąÄ˝na wysÄąâ€šaĂ„â€ˇ filtra - brak poÄąâ€šĂ„â€¦czenia");
    return;
  }
  
  // Format filtra: #filter r/52.40/16.92/50
  // UÄąÄ˝ywamy wspÄ‚łÄąâ€šrzĂ„â„˘dnych z sekcji "Moja Stacja"
  double filterLat = userLatLonValid ? userLat : 52.40;  // Fallback jeÄąâ€şli nie ustawione
  double filterLon = userLatLonValid ? userLon : 16.92;
  String filter = "#filter r/";
  filter += String(filterLat, 2);
  filter += "/";
  filter += String(filterLon, 2);
  filter += "/";
  filter += String(aprsFilterRadius);
  
  Serial.print("[APRS] WysyÄąâ€šanie filtra: ");
  Serial.println(filter);
  
  aprsClient.println(filter);
  lastAPRSRxMs = millis();
}

String formatAprsCoordinate(double value, bool isLat) {
  double absVal = fabs(value);
  int degrees = (int)absVal;
  double minutes = (absVal - degrees) * 60.0;
  String degText;
  if (isLat) {
    degText = (degrees < 10 ? "0" : "") + String(degrees);
  } else {
    if (degrees < 10) degText = "00" + String(degrees);
    else if (degrees < 100) degText = "0" + String(degrees);
    else degText = String(degrees);
  }

  String minText = String(minutes, 2);
  if (minutes < 10.0) {
    minText = "0" + minText;
  }

  char hemi = isLat ? ((value >= 0.0) ? 'N' : 'S') : ((value >= 0.0) ? 'E' : 'W');
  return degText + minText + String(hemi);
}

static bool isValidAprsSymbolChar(char c) {
  return (c >= 33 && c <= 126); // widoczne ASCII bez spacji/kontrolnych
}

static String sanitizeAprsSymbol(const String &sym) {
  String s = sym;
  s.trim();
  if (s.length() < 2) {
    return String(DEFAULT_APRS_SYMBOL_TABLE) + String(DEFAULT_APRS_SYMBOL_CODE);
  }
  s = s.substring(0, 2);
  if (!isValidAprsSymbolChar(s.charAt(0)) || !isValidAprsSymbolChar(s.charAt(1))) {
    return String(DEFAULT_APRS_SYMBOL_TABLE) + String(DEFAULT_APRS_SYMBOL_CODE);
  }
  return s;
}

static void applyAprsSymbol(const String &sym) {
  String s = sanitizeAprsSymbol(sym);
  aprsSymbolTwoChar = s;
  aprsSymbolTable = s.charAt(0);
  aprsSymbolCode = s.charAt(1);
}

static int normalizeAprsSsid(int ssid) {
  if (ssid < 0) return 0;
  if (ssid > 15) return 15;
  return ssid;
}

