Tom50505050/esp32-ham-clock/src/main.cpp
static void applyAprsSsid(int ssid) {
  aprsSsid = normalizeAprsSsid(ssid);
}

static String getAprsBaseCallsign() {
  String call = aprsCallsign.length() ? aprsCallsign : userCallsign;
  call.trim();
  call.toUpperCase();
  int dash = call.indexOf('-');
  if (dash > 0) {
    call = call.substring(0, dash);
  }
  return call;
}

static String getAprsTxCallsignWithSsid() {
  String baseCall = getAprsBaseCallsign();
  if (aprsSsid <= 0) {
    return baseCall;
  }
  return baseCall + "-" + String(aprsSsid);
}

static String sanitizeAprsComment(const String &cmt) {
  String s = cmt;
  s.trim();
  String out = "";
  for (size_t i = 0; i < s.length(); i++) {
    char c = s.charAt(i);
    if (c >= 32 && c <= 126) { // drukowalne ASCII
      out += c;
    }
    if (out.length() >= 43) { // rekomendowany limit komentarza APRS
      break;
    }
  }
  return out;
}

static String sanitizeAprsAlertWatchToken(const String &raw) {
  String token = raw;
  token.trim();
  token.toUpperCase();

  bool wildcardAnySsid = false;
  if (token.endsWith("*")) {
    wildcardAnySsid = true;
    token.remove(token.length() - 1);
  }

  String cleaned = "";
  for (size_t i = 0; i < token.length(); i++) {
    char ch = token.charAt(i);
    bool ok = (ch >= 'A' && ch <= 'Z') || (ch >= '0' && ch <= '9') || ch == '-' || ch == '/';
    if (ok) cleaned += ch;
  }

  if (cleaned.length() == 0) {
    return "";
  }
  if (wildcardAnySsid) {
    cleaned += "*";
  }
  return cleaned;
}

static String sanitizeAprsAlertList(const String &raw) {
  String src = raw;
  src.trim();
  if (src.length() == 0) return "";

  String out = "";
  int count = 0;
  int start = 0;

  while (start <= src.length() && count < 20) {
    int comma = src.indexOf(',', start);
    int end = (comma >= 0) ? comma : src.length();
    String token = src.substring(start, end);
    String cleaned = sanitizeAprsAlertWatchToken(token);

    if (cleaned.length() > 0) {
      if (count > 0) out += ",";
      out += cleaned;
      count++;
    }

    if (comma < 0) break;
    start = comma + 1;
  }

  return out;
}

static int normalizeAprsAlertMinSeconds(int seconds) {
  if (seconds < 0) return 0;
  if (seconds > 86400) return 86400;
  return seconds;
}

static void applyAprsAlertMinSeconds(int seconds) {
  aprsAlertMinSeconds = normalizeAprsAlertMinSeconds(seconds);
}

static float normalizeAprsAlertDistanceKm(float km) {
  if (km < 0.1f) return 0.1f;
  if (km > 500.0f) return 500.0f;
  return km;
}

static void applyAprsAlertDistanceKm(float km) {
  aprsAlertDistanceKm = normalizeAprsAlertDistanceKm(km);
}

static int normalizeAprsAlertScreenSeconds(int seconds) {
  if (seconds < 1) return 1;
  if (seconds > 60) return 60;
  return seconds;
}

static void applyAprsAlertScreenSeconds(int seconds) {
  aprsAlertScreenSeconds = normalizeAprsAlertScreenSeconds(seconds);
}

static String sanitizeAprsCallsignToken(const String &raw) {
  String token = raw;
  token.trim();
  token.toUpperCase();

  String cleaned = "";
  for (size_t i = 0; i < token.length(); i++) {
    char ch = token.charAt(i);
    bool ok = (ch >= 'A' && ch <= 'Z') || (ch >= '0' && ch <= '9') || ch == '-' || ch == '/';
    if (ok) cleaned += ch;
  }
  return cleaned;
}

static String getAprsCallsignBase(const String &callsign) {
  String normalized = sanitizeAprsCallsignToken(callsign);
  int dash = normalized.indexOf('-');
  if (dash > 0) {
    normalized = normalized.substring(0, dash);
  }
  return normalized;
}

static bool isAprsAlertCallMatch(const String &watchedToken, const String &incomingCallsign) {
  if (watchedToken.length() == 0 || incomingCallsign.length() == 0) {
    return false;
  }

  String watched = sanitizeAprsAlertWatchToken(watchedToken);
  String incoming = sanitizeAprsCallsignToken(incomingCallsign);
  if (watched.length() == 0 || incoming.length() == 0) {
    return false;
  }

  if (watched.endsWith("*")) {
    String base = watched.substring(0, watched.length() - 1);
    if (base.length() == 0) {
      return false;
    }
    if (incoming.equals(base)) {
      return true;
    }
    String withSsidPrefix = base + "-";
    return incoming.startsWith(withSsidPrefix);
  }

  return watched.equals(incoming);
}

static bool isAprsCallsignOnAlertList(const String &incomingCallsign) {
  String src = aprsAlertCsv;
  src.trim();
  if (src.length() == 0) return false;

  int start = 0;
  while (start <= src.length()) {
    int comma = src.indexOf(',', start);
    int end = (comma >= 0) ? comma : src.length();
    String token = src.substring(start, end);
    token.trim();

    if (isAprsAlertCallMatch(token, incomingCallsign)) {
      return true;
    }

    if (comma < 0) break;
    start = comma + 1;
  }

  return false;
}

static bool isAprsMobileSsid7or9(const String &incomingCallsign) {
  String normalized = sanitizeAprsCallsignToken(incomingCallsign);
  if (normalized.length() == 0) {
    return false;
  }

  int dash = normalized.lastIndexOf('-');
  if (dash <= 0 || dash >= (normalized.length() - 1)) {
    return false;
  }

  String ssid = normalized.substring(dash + 1);
  return ssid.equals("7") || ssid.equals("9");
}

static void resetAprsAlertCooldownState() {
  for (int i = 0; i < MAX_APRS_STATIONS; i++) {
    aprsAlertCooldown[i].callsign = "";
    aprsAlertCooldown[i].lastAlertMs = 0;
  }
  aprsAlertCooldownReplaceIdx = 0;
}

static bool shouldTriggerAprsAlert(const APRSStation &station) {
  bool watchListMatched = isAprsCallsignOnAlertList(station.callsign);

  bool nearbyMobileMatched = false;
  if (aprsAlertNearbyEnabled && station.hasLatLon && station.distance >= 0.0f && station.distance <= aprsAlertDistanceKm) {
    nearbyMobileMatched = isAprsMobileSsid7or9(station.callsign);
  }

  bool weatherStationMatched = aprsAlertWxEnabled && isAprsWxPayloadValidForAlert(station);

  if (!watchListMatched && !nearbyMobileMatched && !weatherStationMatched) {
    return false;
  }

  String normalized = sanitizeAprsCallsignToken(station.callsign);
  if (normalized.length() == 0) {
    return false;
  }

