Tom50505050/esp32-ham-clock/src/main.cpp
  const unsigned long minGapMs = (unsigned long)aprsAlertMinSeconds * 1000UL;
  const unsigned long nowMs = millis();

  for (int i = 0; i < MAX_APRS_STATIONS; i++) {
    if (aprsAlertCooldown[i].callsign.equals(normalized)) {
      if (minGapMs > 0 && (nowMs - aprsAlertCooldown[i].lastAlertMs) < minGapMs) {
        return false;
      }
      aprsAlertCooldown[i].lastAlertMs = nowMs;
      return true;
    }
  }

  for (int i = 0; i < MAX_APRS_STATIONS; i++) {
    if (aprsAlertCooldown[i].callsign.length() == 0) {
      aprsAlertCooldown[i].callsign = normalized;
      aprsAlertCooldown[i].lastAlertMs = nowMs;
      return true;
    }
  }

  int replaceIdx = aprsAlertCooldownReplaceIdx;
  if (replaceIdx < 0 || replaceIdx >= MAX_APRS_STATIONS) {
    replaceIdx = 0;
  }
  aprsAlertCooldown[replaceIdx].callsign = normalized;
  aprsAlertCooldown[replaceIdx].lastAlertMs = nowMs;
  aprsAlertCooldownReplaceIdx = (replaceIdx + 1) % MAX_APRS_STATIONS;
  return true;
}

static void applyAprsIntervalMinutes(int minutes) {
  int m = minutes;
  if (m < 1) m = 1;
  if (m > 180) m = 180; // sanity bound 1..180 min
  aprsIntervalMinutes = m;
  aprsPositionIntervalMs = (unsigned long)m * 60UL * 1000UL;
  nextAPRSPositionDueMs = 0; // przelicz harmonogram od nowa
}

bool isAprsTxCallValid(const String &call) {
  String c = call;
  c.trim();
  c.toUpperCase();
  if (c.length() == 0) return false;
  int dash = c.indexOf('-');
  if (dash > 0) {
    c = c.substring(0, dash);
  }
  return c.length() > 0 && c != "NOCALL";
}

void sendAprsPosition() {
  if (!aprsBeaconEnabled || !aprsConnected || !aprsClient.connected() || !aprsLoginSent) {
    return;
  }
  if (!userLatLonValid) {
    Serial.println("[APRS] Pomijam TX pozycji - brak poprawnych współrzędnych użytkownika");
    return;
  }

  String txCallsign = getAprsTxCallsignWithSsid();
  txCallsign.trim();
  if (!isAprsTxCallValid(txCallsign)) {
    Serial.println("[APRS] Pomijam TX pozycji - ustaw znak w konfiguracji APRS");
    return;
  }
  txCallsign.toUpperCase();

  String latStr = formatAprsCoordinate(userLat, true);
  String lonStr = formatAprsCoordinate(userLon, false);

  String frame = txCallsign;
  frame += ">APRS,TCPIP*:";
  frame += "!";
  frame += latStr;
  frame += aprsSymbolTable;
  frame += lonStr;
  frame += aprsSymbolCode;
  frame += " ";
  bool useProjectComment = (((aprsBeaconTxCount + 1) % 5) == 0); // co piąty beacon
  String comment = useProjectComment ? String(APRS_POSITION_COMMENT)
                                     : sanitizeAprsComment(aprsUserComment);
  frame += comment;

  aprsClient.println(frame);
  lastAPRSPositionTxMs = millis();
  aprsBeaconTxCount++;

  Serial.print("[APRS] Wysłano pozycję: ");
  Serial.println(frame);
}

// Parsuj ramkĂ„â„˘ APRS
// Format przykÄąâ€šadowy: SP3KON-1>APRS,TCPIP*,qAC,T2POLAND:!5202.40N/01655.12E#PHG5130/Poznan
bool parseAPRSFrame(String line, APRSStation &station) {
  LOGV_PRINTF("[APRS] Parsing frame: %s\n", line.c_str());
  
  // WyczyÄąâ€şĂ„â€ˇ strukturĂ„â„˘
  station.time = "";
  station.callsign = "";
  station.symbol = "";
  station.symbolTable = "";
  station.lat = 0.0f;
  station.lon = 0.0f;
  station.comment = "";
  station.freqMHz = 0.0f;
  station.distance = 0.0f;
  station.hasLatLon = false;
  
  // Pobierz czas UTC
  struct tm timeinfo;
  if (getLocalTime(&timeinfo, 1)) {
    char timeBuffer[6];
    strftime(timeBuffer, 6, "%H%MZ", &timeinfo);
    station.time = String(timeBuffer);
  } else {
    station.time = "----Z";
  }
  
  // Parsuj callsign (przed >)
  int gtPos = line.indexOf('>');
  if (gtPos < 0) {
    LOGV_PRINTLN("[APRS] Brak znaku '>' w ramce - nieprawidÄąâ€šowy format");
    return false;
  }
  station.callsign = line.substring(0, gtPos);
  station.callsign.trim();
  LOGV_PRINTF("[APRS] Callsign: %s\n", station.callsign.c_str());

  // Najpierw sprÄ‚łbuj dekodowaĂ„â€ˇ Mic-E / skompresowane / obiekty z gotowego parsera
  bool advancedParsed = parseAprsAdvancedPosition(line, station);
  if (advancedParsed) {
    LOGV_PRINTF("[APRS] Advanced decode lat/lon: %.6f, %.6f\n", station.lat, station.lon);
  }
  
  // Parsuj pozycjĂ„â„˘ GPS (prosty parser) tylko jeÄąâ€şli advanced nie zadziaÄąâ€šaÄąâ€š
  // Szukaj formatu: !5202.40N/01655.12E, @5202.40N/01655.12E, =5202.40N/01655.12E, lub ;...*HHMMzDDMM.mmN/DDDMM.mmE
  int posStart = -1;
  char tableSymbol = 0;
  int commentBeforePos = -1; // Pozycja poczĂ„â€¦tku komentarza przed timestampem (dla formatu z ;)
  
  if (!advancedParsed) {
  // Szukaj standardowych formatÄ‚łw pozycji (!, @, =)
  posStart = line.indexOf('!');
  if (posStart >= 0) {
    tableSymbol = '!';
  } else {
    posStart = line.indexOf('@');
    if (posStart >= 0) {
      tableSymbol = '@';
    } else {
      posStart = line.indexOf('=');
      if (posStart >= 0) {
        tableSymbol = '=';
      }
    }
  }
  
  // JeÄąâ€şli nie znaleziono standardowych formatÄ‚łw, szukaj w komentarzu (format z ;)
  if (posStart < 0) {
    int colonPos = line.indexOf(':');
    if (colonPos >= 0) {
      String commentPart = line.substring(colonPos + 1);
      // Szukaj formatu z ; i timestampem: ;...*HHMMzDDMM.mmN/DDDMM.mmE
      int semicolonPos = commentPart.indexOf(';');
      if (semicolonPos >= 0) {
        // Zapisz pozycjĂ„â„˘ poczĂ„â€¦tku komentarza przed timestampem
        commentBeforePos = colonPos + 1 + semicolonPos + 1; // +1 bo colonPos, +1 bo po ';'
        // Szukaj timestampu *HHMMz
        int timestampPos = commentPart.indexOf('*', semicolonPos);
        if (timestampPos >= 0 && timestampPos + 7 < commentPart.length()) {
          // SprawdÄąĹź czy po timestampie jest pozycja (format: *HHMMzDDMM.mmN)
          char zChar = commentPart.charAt(timestampPos + 6);
          if (zChar == 'z' || zChar == 'Z') {
            // Pozycja zaczyna siĂ„â„˘ po 'z'
            posStart = colonPos + 1 + timestampPos + 7; // +1 bo colonPos, +timestampPos, +7 bo "*HHMMz"
            tableSymbol = ';';
          }
        }
      }
    }
  }
  
  if (posStart < 0) {
    // Brak pozycji - sprÄ‚łbuj wyciĂ„â€¦gnĂ„â€¦Ă„â€ˇ tylko callsign i komentarz
    LOGV_PRINTLN("[APRS] Brak pozycji GPS w ramce");
    int colonPos = line.indexOf(':');
    if (colonPos >= 0) {
      station.comment = line.substring(colonPos + 1);
      station.comment.trim();
    }
    return true; // ZwrÄ‚łĂ„â€ˇ true nawet bez pozycji
  }
  
  LOGV_PRINTF("[APRS] Znaleziono pozycjĂ„â„˘ na indeksie %d, symbol tabeli: %c\n", posStart, tableSymbol);
  
  // Symbol table ustawimy po wyciĂ„â€¦gniĂ„â„˘ciu pozycji
  
