Tom50505050/esp32-ham-clock/src/main.cpp
  // Wyznacz poczĂ„â€¦tek pozycji (lat) zaleÄąÄ˝nie od formatu
  bool posStartIsSymbol = (tableSymbol == '!' || tableSymbol == '@' || tableSymbol == '=' || tableSymbol == '/');
  int latStart = posStartIsSymbol ? (posStart + 1) : posStart; // dla ';' posStart wskazuje juÄąÄ˝ na lat

  // ObsÄąâ€šuga timestampu dla @ lub /: @DDHHMMh... lub /DDHHMMh...
  if (tableSymbol == '@' || tableSymbol == '/') {
    if (posStart + 7 < line.length()) {
      bool tsDigits = true;
      for (int i = 1; i <= 6; i++) {
        char c = line.charAt(posStart + i);
        if (!isDigit(c)) {
          tsDigits = false;
          break;
        }
      }
      char tsChar = line.charAt(posStart + 7);
      if (tsDigits && (tsChar == 'h' || tsChar == 'z' || tsChar == '/')) {
        latStart = posStart + 8;
      }
    }
  }

  // SprawdÄąĹź czy jest format z "/" czy bez "/"
  int slashPos = line.indexOf('/', latStart);
  bool hasSlash = (slashPos >= 0);
  
  bool latOk = false;
  bool lonOk = false;

  if (hasSlash) {
    // Format z "/": !DDMM.mmN/DDDMM.mmEsymbol
    // Parsuj szerokoÄąâ€şĂ„â€ˇ geograficznĂ„â€¦: 5202.40N (format: DDMM.mmN)
    if (latStart + 7 < line.length()) {
      String latStr = line.substring(latStart, latStart + 7);
      if (latStr.length() == 7) {
        char dir = line.charAt(latStart + 7);
        // UÄąÄ˝yj funkcji convertToDecimal do parsowania
        float parsedLat = convertToDecimal(latStr, dir);
        if (!isnan(parsedLat)) {
          station.lat = parsedLat;
          latOk = true;
        }
        
        LOGV_PRINTF("[APRS] Parsed lat: %s%c -> %.6f\n", 
                    latStr.c_str(), dir, station.lat);
      }
    }
    
    // Parsuj dÄąâ€šugoÄąâ€şĂ„â€ˇ geograficznĂ„â€¦: 01655.12E (format: DDDMM.mmE)
    if (slashPos >= 0 && slashPos + 9 < line.length()) {
      String lonStr = line.substring(slashPos + 1, slashPos + 9);
      if (lonStr.length() == 8) {
        char dir = line.charAt(slashPos + 9);
        // UÄąÄ˝yj funkcji convertToDecimal do parsowania
        float parsedLon = convertToDecimal(lonStr, dir);
        if (!isnan(parsedLon)) {
          station.lon = parsedLon;
          lonOk = true;
        }
        
        LOGV_PRINTF("[APRS] Parsed lon: %s%c -> %.6f\n", 
                    lonStr.c_str(), dir, station.lon);
      }
    }
    
    // Symbol table (znak przed /)
    if (slashPos >= 0) {
      station.symbolTable = line.substring(slashPos, slashPos + 1);
    }
    // WyciĂ„â€¦gnij symbol code (znak po dÄąâ€šugoÄąâ€şci geograficznej, po "/")
    // Format: !DDMM.mmN/DDDMM.mmEsymbol
    if (slashPos >= 0 && slashPos + 10 < line.length()) {
      station.symbol = line.substring(slashPos + 10, slashPos + 11);
    }
  } else {
    // Format bez "/": DDMM.mmNsymbolDDDMM.mmE (symbol miĂ„â„˘dzy lat a lon)
    // PrzykÄąâ€šad: 5223.73NW01655.41E lub 5225.05NL01651.66E
    if (latStart + 7 < line.length()) {
      String latStr = line.substring(latStart, latStart + 7);
      if (latStr.length() == 7) {
        char dir = line.charAt(latStart + 7);
        // UÄąÄ˝yj funkcji convertToDecimal do parsowania
        float parsedLat = convertToDecimal(latStr, dir);
        if (!isnan(parsedLat)) {
          station.lat = parsedLat;
          latOk = true;
        }
        
        LOGV_PRINTF("[APRS] Parsed lat: %s%c -> %.6f\n", 
                    latStr.c_str(), dir, station.lat);
        
        // Symbol table jest zaraz po kierunku lat
        if (latStart + 8 < line.length()) {
          station.symbolTable = line.substring(latStart + 8, latStart + 9);
        }
        
        // DÄąâ€šugoÄąâ€şĂ„â€ˇ geograficzna zaczyna siĂ„â„˘ po symbolu table
        int lonStart = latStart + 9;
        if (lonStart + 7 < line.length()) {
          String lonStr = line.substring(lonStart, lonStart + 8);
          if (lonStr.length() == 8) {
            char dir = line.charAt(lonStart + 8);
            // UÄąÄ˝yj funkcji convertToDecimal do parsowania
            float parsedLon = convertToDecimal(lonStr, dir);
            if (!isnan(parsedLon)) {
              station.lon = parsedLon;
              lonOk = true;
            }
            
            LOGV_PRINTF("[APRS] Parsed lon: %s%c -> %.6f\n", 
                        lonStr.c_str(), dir, station.lon);

            // Symbol code jest po kierunku lon (jeÄąâ€şli wystĂ„â„˘puje)
            if (lonStart + 9 < line.length()) {
              station.symbol = line.substring(lonStart + 9, lonStart + 10);
            }
          }
        }
      }
    }
  }
  
  // Ustaw flagĂ„â„˘ poprawnoÄąâ€şci pozycji tylko jeÄąâ€şli mamy lat i lon
  station.hasLatLon = (latOk && lonOk);

  // WyciĂ„â€¦gnij komentarz (po symbolu i pozycji)
  // Format z "/": !5202.40N/01655.12E#symbol/komentarz lub !5202.40N/01655.12E#symbol komentarz
  // Format bez "/": DDMM.mmNsymbolDDDMM.mmE&komentarz
  // Format z ";": ;komentarz_przed*HHMMzDDMM.mmNsymbolDDDMM.mmE&komentarz_po
  int colonPos = line.indexOf(':');
  if (colonPos >= 0 && colonPos + 1 < line.length()) {
    String fullComment = "";
    
    if (tableSymbol == ';' && commentBeforePos >= 0) {
      // Format z ";": komentarz skÄąâ€šada siĂ„â„˘ z czĂ„â„˘Äąâ€şci przed timestampem i po pozycji
      // CzĂ„â„˘Äąâ€şĂ„â€ˇ przed timestampem
      int timestampStart = line.indexOf('*', commentBeforePos);
      if (timestampStart > commentBeforePos) {
        fullComment = line.substring(commentBeforePos, timestampStart);
      }
      
      // CzĂ„â„˘Äąâ€şĂ„â€ˇ po pozycji
      int commentAfterPos = -1;
      if (hasSlash) {
        int afterSymbol = slashPos + 11;
        if (afterSymbol < line.length()) {
          char c = line.charAt(afterSymbol);
          if (c == '&' || c == '#' || c == '/') {
            commentAfterPos = afterSymbol + 1;
          } else {
            commentAfterPos = afterSymbol;
          }
        }
      } else {
        // Format bez "/": komentarz zaczyna siĂ„â„˘ po lon
        int afterLon = latStart + 18;
        if (afterLon < line.length()) {
          char c = line.charAt(afterLon);
          if (c == '&' || c == '#' || c == '/') {
            commentAfterPos = afterLon + 1;
          } else {
            commentAfterPos = afterLon;
          }
        }
      }
      
      if (commentAfterPos >= 0 && commentAfterPos < line.length()) {
        if (fullComment.length() > 0) {
          fullComment += " ";
        }
        fullComment += line.substring(commentAfterPos);
      }
      
      station.comment = fullComment;
      station.comment.trim();
    } else {
      // Standardowe formaty (!, @, =)
      int commentStart = colonPos + 1;
      
      if (hasSlash && slashPos >= 0) {
        // Format z "/": komentarz zaczyna siĂ„â„˘ po symbolu
        int afterSymbol = slashPos + 11;
        if (afterSymbol < line.length()) {
          char c = line.charAt(afterSymbol);
          if (c == '#' || c == '/') {
            commentStart = afterSymbol + 1;
          } else {
            // Komentarz zaczyna siĂ„â„˘ zaraz po symbolu
            commentStart = afterSymbol;
          }
        }
      } else {
        // Format bez "/": komentarz zaczyna siĂ„â„˘ po lon (po kierunku E/W)
        int afterLon = latStart + 18;
        if (afterLon < line.length()) {
          char c = line.charAt(afterLon);
          if (c == '&' || c == '#' || c == '/') {
            commentStart = afterLon + 1;
          } else {
            // Komentarz zaczyna siĂ„â„˘ zaraz po lon
            commentStart = afterLon;
          }
        }
      }
      
      // JeÄąâ€şli commentStart jest przed koÄąâ€žcem linii, wyciĂ„â€¦gnij komentarz
      if (commentStart < line.length() && commentStart >= colonPos + 1) {
        station.comment = line.substring(commentStart);
        station.comment.trim();
      } else if (commentStart < colonPos + 1) {
        // JeÄąâ€şli nie znaleziono komentarza po pozycji, uÄąÄ˝yj caÄąâ€šej czĂ„â„˘Äąâ€şci po ":"
        station.comment = line.substring(colonPos + 1);
        station.comment.trim();
      }
    }
  }
  } // !advancedParsed
  
  // SprÄ‚łbuj wyciĂ„â€¦gnĂ„â€¦Ă„â€ˇ czĂ„â„˘stotliwoÄąâ€şĂ„â€ˇ z komentarza
  if (station.comment.length() > 0) {
    float freq = 0.0f;
    if (extractAPRSFrequencyMHz(station.comment, freq)) {
      station.freqMHz = freq;
    }
  }
  
