Tom50505050/esp32-ham-clock/src/main.cpp
  // Oblicz odlegÄąâ€šoÄąâ€şĂ„â€ˇ jeÄąâ€şli mamy pozycjĂ„â„˘
  // UÄąÄ˝ywamy wspÄ‚łÄąâ€šrzĂ„â„˘dnych z sekcji "Moja Stacja"
  if (station.hasLatLon) {
    // UÄąÄ˝yj double dla wiĂ„â„˘kszej precyzji obliczeÄąâ€ž
    double userLatForDistance = userLatLonValid ? userLat : 52.40;  // Fallback jeÄąâ€şli nie ustawione
    double userLonForDistance = userLatLonValid ? userLon : 16.92;
    double stationLat = (double)station.lat;
    double stationLon = (double)station.lon;
    
    station.distance = calculateDistance(userLatForDistance, userLonForDistance, 
                                         stationLat, stationLon);
    LOGV_PRINTF("[APRS] Distance: user(%.6f,%.6f) -> station(%.6f,%.6f) = %.1f km\n",
                userLatForDistance, userLonForDistance, stationLat, stationLon, station.distance);
  }
  
  return true;
}

// Dodaj nowĂ„â€¦ stacjĂ„â„˘ APRS do tablicy (bez duplikatÄ‚łw - aktualizuje istniejĂ„â€¦ce)
void addAPRSStation(APRSStation station) {
  compactAprsStationStrings(station);
  LOGV_PRINT("[APRS] addAPRSStation: ");
  LOGV_PRINT(station.callsign);
  if (station.hasLatLon) {
    LOGV_PRINT(" @ ");
    if (LOG_VERBOSE) Serial.print(station.lat, 4);
    LOGV_PRINT(",");
    if (LOG_VERBOSE) Serial.print(station.lon, 4);
    LOGV_PRINT(" (");
    if (LOG_VERBOSE) Serial.print(station.distance, 1);
    LOGV_PRINT(" km)");
  }
  LOGV_PRINTLN();
  
  // SprawdÄąĹź czy stacja juÄąÄ˝ istnieje (po callsign)
  int existingIndex = -1;
  for (int i = 0; i < aprsStationCount; i++) {
    if (aprsStations[i].callsign.equalsIgnoreCase(station.callsign)) {
      existingIndex = i;
      break;
    }
  }
  
  if (existingIndex >= 0) {
    // Stacja juÄąÄ˝ istnieje - usuÄąâ€ž jĂ„â€¦ z obecnej pozycji
    for (int i = existingIndex; i > 0; i--) {
      aprsStations[i] = aprsStations[i - 1];
    }
    // Zaktualizuj dane stacji (nowy czas, pozycja, itp.)
    aprsStations[0] = station;
    LOGV_PRINT("[APRS] Stacja juÄąÄ˝ istnieje - zaktualizowano na pozycji 0");
  } else {
    // Nowa stacja - dodaj na poczĂ„â€¦tku
    if (aprsStationCount < MAX_APRS_STATIONS) {
      aprsStationCount++;
    }
    
    // PrzesuÄąâ€ž wszystkie stacje o jeden w dÄ‚łÄąâ€š
    for (int i = MAX_APRS_STATIONS - 1; i > 0; i--) {
      aprsStations[i] = aprsStations[i - 1];
    }
    
    // Dodaj nowĂ„â€¦ stacjĂ„â„˘ na poczĂ„â€¦tku
    aprsStations[0] = station;
    LOGV_PRINT("[APRS] Dodano nowĂ„â€¦ stacjĂ„â„˘");
  }
  
  LOGV_PRINT("[APRS] addAPRSStation END, nowy aprsStationCount=");
  LOGV_PRINTLN(aprsStationCount);
}

// ObsÄąâ€šuga danych z APRS-IS
void handleAPRSData() {
  if (!aprsConnected || !aprsClient.connected()) {
    if (aprsConnected) {
      LOGV_PRINTLN("[APRS] PoÄąâ€šĂ„â€¦czenie zerwane - reset flagÄ‚łw");
    }
    aprsConnected = false;
    aprsLoginSent = false;
    return;
  }
  
  // Odczytaj dostĂ„â„˘pne dane
  while (aprsClient.available()) {
    unsigned char c = (unsigned char)aprsClient.read();
    lastAPRSRxMs = millis();
    
    if (c == '\n' || c == '\r') {
      if (aprsBuffer.length() > 0) {
        String line = aprsBuffer;
        aprsBuffer = "";
        
        // Ignoruj linie zaczynajĂ„â€¦ce siĂ„â„˘ od # (komentarze serwera)
        if (line.startsWith("#")) {
          Serial.print("[APRS] Server: ");
          Serial.println(line);
          continue;
        }
        
        // Parsuj ramkĂ„â„˘ APRS
        APRSStation station;
        if (parseAPRSFrame(line, station)) {
          addAPRSStation(station);

          if (aprsAlertEnabled && shouldTriggerAprsAlert(station)) {
            Serial.print("[APRS ALERT] stacja wykryta opisana w formacie tnc: ");
            Serial.println(line);
            triggerAprsRgbLedAlert();
            #ifdef ENABLE_TFT_DISPLAY
            portENTER_CRITICAL(&aprsAlertPendingMux);
            aprsAlertPendingStation = station;
            aprsAlertDrawPending = true;
            portEXIT_CRITICAL(&aprsAlertPendingMux);
            #endif
          }
        }
      }
    } else if (c != 0) {
      // Keep control bytes (e.g. 0x1C/0x1D) for Mic-E decode compatibility.
      aprsBuffer += (char)c;
      // Ograniczenie dÄąâ€šugoÄąâ€şci bufora (zapobieganie przepeÄąâ€šnieniu)
      if (aprsBuffer.length() > 512) {
        aprsBuffer = aprsBuffer.substring(aprsBuffer.length() - 256);
      }
    }
  }
}

// ========== WIFI MANAGER ==========

void startAPMode() {
  // Stabilny portal konfiguracyjny: sam AP (bez STA w tle),
  // ÄąÄ˝eby nie gubiĂ„â€ˇ poÄąâ€šĂ„â€¦czenia na telefonie/PC przy zmianie kanaÄąâ€šu przez STA.
  WiFi.mode(WIFI_AP);
  WiFi.softAP(AP_SSID, AP_PASSWORD);
  Serial.println("AP Mode uruchomiony");
  Serial.print("SSID: ");
  Serial.println(AP_SSID);
  Serial.print("IP: ");
  Serial.println(WiFi.softAPIP());
  
  // Aktualizuj wyÄąâ€şwietlacz TFT z IP AP (jeÄąâ€şli jesteÄąâ€şmy na ekranie 1)
#ifdef ENABLE_TFT_DISPLAY
  updateScreen1();
#endif
}

void requestRestart(unsigned long delayMs = 1500) {
  restartRequested = true;
  restartAtMs = millis() + delayMs;
}

bool connectToWiFi() {
  if (wifiSSID.length() == 0 && wifiSSID2.length() == 0) {
    return false;
  }

  struct WiFiCred {
    String ssid;
    String pass;
  };

  WiFiCred candidates[2] = {{wifiSSID, wifiPassword}, {wifiSSID2, wifiPassword2}};

  auto attemptConnect = [](const WiFiCred &cred) -> bool {
    Serial.println("=== WiFi connect ===");
    Serial.print("SSID: '");
    Serial.print(cred.ssid);
    Serial.print("' (len=");
    Serial.print(cred.ssid.length());
    Serial.println(")");
    Serial.print("PASS len=");
    Serial.println(cred.pass.length());

    WiFi.persistent(false);
    WiFi.setAutoReconnect(true);
    WiFi.setSleep(false);
    WiFi.disconnect(true);
    WiFi.mode(WIFI_OFF);
    delay(250);

    WiFi.mode(WIFI_STA);
    delay(50);
    WiFi.begin(cred.ssid.c_str(), cred.pass.c_str());

    int attempts = 0;
    while (WiFi.status() != WL_CONNECTED && attempts < 40) {
      delay(500);
      yield();
      Serial.print(".");
      attempts++;
    }

    if (WiFi.status() == WL_CONNECTED) {
      Serial.println("");
      return true;
    }

    Serial.println("");
    Serial.println("BÄąâ€šĂ„â€¦d poÄąâ€šĂ„â€¦czenia WiFi");
    Serial.print("WiFi.status(): ");
    Serial.println((int)WiFi.status());

