Tom50505050/esp32-ham-clock/src/main.cpp
    Serial.println("--- WiFi diag ---");
    WiFi.printDiag(Serial);
    Serial.println("--- Scan networks ---");
    int n = WiFi.scanNetworks(/*async=*/false, /*show_hidden=*/true);
    Serial.print("Znaleziono sieci: ");
    Serial.println(n);
    bool found = false;
    for (int i = 0; i < n; i++) {
      String s = WiFi.SSID(i);
      int32_t rssi = WiFi.RSSI(i);
      wifi_auth_mode_t enc = WiFi.encryptionType(i);
      if (s == cred.ssid) {
        found = true;
        Serial.print("MATCH SSID: ");
        Serial.print(s);
        Serial.print(" RSSI=");
        Serial.print(rssi);
        Serial.print(" enc=");
        Serial.println((int)enc);
      }
    }
    if (!found) {
      Serial.println("UWAGA: Nie widzĂ„â„˘ Twojego SSID w skanie (moÄąÄ˝e 5GHz / inny SSID / poza zasiĂ„â„˘giem / ukryte SSID).");
    }

    return false;
  };

  for (int i = 0; i < 2; i++) {
    const WiFiCred &cred = candidates[i];
    if (cred.ssid.length() == 0) {
      continue;
    }

    if (i == 1 && cred.ssid == candidates[0].ssid) {
      continue; // avoid duplicate attempt
    }

    bool ok = attemptConnect(cred);
    if (ok) {
      wifiConnected = true;
      Serial.print("PoÄąâ€šĂ„â€¦czono z SSID: ");
      Serial.println(cred.ssid);
      Serial.print("IP: ");
      Serial.println(WiFi.localIP());

      // Aktualizuj wyÄąâ€şwietlacz TFT z IP STA (jeÄąâ€şli jesteÄąâ€şmy na ekranie 1)
#ifdef ENABLE_TFT_DISPLAY
      updateScreen1();
#endif

      return true;
    } else {
      Serial.println("PrÄ‚łba poÄąâ€šĂ„â€¦czenia nieudana dla SSID: " + cred.ssid);
    }
  }

  wifiConnected = false;
  return false;
}

// ========== TELNET CLUSTER ==========

void connectToCluster() {
  Serial.println("[CLUSTER] connectToCluster() START");
  
  if (!wifiConnected) {
    Serial.println("[CLUSTER] WiFi nie poÄąâ€šĂ„â€¦czony - wyjÄąâ€şcie");
    return;
  }
  
  if (telnetClient.connected()) {
    Serial.println("[CLUSTER] JuÄąÄ˝ poÄąâ€šĂ„â€¦czony - wyjÄąâ€şcie");
    return;
  }
  
  unsigned long now = millis();
  if (now - lastTelnetAttempt < 5000) {
    return; // Cichy return - nie spamuj logu (to byÄąâ€šo gÄąâ€šÄ‚łwne ÄąĹźrÄ‚łdÄąâ€šo spamu!)
  }
  
  lastTelnetAttempt = now;
  
  Serial.print("[CLUSTER] ÄąÂĂ„â€¦czenie z DX Cluster: ");
  Serial.print(clusterHost);
  Serial.print(":");
  Serial.println(clusterPort);

  // Diagnostyka DNS (czĂ„â„˘sty problem gdy host nie rozwiĂ„â€¦zuje siĂ„â„˘ na ESP32)
  IPAddress resolvedIp;
  if (WiFi.hostByName(clusterHost.c_str(), resolvedIp)) {
    Serial.print("DNS OK: ");
    Serial.print(clusterHost);
    Serial.print(" -> ");
    Serial.println(resolvedIp);
  } else {
    Serial.print("DNS FAIL dla hosta: ");
    Serial.println(clusterHost);
  }
  
  Serial.println("[CLUSTER] WywoÄąâ€šanie telnetClient.connect()...");
  unsigned long connectStart = millis();
  if (telnetClient.connect(clusterHost.c_str(), clusterPort)) {
    unsigned long connectTime = millis() - connectStart;
    Serial.print("[CLUSTER] PoÄąâ€šĂ„â€¦czono z DX Cluster! (czas: ");
    Serial.print(connectTime);
    Serial.println("ms)");
    telnetConnected = true;
    telnetBuffer = "";
    clusterLoginSent = false;
    clusterLoginScheduled = false;
    lastClusterKeepAliveMs = millis();
    lastTelnetRxMs = millis();

    // Zawsze wysyÄąâ€šamy login po poÄąâ€šĂ„â€¦czeniu (tak jak w projekcie referencyjnym).
    // JeÄąâ€şli uÄąÄ˝ytkownik nie ustawiÄąâ€š znaku, uÄąÄ˝ywamy domyÄąâ€şlnego (DEFAULT_CALLSIGN).
    clusterLoginScheduled = true;
    clusterSendLoginAtMs = millis() + 1000;
  } else {
    unsigned long connectTime = millis() - connectStart;
    Serial.print("[CLUSTER] BÄąâ€šĂ„â€¦d poÄąâ€šĂ„â€¦czenia z DX Cluster (czas: ");
    Serial.print(connectTime);
    Serial.println("ms)");
    telnetConnected = false;
  }
  Serial.println("[CLUSTER] connectToCluster() END");
}

void connectToPotaCluster() {
  if (!wifiConnected) {
    return;
  }
  if (potaClusterHost.length() == 0 || potaClusterPort <= 0) {
    return;
  }
  if (potaTelnetClient.connected()) {
    return;
  }

  unsigned long now = millis();
  if (now - lastPotaAttempt < 5000) {
    return;
  }
  lastPotaAttempt = now;

  Serial.print("[POTA] ÄąÂĂ„â€¦czenie z POTA Cluster: ");
  Serial.print(potaClusterHost);
  Serial.print(":");
  Serial.println(potaClusterPort);

  IPAddress resolvedIp;
  if (WiFi.hostByName(potaClusterHost.c_str(), resolvedIp)) {
    Serial.print("[POTA] DNS OK: ");
    Serial.print(potaClusterHost);
    Serial.print(" -> ");
    Serial.println(resolvedIp);
  } else {
    Serial.print("[POTA] DNS FAIL: ");
    Serial.println(potaClusterHost);
  }

  if (potaTelnetClient.connect(potaClusterHost.c_str(), potaClusterPort)) {
    Serial.println("[POTA] PoÄąâ€šĂ„â€¦czono z POTA Cluster!");
    potaTelnetConnected = true;
    potaTelnetBuffer = "";
    pendingPotaLine = "";
    potaLoginSent = false;
    potaLoginScheduled = false;
    lastPotaKeepAliveMs = millis();
    lastPotaRxMs = millis();

    String login = userCallsign;
    login.trim();
    if (login.length() == 0) {
      login = DEFAULT_CALLSIGN;
    }
    if (userLocator.length() >= 4) {
      login += "/";
      login += userLocator;
    }
    potaTelnetClient.print(login);
    potaTelnetClient.print("\r\n");
    potaLoginSent = true;
    lastPotaKeepAliveMs = millis();

    if (potaFilterCommand.length() > 0) {
      potaTelnetClient.print(potaFilterCommand);
      potaTelnetClient.print("\r\n");
    }
  } else {
    Serial.println("[POTA] BÄąâ€šĂ„â€¦d poÄąâ€šĂ„â€¦czenia z POTA Cluster");
    potaTelnetConnected = false;
  }
}

// WyÄąâ€şlij komendĂ„â„˘ konfiguracyjnĂ„â€¦ do DX Cluster (CC-Cluster)
// UWAGA: UÄąÄ˝ywane TYLKO do konfiguracji odbioru (set/noann, set/nowwv, set/filter, etc.)
// NIE wysyÄąâ€ša ÄąÄ˝adnych spotÄ‚łw - urzĂ„â€¦dzenie dziaÄąâ€ša tylko w trybie odbioru
void sendClusterCommand(String command) {
  if (!telnetConnected || !telnetClient.connected()) {
    Serial.print("[CLUSTER] Nie moÄąÄ˝na wysÄąâ€šaĂ„â€ˇ komendy '");
    Serial.print(command);
    Serial.println("' - brak poÄąâ€šĂ„â€¦czenia");
    return;
  }
  
  Serial.print("[CLUSTER] WysyÄąâ€šanie komendy: ");
  Serial.println(command);
  telnetClient.print(command);
  telnetClient.print("\r\n");
  delay(50); // KrÄ‚łtkie opÄ‚łÄąĹźnienie miĂ„â„˘dzy komendami
}

// WyÄąâ€şlij komendy konfiguracyjne CC-Cluster po zalogowaniu
void sendClusterConfigCommands() {
  if (!telnetConnected || !telnetClient.connected()) {
    return;
  }
  
  Serial.println("[CLUSTER] WysyÄąâ€šanie komend konfiguracyjnych CC-Cluster...");
  
