Tom50505050/esp32-ham-clock/src/main.cpp
  // WyÄąâ€šĂ„â€¦cz ogÄąâ€šoszenia (domyÄąâ€şlnie wÄąâ€šĂ„â€¦czone)
  if (clusterNoAnnouncements) {
    sendClusterCommand("set/noann");
  }
  
  // WyÄąâ€šĂ„â€¦cz WWV (domyÄąâ€şlnie wÄąâ€šĂ„â€¦czone)
  if (clusterNoWWV) {
    sendClusterCommand("set/nowwv");
  }
  
  // WyÄąâ€šĂ„â€¦cz WCY (domyÄąâ€şlnie wÄąâ€šĂ„â€¦czone)
  if (clusterNoWCY) {
    sendClusterCommand("set/nowcy");
  }
  
  // Ustaw filtry (jeÄąâ€şli wÄąâ€šĂ„â€¦czone)
  if (clusterUseFilters && clusterFilterCommands.length() > 0) {
    // Parsuj i wyÄąâ€şlij komendy filtrÄ‚łw (moÄąÄ˝e byĂ„â€ˇ kilka linii oddzielonych \n)
    String filters = clusterFilterCommands;
    int pos = 0;
    while (pos < filters.length()) {
      int nextPos = filters.indexOf('\n', pos);
      if (nextPos < 0) {
        nextPos = filters.length();
      }
      String cmd = filters.substring(pos, nextPos);
      cmd.trim();
      if (cmd.length() > 0) {
        sendClusterCommand(cmd);
      }
      pos = nextPos + 1;
    }
  } else {
    // JeÄąâ€şli filtry wyÄąâ€šĂ„â€¦czone, wyczyÄąâ€şĂ„â€ˇ wszystkie filtry
    sendClusterCommand("set/nofilter");
  }
  
  Serial.println("[CLUSTER] Komendy konfiguracyjne wysÄąâ€šane");
}

void handleTelnetData() {
  static unsigned long lastTelnetPrint = 0;
  static int telnetCallCount = 0;
  telnetCallCount++;
  
  if (!telnetConnected || !telnetClient.connected()) {
    if (telnetConnected) {
      LOGV_PRINTLN("[TELNET] PoÄąâ€šĂ„â€¦czenie zerwane - reset flagÄ‚łw");
    }
    telnetConnected = false;
    clusterLoginSent = false;
    clusterLoginScheduled = false;
    return;
  }
  
  // Print co 1000 wywoÄąâ€šaÄąâ€ž (dla debugowania)
  unsigned long now = millis();
  if (now - lastTelnetPrint > 30000) { // Co 30 sekund
    LOGV_PRINT("[TELNET] handleTelnetData wywoÄąâ€šane ");
    LOGV_PRINT(telnetCallCount);
    LOGV_PRINT(" razy, available=");
    LOGV_PRINTLN(telnetClient.available());
    lastTelnetPrint = now;
    telnetCallCount = 0;
  }
  
  // Nie blokuj pĂ„â„˘tli gÄąâ€šÄ‚łwnej: w jednej iteracji czytaj maksymalnie N bajtÄ‚łw
  // i dawaj yield, ÄąÄ˝eby nie wpaÄąâ€şĂ„â€ˇ w WDT przy duÄąÄ˝ym strumieniu.
  int processed = 0;
  const int maxPerLoop = 256;
  int availableBefore = telnetClient.available();
  
  while (telnetClient.available() && processed < maxPerLoop) {
    char c = telnetClient.read();
    processed++;
    lastTelnetRxMs = millis();
    if ((processed % 64) == 0) {
      yield();
      // obsÄąâ€šuÄąÄ˝ WWW nawet jeÄąâ€şli telnet zalewa danymi
      if (server != nullptr) {
        server->handleClient();
      }
    }
    
    if (c == '\n' || c == '\r') {
      if (telnetBuffer.length() > 0) {
        // Nie parsuj tu (to bywa kosztowne). PrzekaÄąÄ˝ liniĂ„â„˘ do przetworzenia w loop().
        if (pendingTelnetLine.length() == 0) {
          pendingTelnetLine = telnetBuffer;
        } else {
          pendingTelnetDropped++;
        }
        telnetBuffer = "";
      }
    } else if (c >= 32 && c < 127) {
      telnetBuffer += c;
      if (telnetBuffer.length() > 512) {
        telnetBuffer = ""; // Ochrona przed przepeÄąâ€šnieniem
      }
    }
  }
  
  if (processed > 0) {
    LOGV_PRINT("[TELNET] Przetworzono ");
    LOGV_PRINT(processed);
    LOGV_PRINT(" bajtÄ‚łw (byÄąâ€šo ");
    LOGV_PRINT(availableBefore);
    LOGV_PRINT(", zostaÄąâ€šo ");
    LOGV_PRINT(telnetClient.available());
    LOGV_PRINTLN(")");
  }
  
  if (telnetClient.available() && processed >= maxPerLoop) {
    LOGV_PRINTLN("[TELNET] WARNING: ZostaÄąâ€šo wiĂ„â„˘cej danych - nastĂ„â„˘pna iteracja");
    // Zostaw resztĂ„â„˘ na nastĂ„â„˘pnĂ„â€¦ iteracjĂ„â„˘ loop()
    yield();
  }
  
  // SprawdÄąĹź czy poÄąâ€šĂ„â€¦czenie nadal dziaÄąâ€ša
  if (!telnetClient.connected()) {
    LOGV_PRINTLN("[TELNET] RozÄąâ€šĂ„â€¦czono z DX Cluster");
    telnetConnected = false;
    clusterLoginSent = false;
    clusterLoginScheduled = false;
  }
}

void handlePotaTelnetData() {
  if (!potaTelnetConnected || !potaTelnetClient.connected()) {
    if (potaTelnetConnected) {
      LOGV_PRINTLN("[POTA] PoÄąâ€šĂ„â€¦czenie zerwane - reset flag");
    }
    potaTelnetConnected = false;
    potaLoginSent = false;
    potaLoginScheduled = false;
    return;
  }

  int processed = 0;
  const int maxPerLoop = 256;
  while (potaTelnetClient.available() && processed < maxPerLoop) {
    char c = potaTelnetClient.read();
    processed++;
    lastPotaRxMs = millis();
    if ((processed % 64) == 0) {
      yield();
      if (server != nullptr) {
        server->handleClient();
      }
    }

    if (c == '\n' || c == '\r') {
      if (potaTelnetBuffer.length() > 0) {
        if (pendingPotaLine.length() == 0) {
          pendingPotaLine = potaTelnetBuffer;
        } else {
          pendingPotaDropped++;
        }
        potaTelnetBuffer = "";
      }
    } else if (c >= 32 && c < 127) {
      potaTelnetBuffer += c;
      if (potaTelnetBuffer.length() > 512) {
        potaTelnetBuffer = "";
      }
    }
  }

  if (!potaTelnetClient.connected()) {
    LOGV_PRINTLN("[POTA] RozÄąâ€šĂ„â€¦czono z POTA Cluster");
    potaTelnetConnected = false;
    potaLoginSent = false;
    potaLoginScheduled = false;
  }
}

// ========== NTP TIME ==========

void updateNTPTime() {
  unsigned long now = millis();
  if (lastNTPUpdate != 0 && (now - lastNTPUpdate < 3600000)) { // Aktualizuj co godzinĂ„â„˘
    return;
  }
  
  if (!wifiConnected) {
    return;
  }
  
  Serial.println("[NTP] Aktualizacja czasu NTP...");
  configTime(GMT_OFFSET_SEC, 0, NTP_SERVER);
  lastNTPUpdate = now;
  
  struct tm timeinfo;
  if (getLocalTime(&timeinfo)) {
    Serial.println("[NTP] Czas NTP zsynchronizowany");
  } else {
    Serial.println("[NTP] BÄąÂĂ„â€žD: Nie udaÄąâ€šo siĂ„â„˘ pobraĂ„â€ˇ czasu NTP");
  }
  checkScreenSaverTimeout(); // Dodanie wywoÄąâ€šania funkcji
}

// ========== WYGASZACZ EKRANU (Matrix) ==========

void resetScreenSaverActivity() {
  screenSaverLastActivityMs = millis();
  if (screenSaverActive) {
    // WyÄąâ€šĂ„â€¦cz wygaszacz i wrÄ‚łĂ„â€ˇ do poprzedniego ekranu
    screenSaverActive = false;
    if (screenSaverPrevScreen != SCREEN_OFF) {
      drawScreen(screenSaverPrevScreen);
    }
  }
}

void checkScreenSaverTimeout() {
  if (!screenSaverEnabled || screenSaverActive) {
    return;
  }
  unsigned long now = millis();
  unsigned long timeoutMs = (unsigned long)screenSaverTimeoutMin * 60000UL; // minuty na ms
  if (now - screenSaverLastActivityMs >= timeoutMs) {
    // Włącz wygaszacz z poruszającym się zegarem
    screenSaverActive = true;
    screenSaverPrevScreen = currentScreen;
    // Wyczyść ekran i zresetuj pozycję zegara
    tft.fillScreen(TFT_BLACK);
    bounceClockX = 240;
    bounceClockY = 160;
    bounceClockVX = 2.5;
    bounceClockVY = 2.0;
    bounceClockColor = TFT_RADIO_ORANGE;
    lastBounceClockText = "";
  }
}

