Tom50505050/esp32-ham-clock/src/main.cpp
void setScreenSaverEnabled(bool enabled) {
  screenSaverEnabled = enabled;
  savePreferences();
}

void setScreenSaverTimeout(int minutes) {
  if (minutes < 1) minutes = 1;
  if (minutes > 60) minutes = 60;
  screenSaverTimeoutMin = minutes;
  savePreferences();
}

void drawQrzPopup() {
  Serial.print("[QRZ POPUP] drawQrzPopup called, active=");
  Serial.print(qrzPopupActive ? "true" : "false");
  Serial.print(" hasLatLon=");
  Serial.print(qrzPopupHasLatLon ? "true" : "false");
  Serial.print(" lat=");
  Serial.print(qrzPopupLat, 6);
  Serial.print(" lon=");
  Serial.println(qrzPopupLon, 6);
  if (!qrzPopupActive) return;

  const int popupW = 400;
  const int popupH = 220;
  const int popupX = (480 - popupW) / 2;
  const int popupY = (320 - popupH) / 2;

  // Tło popupu
  tft.fillRect(popupX, popupY, popupW, popupH, TFT_DARKGREY);
  tft.drawRect(popupX, popupY, popupW, popupH, TFT_WHITE);
  tft.drawRect(popupX + 2, popupY + 2, popupW - 4, popupH - 4, TFT_RADIO_ORANGE);

  // Nagłówek z callsign i imieniem
  tft.fillRect(popupX + 4, popupY + 4, popupW - 8, 30, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  tft.setCursor(popupX + 10, popupY + 10);
  tft.print(qrzPopupCallsign);
  
  // Imię i nazwisko w nagłówku (jeśli dostępne)
  if (qrzPopupName.length() > 0) {
    tft.setTextSize(1);
    String nameText = " - " + qrzPopupName;
    // Oblicz pozycję za callsign
    int nameX = popupX + 10 + (qrzPopupCallsign.length() * 12);
    tft.setCursor(nameX, popupY + 14);
    tft.print(nameText);
  }

  // Dane
  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(1);
  int y = popupY + 45;

  if (qrzPopupName.length() > 0) {
    tft.setCursor(popupX + 10, y);
    tft.print("Name: ");
    tft.print(qrzPopupName);
    y += 20;
  }

  if (qrzPopupGrid.length() > 0) {
    tft.setCursor(popupX + 10, y);
    tft.print("Grid: ");
    tft.print(qrzPopupGrid);
    y += 20;
  }

  if (qrzPopupCountry.length() > 0) {
    tft.setCursor(popupX + 10, y);
    tft.print("Country: ");
    tft.print(qrzPopupCountry);
    y += 20;
  }

  if (qrzPopupQth.length() > 0) {
    tft.setCursor(popupX + 10, y);
    tft.print("QTH: ");
    tft.print(qrzPopupQth);
    y += 20;
  }

  if (qrzPopupEmail.length() > 0) {
    tft.setCursor(popupX + 10, y);
    tft.print("Email: ");
    tft.print(qrzPopupEmail);
    y += 20;
  }

  if (qrzPopupDistance > 0.0) {
    tft.setCursor(popupX + 10, y);
    tft.print("Distance: ");
    tft.print(qrzPopupDistance, 0);
    tft.print(" km");
    y += 20;
  }

  // Przycisk zamknij
  const int closeW = 80;
  const int closeH = 30;
  const int closeX = popupX + (popupW - closeW) / 2;
  const int closeY = popupY + popupH - closeH - 15;
  drawFilterTile(closeX, closeY, closeW, closeH, "CLOSE", false);

  // Mapa świata w prawym górnym rogu popupu
  if (qrzPopupHasLatLon) {
    const int mapW = 140;
    const int mapH = 80;
    const int mapX = popupX + popupW - mapW - 10;
    const int mapY = popupY + 45;
    
    Serial.print("[QRZ MAP] Drawing map, hasLatLon=true, lat=");
    Serial.print(qrzPopupLat, 6);
    Serial.print(" lon=");
    Serial.println(qrzPopupLon, 6);
    
    // Wyświetl plik mapa.bmp z folderu data
    bool mapLoaded = false;
    if (littleFsReady && LittleFS.exists("/mapa.bmp")) {
      Serial.println("[QRZ MAP] Found /mapa.bmp, attempting to load...");
      mapLoaded = drawBmp16FromFS("/mapa.bmp", mapX, mapY);
      Serial.print("[QRZ MAP] BMP load result: ");
      Serial.println(mapLoaded ? "SUCCESS" : "FAILED");
    } else {
      Serial.println("[QRZ MAP] /mapa.bmp not found in LittleFS");
    }
    if (!mapLoaded) {
      Serial.println("[QRZ MAP] Using fallback drawing");
    }

    // Jeśli nie ma pliku BMP, użyj fallback (rysowanie)
    if (!mapLoaded) {
      // Tło mapy
      tft.fillRect(mapX, mapY, mapW, mapH, 0x4208); // Ciemny szary
      tft.drawRect(mapX, mapY, mapW, mapH, TFT_LIGHTGREY);
      
      // Uproszczony kontur mapy świata (linie kontynentów)
      tft.drawLine(mapX + 20, mapY + 25, mapX + 50, mapY + 20, TFT_LIGHTGREY);
      tft.drawLine(mapX + 50, mapY + 20, mapX + 60, mapY + 40, TFT_LIGHTGREY);
      tft.drawLine(mapX + 20, mapY + 25, mapX + 25, mapY + 55, TFT_LIGHTGREY);
      tft.drawLine(mapX + 25, mapY + 55, mapX + 40, mapY + 70, TFT_LIGHTGREY);
      tft.drawLine(mapX + 70, mapY + 15, mapX + 110, mapY + 20, TFT_LIGHTGREY);
      tft.drawLine(mapX + 110, mapY + 20, mapX + 120, mapY + 45, TFT_LIGHTGREY);
      tft.drawLine(mapX + 70, mapY + 35, mapX + 100, mapY + 40, TFT_LIGHTGREY);
      tft.drawLine(mapX + 100, mapY + 40, mapX + 95, mapY + 65, TFT_LIGHTGREY);
      tft.drawLine(mapX + 110, mapY + 55, mapX + 130, mapY + 60, TFT_LIGHTGREY);
      
      // Linie siatki
      for (int i = 1; i < 4; i++) {
        tft.drawFastHLine(mapX + 2, mapY + i * 20, mapW - 4, 0x2104);
      }
      for (int i = 1; i < 6; i++) {
        tft.drawFastVLine(mapX + i * 23, mapY + 2, mapH - 4, 0x2104);
      }
    }
    
    // Oblicz pozycję na mapie (prosta projekcja equirectangular)
    // Longitude: -180 do 180 -> 0 do mapW
    // Latitude: -90 do 90 -> mapH do 0 (odwrócone)
    int dotX = mapX + (int)((qrzPopupLon + 180.0) * mapW / 360.0);
    int dotY = mapY + mapH - (int)((qrzPopupLat + 90.0) * mapH / 180.0);
    
    Serial.print("[QRZ MAP] Raw dot position: dotX=");
    Serial.print(dotX);
    Serial.print(" dotY=");
    Serial.println(dotY);
    
    // Ogranicz do obszaru mapy
    if (dotX < mapX + 2) dotX = mapX + 2;
    if (dotX > mapX + mapW - 3) dotX = mapX + mapW - 3;
    if (dotY < mapY + 2) dotY = mapY + 2;
    if (dotY > mapY + mapH - 3) dotY = mapY + mapH - 3;
    
    Serial.print("[QRZ MAP] Clamped dot position: dotX=");
    Serial.print(dotX);
    Serial.print(" dotY=");
    Serial.println(dotY);
    
    // Rysuj punkt stacji (czerwona kropka z białą obwódką)
    Serial.println("[QRZ MAP] Drawing station dot");
    tft.fillCircle(dotX, dotY, 5, TFT_RED);
    tft.drawCircle(dotX, dotY, 5, TFT_WHITE);
    tft.drawCircle(dotX, dotY, 6, TFT_BLACK);
    
