Tom50505050/esp32-ham-clock/src/main.cpp
    // Mała etykieta z lokalizatorem pod mapą
    tft.setTextSize(1);
    tft.setTextColor(TFT_YELLOW);
    tft.setCursor(mapX, mapY + mapH + 3);
    tft.print(qrzPopupGrid);
  }
}

void handleQrzPopupTouch(uint16_t x, uint16_t y) {
  if (!qrzPopupActive) return;

  const int popupW = 400;
  const int popupH = 220;
  const int popupX = (480 - popupW) / 2;
  const int popupY = (320 - popupH) / 2;
  const int closeW = 80;
  const int closeH = 30;
  const int closeX = popupX + (popupW - closeW) / 2;
  const int closeY = popupY + popupH - closeH - 15;

  if (isPointInRect(x, y, closeX, closeY, closeW, closeH)) {
    qrzPopupActive = false;
    // Przerysuj ekran
    if (currentScreen == SCREEN_DX_CLUSTER || currentScreen == SCREEN_POTA_CLUSTER || currentScreen == SCREEN_HAMALERT_CLUSTER) {
      drawScreen(currentScreen);
    }
  }
}

void openQrzPopup(const String &callsign) {
  Serial.print("[QRZ POPUP] Opening popup for: ");
  Serial.println(callsign);
  if (callsign.length() == 0) return;
  
  qrzPopupCallsign = callsign;
  qrzPopupCallsign.toUpperCase();

  // Sprawdź cache najpierw
  String grid, country, name, email, qth;
  double lat, lon;
  bool hasLatLon;
  if (getQrzCacheFresh(qrzPopupCallsign, grid, country, name, email, qth, lat, lon, hasLatLon, QRZ_CACHE_TTL_MS)) {
    Serial.print("[QRZ POPUP] Cache hit - hasLatLon=");
    Serial.print(hasLatLon ? "true" : "false");
    Serial.print(" lat=");
    Serial.print(lat, 6);
    Serial.print(" lon=");
    Serial.println(lon, 6);
    qrzPopupGrid = grid;
    qrzPopupCountry = country;
    qrzPopupName = name;
    qrzPopupEmail = email;
    qrzPopupQth = qth;
    qrzPopupLat = lat;
    qrzPopupLon = lon;
    qrzPopupHasLatLon = hasLatLon;
    // Oblicz odległość jeśli mamy współrzędne
    if (hasLatLon && userLatLonValid) {
      qrzPopupDistance = calculateDistance(userLat, userLon, lat, lon);
    } else if (hasLatLon && userLocator.length() >= 4) {
      double userLatLocal, userLonLocal;
      locatorToLatLon(userLocator, userLatLocal, userLonLocal);
      qrzPopupDistance = calculateDistance(userLatLocal, userLonLocal, lat, lon);
    } else {
      qrzPopupDistance = 0.0;
    }
    qrzPopupFetchedAt = millis();
    qrzPopupActive = true;
    drawQrzPopup();
    // Asynchronous fetch for fresh data - update popup after
    if (fetchCallookCallsignInfo(qrzPopupCallsign, grid, country, name, email, qth, lat, lon, hasLatLon)) {
      qrzPopupGrid = grid;
      qrzPopupCountry = country;
      qrzPopupName = name;
      qrzPopupEmail = email;
      qrzPopupQth = qth;
      // Oblicz odległość jeśli mamy współrzędne
      if (hasLatLon && userLatLonValid) {
        qrzPopupDistance = calculateDistance(userLat, userLon, lat, lon);
      } else if (hasLatLon && userLocator.length() >= 4) {
        double userLatLocal, userLonLocal;
        locatorToLatLon(userLocator, userLatLocal, userLonLocal);
        qrzPopupDistance = calculateDistance(userLatLocal, userLonLocal, lat, lon);
      } else {
        qrzPopupDistance = 0.0;
      }
      drawQrzPopup();
    }
    return;
  }

  // Jeśli nie ma w cache, pokaż popup z "Loading..." i pobierz w tle
  qrzPopupGrid = "";
  qrzPopupCountry = "Fetching...";
  qrzPopupName = "";
  qrzPopupQth = "";
  qrzPopupDistance = 0.0;
  qrzPopupFetchedAt = 0;
  qrzPopupActive = true;
  drawQrzPopup();

  // Pobierz dane z QRZ.com jako pierwsze (globalne API, wymaga konta)
  Serial.println("[QRZ POPUP] Trying QRZ.com...");
  if (fetchQrzCallsignInfo(qrzPopupCallsign, grid, country, name, email, qth, lat, lon, hasLatLon)) {
    Serial.print("[QRZ POPUP] QRZ.com fetch - hasLatLon=");
    Serial.print(hasLatLon ? "true" : "false");
    Serial.print(" lat=");
    Serial.print(lat, 6);
    Serial.print(" lon=");
    Serial.println(lon, 6);
    qrzPopupGrid = grid;
    qrzPopupCountry = country;
    qrzPopupName = name;
    qrzPopupEmail = email;
    qrzPopupQth = qth;
    qrzPopupLat = lat;
    qrzPopupLon = lon;
    qrzPopupHasLatLon = hasLatLon;
    // Oblicz odległość jeśli mamy współrzędne
    if (hasLatLon && userLatLonValid) {
      qrzPopupDistance = calculateDistance(userLat, userLon, lat, lon);
    } else if (hasLatLon && userLocator.length() >= 4) {
      double userLatLocal, userLonLocal;
      locatorToLatLon(userLocator, userLatLocal, userLonLocal);
      qrzPopupDistance = calculateDistance(userLatLocal, userLonLocal, lat, lon);
    } else {
      qrzPopupDistance = 0.0;
    }
    qrzPopupFetchedAt = millis();
    drawQrzPopup();
  } else {
    // QRZ.com nie zadziałał - spróbuj Callook.info (darmowe API, tylko USA)
    Serial.println("[QRZ POPUP] QRZ.com failed, trying Callook.info...");
    if (fetchCallookCallsignInfo(qrzPopupCallsign, grid, country, name, email, qth, lat, lon, hasLatLon)) {
    Serial.print("[QRZ POPUP] API fetch - hasLatLon=");
    Serial.print(hasLatLon ? "true" : "false");
    Serial.print(" lat=");
    Serial.print(lat, 6);
    Serial.print(" lon=");
    Serial.println(lon, 6);
    qrzPopupGrid = grid;
    qrzPopupCountry = country;
    qrzPopupName = name;
    qrzPopupEmail = email;
    qrzPopupQth = qth;
    qrzPopupLat = lat;
    qrzPopupLon = lon;
    qrzPopupHasLatLon = hasLatLon;
    // Oblicz odległość jeśli mamy współrzędne
    if (hasLatLon && userLatLonValid) {
      qrzPopupDistance = calculateDistance(userLat, userLon, lat, lon);
    } else if (hasLatLon && userLocator.length() >= 4) {
      double userLatLocal, userLonLocal;
      locatorToLatLon(userLocator, userLatLocal, userLonLocal);
      qrzPopupDistance = calculateDistance(userLatLocal, userLonLocal, lat, lon);
    } else {
      qrzPopupDistance = 0.0;
    }
    qrzPopupFetchedAt = millis();
    drawQrzPopup();
  } else {
    // Błąd pobierania z Callook - spróbuj HamQTH (globalne API)
    Serial.println("[QRZ POPUP] Callook failed, trying HamQTH...");
    
    if (fetchHamQthCallsignInfo(qrzPopupCallsign, grid, country, name, email, qth, lat, lon, hasLatLon)) {
      Serial.print("[QRZ POPUP] HamQTH fetch - hasLatLon=");
      Serial.print(hasLatLon ? "true" : "false");
      Serial.print(" lat=");
      Serial.print(lat, 6);
      Serial.print(" lon=");
      Serial.println(lon, 6);
      qrzPopupGrid = grid;
      qrzPopupCountry = country;
      qrzPopupName = name;
      qrzPopupEmail = email;
      qrzPopupQth = qth;
      qrzPopupLat = lat;
      qrzPopupLon = lon;
      qrzPopupHasLatLon = hasLatLon;
      // Oblicz odległość jeśli mamy współrzędne
      if (hasLatLon && userLatLonValid) {
        qrzPopupDistance = calculateDistance(userLat, userLon, lat, lon);
      } else if (hasLatLon && userLocator.length() >= 4) {
        double userLatLocal, userLonLocal;
        locatorToLatLon(userLocator, userLatLocal, userLonLocal);
        qrzPopupDistance = calculateDistance(userLatLocal, userLonLocal, lat, lon);
      } else {
        qrzPopupDistance = 0.0;
      }
      qrzPopupFetchedAt = millis();
      drawQrzPopup();
      return;
    }
    
    // HamQTH też nie zadziałał - spróbuj znaleźć lokalizator w spotach DX
    String foundLocator = "";
    Serial.print("[QRZ POPUP] Both APIs failed, searching spots for: ");
    Serial.println(qrzPopupCallsign);
    Serial.print("[QRZ POPUP] Total spots in array: ");
    Serial.println(spotCount);
    
    // Szukaj w tablicy spots (DX Cluster)
    for (int i = 0; i < spotCount; i++) {
      Serial.print("[QRZ POPUP] Checking spot ");
      Serial.print(i);
      Serial.print(" callsign=");
      Serial.print(spots[i].callsign);
      Serial.print(" vs ");
      Serial.println(qrzPopupCallsign);
      
      if (spots[i].callsign.equalsIgnoreCase(qrzPopupCallsign)) {
        Serial.print("[QRZ POPUP] FOUND MATCH spot ");
        Serial.print(i);
        Serial.print(" locator=");
        Serial.println(spots[i].locator);
        if (spots[i].locator.length() >= 4) {
          foundLocator = spots[i].locator;
          break;
        }
      }
    }
    // Szukaj w tablicy potaSpots (POTA)
    if (foundLocator.length() < 4) {
      for (int i = 0; i < potaSpotCount; i++) {
        if (potaSpots[i].callsign.equalsIgnoreCase(qrzPopupCallsign)) {
          if (potaSpots[i].locator.length() >= 4) {
            foundLocator = potaSpots[i].locator;
            break;
          }
        }
      }
    }
    
