Tom50505050/esp32-ham-clock/src/main.cpp
    if (foundLocator.length() >= 4) {
      // Znaleziono lokalizator - użyj go do pokazania na mapie
      double spotLat, spotLon;
      locatorToLatLon(foundLocator, spotLat, spotLon);
      qrzPopupGrid = foundLocator;
      qrzPopupLat = spotLat;
      qrzPopupLon = spotLon;
      qrzPopupHasLatLon = true;
      qrzPopupCountry = "Data not available";
      qrzPopupName = "(using grid from spot)";
      Serial.print("[QRZ POPUP] Using locator from spot: ");
      Serial.print(foundLocator);
      Serial.print(" lat=");
      Serial.print(spotLat, 6);
      Serial.print(" lon=");
      Serial.println(spotLon, 6);
      drawQrzPopup();
    } else {
      // Brak lokalizatora w spotach - sprawdź czy mamy w cache QRZ
      Serial.println("[QRZ POPUP] No spot locator found, checking QRZ cache...");
      
      String cacheGrid, cacheCountry, cacheName, cacheEmail, cacheQth;
      double cacheLat, cacheLon;
      bool cacheHasLatLon;
      
      bool hasCache = getQrzCacheFresh(qrzPopupCallsign, cacheGrid, cacheCountry, cacheName, cacheEmail, cacheQth, cacheLat, cacheLon, cacheHasLatLon, QRZ_CACHE_TTL_MS);
      Serial.print("[QRZ POPUP] Cache check result: ");
      Serial.println(hasCache ? "FOUND" : "NOT FOUND");
      
      if (hasCache) {
        Serial.print("[QRZ POPUP] Cache data - grid: ");
        Serial.print(cacheGrid);
        Serial.print(" hasLatLon: ");
        Serial.println(cacheHasLatLon ? "true" : "false");
        
        // Mamy dane w cache - użyj ich
        if (cacheGrid.length() >= 4) {
          double spotLat, spotLon;
          locatorToLatLon(cacheGrid, spotLat, spotLon);
          qrzPopupGrid = cacheGrid;
          qrzPopupLat = spotLat;
          qrzPopupLon = spotLon;
          qrzPopupHasLatLon = true;
          qrzPopupCountry = cacheCountry.length() > 0 ? cacheCountry : "Data from cache";
          qrzPopupName = cacheName.length() > 0 ? cacheName : "(from QRZ cache)";
          Serial.print("[QRZ POPUP] Using locator from QRZ cache: ");
          Serial.println(cacheGrid);
          drawQrzPopup();
        } else if (cacheHasLatLon) {
          // Mamy lat/lon ale nie mamy grid
          qrzPopupGrid = cacheGrid;
          qrzPopupLat = cacheLat;
          qrzPopupLon = cacheLon;
          qrzPopupHasLatLon = true;
          qrzPopupCountry = cacheCountry.length() > 0 ? cacheCountry : "Data from cache";
          qrzPopupName = cacheName.length() > 0 ? cacheName : "(from QRZ cache)";
          Serial.print("[QRZ POPUP] Using lat/lon from QRZ cache");
          drawQrzPopup();
        } else {
          // Brak lokalizatora - uĹĽyj przybliĹĽonej lokalizacji z prefiksu
          String approxGrid = getApproximateGridFromCallsign(qrzPopupCallsign);
          if (approxGrid.length() >= 4) {
            double approxLat, approxLon;
            locatorToLatLon(approxGrid, approxLat, approxLon);
            qrzPopupGrid = approxGrid;
            qrzPopupLat = approxLat;
            qrzPopupLon = approxLon;
            qrzPopupHasLatLon = true;
            qrzPopupCountry = "Approximate location";
            qrzPopupName = "(from callsign prefix)";
            Serial.print("[QRZ POPUP] Using approximate grid: ");
            Serial.print(approxGrid);
            Serial.print(" lat=");
            Serial.print(approxLat, 6);
            Serial.print(" lon=");
            Serial.println(approxLon, 6);
            drawQrzPopup();
          } else {
            qrzPopupCountry = "Data not available";
            qrzPopupName = "(No locator in spot or cache)";
            drawQrzPopup();
          }
        }
      } else {
        // Brak lokalizatora - uĹĽyj przybliĹĽonej lokalizacji z prefiksu
        String approxGrid = getApproximateGridFromCallsign(qrzPopupCallsign);
        if (approxGrid.length() >= 4) {
          double approxLat, approxLon;
          locatorToLatLon(approxGrid, approxLat, approxLon);
          qrzPopupGrid = approxGrid;
          qrzPopupLat = approxLat;
          qrzPopupLon = approxLon;
          qrzPopupHasLatLon = true;
          qrzPopupCountry = "Approximate location";
          qrzPopupName = "(from callsign prefix)";
          Serial.print("[QRZ POPUP] Using approximate grid: ");
          Serial.print(approxGrid);
          Serial.print(" lat=");
          Serial.print(approxLat, 6);
          Serial.print(" lon=");
          Serial.println(approxLon, 6);
          drawQrzPopup();
        } else {
          qrzPopupCountry = "Data not available";
          qrzPopupName = "(No locator in spot or cache)";
          drawQrzPopup();
        }
      }
    }
  }
}
}

// ========== MENU WYGASZACZA EKRANU ==========

void drawScreenSaverMenu() {
  tft.fillScreen(TFT_BLACK);
  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(2);
  tft.setCursor(10, 6);
  tft.print("WYGASZACZ EKRANU");

  const int tileW = 100;
  const int tileH = 40;
  const int gap = 10;
  const int startX = (480 - (2 * tileW + gap)) / 2;
  const int tileY = 60;

  // Włącz/Wyłącz
  drawFilterTile(startX, tileY, tileW, tileH, "WLACZ", screenSaverEnabled);
  drawFilterTile(startX + tileW + gap, tileY, tileW, tileH, "WYLACZ", !screenSaverEnabled);

  // Czas w minutach
  tft.setTextColor(TFT_LIGHTGREY);
  tft.setTextSize(1);
  tft.setCursor(10, 120);
  tft.print("CZAS (min): ");
  tft.setTextColor(TFT_WHITE);
  tft.print(screenSaverTimeoutMin);

  // Typ wygaszacza - przycisk zmiany
  tft.setTextColor(TFT_LIGHTGREY);
  tft.setCursor(200, 120);
  tft.print("TYP: ");
  tft.setTextColor(TFT_YELLOW);
  tft.print(SAVER_TYPE_NAMES[screenSaverType]);
  
  // Przycisk zmiany typu
  const int typeTileW = 100;
  const int typeTileH = 30;
  const int typeX = 300;
  const int typeY = 115;
  drawFilterTile(typeX, typeY, typeTileW, typeTileH, "ZMIEN", false);

  const int minTileW = 60;
  const int minTileH = 35;
  const int minGap = 8;
  const int minStartX = 10;
  const int minY = 140;

  // Przyciski +/- minuty
  drawFilterTile(minStartX, minY, minTileW, minTileH, "-5", false);
  drawFilterTile(minStartX + minTileW + minGap, minY, minTileW, minTileH, "-1", false);
  drawFilterTile(minStartX + 2 * (minTileW + minGap), minY, minTileW, minTileH, "+1", false);
  drawFilterTile(minStartX + 3 * (minTileW + minGap), minY, minTileW, minTileH, "+5", false);

  // CLOSE
  const int closeW = 120;
  const int closeH = 40;
  const int closeX = (480 - closeW) / 2;
  const int closeY = 280;
  drawFilterTile(closeX, closeY, closeW, closeH, "ZAMKNIJ", false);
}

