Tom50505050/esp32-ham-clock/src/main.cpp
void handleScreenSaverMenuTouch(uint16_t x, uint16_t y) {
  const int tileW = 100;
  const int tileH = 40;
  const int gap = 10;
  const int startX = (480 - (2 * tileW + gap)) / 2;
  const int tileY = 60;

  // Włącz/Wyłącz
  if (isPointInRect(x, y, startX, tileY, tileW, tileH)) {
    setScreenSaverEnabled(true);
    drawScreenSaverMenu();
    return;
  }
  if (isPointInRect(x, y, startX + tileW + gap, tileY, tileW, tileH)) {
    setScreenSaverEnabled(false);
    drawScreenSaverMenu();
    return;
  }

  // Przycisk zmiany typu wygaszacza
  const int typeTileW = 100;
  const int typeTileH = 30;
  const int typeX = 300;
  const int typeY = 115;
  if (isPointInRect(x, y, typeX, typeY, typeTileW, typeTileH)) {
    // Zmień typ na następny
    int currentType = (int)screenSaverType;
    currentType = (currentType + 1) % 3;  // Cykl: 0->1->2->0
    screenSaverType = (ScreenSaverType)currentType;
    // Zapisz w preferencjach
    preferences->putInt("saver_type", currentType);
    drawScreenSaverMenu();
    return;
  }

  const int minTileW = 60;
  const int minTileH = 35;
  const int minGap = 8;
  const int minStartX = 10;
  const int minY = 140;

  // Minus 5 min
  if (isPointInRect(x, y, minStartX, minY, minTileW, minTileH)) {
    setScreenSaverTimeout(screenSaverTimeoutMin - 5);
    drawScreenSaverMenu();
    return;
  }
  // Minus 1 min
  if (isPointInRect(x, y, minStartX + minTileW + minGap, minY, minTileW, minTileH)) {
    setScreenSaverTimeout(screenSaverTimeoutMin - 1);
    drawScreenSaverMenu();
    return;
  }
  // Plus 1 min
  if (isPointInRect(x, y, minStartX + 2 * (minTileW + minGap), minY, minTileW, minTileH)) {
    setScreenSaverTimeout(screenSaverTimeoutMin + 1);
    drawScreenSaverMenu();
    return;
  }
  // Plus 5 min
  if (isPointInRect(x, y, minStartX + 3 * (minTileW + minGap), minY, minTileW, minTileH)) {
    setScreenSaverTimeout(screenSaverTimeoutMin + 5);
    drawScreenSaverMenu();
    return;
  }

  // Zamknij
  const int closeW = 120;
  const int closeH = 40;
  const int closeX = (480 - closeW) / 2;
  const int closeY = 280;
  if (isPointInRect(x, y, closeX, closeY, closeW, closeH)) {
    inMenu = false;
    screenSaverMenuActive = false;
    drawScreen(currentScreen);
    return;
  }
}

// ========== PREFERENCES ==========

void loadPreferences() {
  if (preferences == nullptr) {
    preferences = new Preferences();
  }
  
  preferences->begin("dxcluster", false);
  yield();

  // Kolejność ekranów
  loadDefaultScreenOrder();
  size_t bytesRead = preferences->getBytes("screen_order", screenOrder, sizeof(screenOrder));
  if (bytesRead != sizeof(screenOrder)) {
    loadDefaultScreenOrder();
  }
  ensureScreenOrderValid();
  currentScreen = firstActiveScreen();
  tftAutoSwitchEnabled = preferences->getBool("tft_autosw", false);
  applyTftAutoSwitchTimeSec(preferences->getInt("tft_sw_sec", DEFAULT_TFT_SWITCH_TIME_SEC));
  tftAutoSwitchLastMs = millis();
  tftAutoSwitchLastScreen = currentScreen;
  
  wifiSSID = preferences->getString("wifi_ssid", "");
  yield();
  wifiPassword = preferences->getString("wifi_pass", "");
  yield();
  wifiSSID2 = preferences->getString("wifi_ssid2", "");
  yield();
  wifiPassword2 = preferences->getString("wifi_pass2", "");
  yield();
  
  clusterHost = preferences->getString("cluster_host", DEFAULT_CLUSTER_HOST);
  yield();
  clusterPort = preferences->getInt("cluster_port", DEFAULT_CLUSTER_PORT);
  yield();
  potaClusterHost = preferences->getString("pota_host", DEFAULT_POTA_CLUSTER_HOST);
  yield();
  potaClusterPort = preferences->getInt("pota_port", DEFAULT_POTA_CLUSTER_PORT);
  yield();
  potaFilterCommand = preferences->getString("pota_filter", DEFAULT_POTA_FILTER_COMMAND);
  yield();
  potaApiUrl = preferences->getString("pota_api_url", DEFAULT_POTA_API_URL);
  yield();
  hamalertHost = preferences->getString("hama_host", DEFAULT_HAMALERT_HOST);
  yield();
  hamalertPort = preferences->getInt("hama_port", DEFAULT_HAMALERT_PORT);
  if (hamalertPort <= 0 || hamalertPort > 65535) hamalertPort = DEFAULT_HAMALERT_PORT;
  yield();
  hamalertLogin = preferences->getString("hama_user", "");
  yield();
  hamalertPassword = preferences->getString("hama_pass", "");
  yield();
  userCallsign = preferences->getString("user_callsign", "");
  yield();
  userLocator = preferences->getString("user_locator", "");
  yield();
  timezoneHours = preferences->getInt("timezone", DEFAULT_TIMEZONE_HOURS);
  if (timezoneHours < -12) timezoneHours = -12;
  if (timezoneHours > 14) timezoneHours = 14;
  yield();
  userLat = preferences->getFloat("user_lat", 0.0f);
  yield();
  userLon = preferences->getFloat("user_lon", 0.0f);
  yield();
  userLatLonValid = preferences->getBool("user_ll_ok", false);
  yield();
  qrzUsername = preferences->getString("qrz_user", "");
  yield();
  qrzPassword = preferences->getString("qrz_pass", "");
  yield();
  weatherApiKey = preferences->getString("weather_key", "");
  yield();
  openWebRxUrl = preferences->getString("openwebrx_url", DEFAULT_OPENWEBRX_URL);
  yield();
  backlightPercent = preferences->getInt("tft_backlight", TFT_BACKLIGHT);
  if (backlightPercent < MIN_BACKLIGHT_PERCENT) backlightPercent = MIN_BACKLIGHT_PERCENT;
  if (backlightPercent > 100) backlightPercent = 100;
  tftInvertColors = sanitizeTftInvertSetting(preferences->getBool("tft_inv", tftInvertColors));
  tftLanguage = preferences->getUChar("tft_lang", TFT_LANG_PL);
  if (tftLanguage > TFT_LANG_EN) tftLanguage = TFT_LANG_PL;
  dxTableSizeMode = preferences->getUChar("tft_tbl_size", DX_TABLE_SIZE_NORMAL);
  if (dxTableSizeMode > DX_TABLE_SIZE_ENLARGED) dxTableSizeMode = DX_TABLE_SIZE_NORMAL;
  int savedMenuHue = preferences->getInt("menu_hue", DEFAULT_MENU_THEME_HUE);
  if (savedMenuHue < 0) savedMenuHue = 0;
  if (savedMenuHue > 255) savedMenuHue = 255;
  menuThemeHue = (uint8_t)savedMenuHue;
  applyMenuThemeFromHue();
  touchXMin = preferences->getInt("touch_xmin", TOUCH_X_MIN);
  touchXMax = preferences->getInt("touch_xmax", TOUCH_X_MAX);
  touchYMin = preferences->getInt("touch_ymin", TOUCH_Y_MIN);
  touchYMax = preferences->getInt("touch_ymax", TOUCH_Y_MAX);
  touchSwapXY = preferences->getBool("touch_swap", TOUCH_SWAP_XY);
  touchInvertX = preferences->getBool("touch_invx", TOUCH_INVERT_X);
  touchInvertY = preferences->getBool("touch_invy", TOUCH_INVERT_Y);
  touchRotation = preferences->getUChar("touch_rot", 1);
  if (touchRotation > 3) touchRotation = 1;
  tftRotation = preferences->getUChar("tft_rot", 1);
  if (tftRotation > 3) tftRotation = 1;
  if (touchXMin < 0 || touchXMax > 4095 || touchXMin >= touchXMax) {
    touchXMin = TOUCH_X_MIN;
    touchXMax = TOUCH_X_MAX;
  }
  if (touchYMin < 0 || touchYMax > 4095 || touchYMin >= touchYMax) {
    touchYMin = TOUCH_Y_MIN;
    touchYMax = TOUCH_Y_MAX;
  }

  // Konfiguracja PSKReporter
  pskReceiverCallsign = preferences->getString("psk_receiver", "");
  pskMaxSpots = preferences->getInt("psk_maxspots", 50);
  if (pskMaxSpots < 10) pskMaxSpots = 50;
  if (pskMaxSpots > 100) pskMaxSpots = 50;
  pskHoursWindow = preferences->getInt("psk_hours", 1);
  if (pskHoursWindow < 1) pskHoursWindow = 1;
  if (pskHoursWindow > 24) pskHoursWindow = 1;
  pskFilterBand = preferences->getString("psk_band", "");
  pskFilterMode = preferences->getString("psk_mode", "");
  pskCustomUrl = preferences->getString("psk_url", "");
  // HTTP Monitoring
  pskMonitorCallsign = preferences->getString("psk_monitor", "");
  pskReportDays = preferences->getInt("psk_report_days", 0);
  if (pskReportDays < 0) pskReportDays = 0;
  if (pskReportDays > 62) pskReportDays = 62;
  pskAutoRefreshMinutes = preferences->getInt("psk_autorefresh", 5);
  if (pskAutoRefreshMinutes < 0) pskAutoRefreshMinutes = 0;
  if (pskAutoRefreshMinutes > 60) pskAutoRefreshMinutes = 60;

  screen1TimeMode = (uint8_t)preferences->getInt("screen1_time", SCREEN1_TIME_UTC);
  if (screen1TimeMode > SCREEN1_TIME_LOCAL) screen1TimeMode = SCREEN1_TIME_UTC;
  
