Tom50505050/esp32-ham-clock/src/main.cpp
  // Konfiguracja wygaszacza ekranu (Matrix)
  screenSaverEnabled = preferences->getBool("ss_enabled", false);
  screenSaverTimeoutMin = preferences->getInt("ss_timeout", DEFAULT_SCREEN_SAVER_TIMEOUT_MIN);
  if (screenSaverTimeoutMin < 1) screenSaverTimeoutMin = 1;
  if (screenSaverTimeoutMin > 60) screenSaverTimeoutMin = 60;
  screenSaverLastActivityMs = millis();
  screenSaverActive = false;
  
  // Wczytaj typ wygaszacza
  int savedType = preferences->getInt("saver_type", 0);
  if (savedType < 0 || savedType > 2) savedType = 0;
  screenSaverType = (ScreenSaverType)savedType;
  
  // Konfiguracja filtrów CC-Cluster
  clusterNoAnnouncements = preferences->getBool("cluster_noann", true);
  yield();
  clusterNoWWV = preferences->getBool("cluster_nowwv", true);
  yield();
  clusterNoWCY = preferences->getBool("cluster_nowcy", true);
  yield();
  clusterUseFilters = preferences->getBool("cluster_usefilters", false);
  yield();
  clusterFilterCommands = preferences->getString("cluster_filters", "");
  yield();
  
  // Konfiguracja APRS-IS
  aprsIsHost = preferences->getString("aprs_host", DEFAULT_APRS_IS_HOST);
  yield();
  aprsIsPort = preferences->getInt("aprs_port", DEFAULT_APRS_IS_PORT);
  yield();
  aprsCallsign = preferences->getString("aprs_callsign", DEFAULT_APRS_CALLSIGN);
  yield();
  aprsPasscode = preferences->getInt("aprs_passcode", DEFAULT_APRS_PASSCODE);
  applyAprsSsid(preferences->getInt("aprs_ssid", DEFAULT_APRS_SSID));
  yield();
  aprsFilterRadius = preferences->getInt("aprs_radius", DEFAULT_APRS_FILTER_RADIUS);
  yield();
  aprsBeaconEnabled = preferences->getBool("aprs_beacon", true);
  String aprsSymPref = preferences->getString("aprs_symbol", aprsSymbolTwoChar);
  applyAprsSymbol(aprsSymPref);
  aprsUserComment = preferences->getString("aprs_comment", "");
  aprsAlertCsv = sanitizeAprsAlertList(preferences->getString("aprs_alert", ""));
  aprsAlertEnabled = preferences->getBool("aprs_alert_en", true);
  applyAprsAlertMinSeconds(preferences->getInt(NVS_KEY_APRS_ALERT_MIN_SEC, DEFAULT_APRS_ALERT_MIN_SEC));
  applyAprsAlertScreenSeconds(preferences->getInt(NVS_KEY_APRS_ALERT_SCREEN_SEC, DEFAULT_APRS_ALERT_SCREEN_SEC));
  aprsAlertNearbyEnabled = preferences->getBool("aprs_alert_near_en", true);
  aprsAlertWxEnabled = preferences->getBool(NVS_KEY_APRS_ALERT_WX_ENABLED, false);
  applyAprsAlertDistanceKm(preferences->getFloat(NVS_KEY_APRS_ALERT_DISTANCE_KM, DEFAULT_APRS_ALERT_DISTANCE_KM));
  enableLedAlert = preferences->getBool(NVS_KEY_ENABLE_LED_ALERT, DEFAULT_ENABLE_LED_ALERT);
  applyLedAlertDurationMs(preferences->getInt(NVS_KEY_LED_ALERT_DURATION_MS, DEFAULT_LED_ALERT_DURATION_MS));
  applyLedAlertBlinkMs(preferences->getInt(NVS_KEY_LED_ALERT_BLINK_MS, DEFAULT_LED_ALERT_BLINK_MS));
  resetAprsAlertCooldownState();
  int storedIntervalMin = preferences->getInt(NVS_KEY_APRS_INTERVAL_MIN, DEFAULT_APRS_INTERVAL_MIN);
  applyAprsIntervalMinutes(storedIntervalMin);
  yield();
  // Ograniczenie promienia do 1-50 km
  if (aprsFilterRadius < 1) aprsFilterRadius = 1;
  if (aprsFilterRadius > 50) aprsFilterRadius = 50;
  // Uwaga: APRS uÄąÄ˝ywa wspÄ‚łÄąâ€šrzĂ„â„˘dnych z sekcji "Moja Stacja" (userLat, userLon) - nie ma osobnych pÄ‚łl

  if (!userLatLonValid && userLocator.length() >= 4) {
    updateUserLatLonFromLocator();
    preferences->putFloat("user_lat", (float)userLat);
    preferences->putFloat("user_lon", (float)userLon);
    preferences->putBool("user_ll_ok", userLatLonValid);
  }
  
  preferences->end();

  // Zastosuj inwersję kolorów po wczytaniu ustawień
  if (tftInitialized) {
    applyTftInversion();
  }
  
  Serial.println("Konfiguracja wczytana");
}

void savePreferences() {
  if (preferences == nullptr) {
    preferences = new Preferences();
  }
  
  preferences->begin("dxcluster", false);
  preferences->putBytes("screen_order", screenOrder, sizeof(screenOrder));
  
  preferences->putString("wifi_ssid", wifiSSID);
  preferences->putString("wifi_pass", wifiPassword);
  preferences->putString("wifi_ssid2", wifiSSID2);
  preferences->putString("wifi_pass2", wifiPassword2);
  preferences->putString("cluster_host", clusterHost);
  preferences->putInt("cluster_port", clusterPort);
  preferences->putString("pota_host", potaClusterHost);
  preferences->putInt("pota_port", potaClusterPort);
  preferences->putString("pota_filter", potaFilterCommand);
  preferences->putString("pota_api_url", potaApiUrl);
  preferences->putString("hama_host", hamalertHost);
  preferences->putInt("hama_port", hamalertPort);
  preferences->putString("hama_user", hamalertLogin);
  preferences->putString("hama_pass", hamalertPassword);
  preferences->putString("user_callsign", userCallsign);
  preferences->putString("user_locator", userLocator);
  preferences->putInt("timezone", timezoneHours);
  preferences->putFloat("user_lat", (float)userLat);
  preferences->putFloat("user_lon", (float)userLon);
  preferences->putBool("user_ll_ok", userLatLonValid);
  preferences->putString("qrz_user", qrzUsername);
  preferences->putString("qrz_pass", qrzPassword);
  preferences->putString("weather_key", weatherApiKey);
  preferences->putString("openwebrx_url", openWebRxUrl);
  preferences->putInt("tft_backlight", backlightPercent);
  preferences->putBool("tft_inv", sanitizeTftInvertSetting(tftInvertColors));
  preferences->putUChar("tft_lang", tftLanguage);
  preferences->putUChar("tft_tbl_size", dxTableSizeMode);
  preferences->putInt("menu_hue", menuThemeHue);
  preferences->putInt("screen1_time", screen1TimeMode);
  preferences->putBool("tft_autosw", tftAutoSwitchEnabled);
  preferences->putInt("tft_sw_sec", tftAutoSwitchTimeSec);
  preferences->putInt("touch_xmin", touchXMin);
  preferences->putInt("touch_xmax", touchXMax);
  preferences->putInt("touch_ymin", touchYMin);
  preferences->putInt("touch_ymax", touchYMax);
  preferences->putBool("touch_swap", touchSwapXY);
  preferences->putBool("touch_invx", touchInvertX);
  preferences->putBool("touch_invy", touchInvertY);
  preferences->putUChar("touch_rot", touchRotation);
  preferences->putUChar("tft_rot", tftRotation);

  // Konfiguracja PSKReporter
  preferences->putString("psk_receiver", pskReceiverCallsign);
  preferences->putInt("psk_maxspots", pskMaxSpots);
  preferences->putInt("psk_hours", pskHoursWindow);
  preferences->putString("psk_band", pskFilterBand);
  preferences->putString("psk_mode", pskFilterMode);
  preferences->putString("psk_url", pskCustomUrl);
  // HTTP Monitoring
  preferences->putString("psk_monitor", pskMonitorCallsign);
  preferences->putInt("psk_report_days", pskReportDays);
  preferences->putInt("psk_autorefresh", pskAutoRefreshMinutes);

