Tom50505050/esp32-ham-clock/src/main.cpp
  // Konfiguracja wygaszacza ekranu (Matrix)
  preferences->putBool("ss_enabled", screenSaverEnabled);
  preferences->putInt("ss_timeout", screenSaverTimeoutMin);
  
  // Konfiguracja APRS-IS
  preferences->putString("aprs_host", aprsIsHost);
  preferences->putInt("aprs_port", aprsIsPort);
  preferences->putString("aprs_callsign", aprsCallsign);
  preferences->putInt("aprs_passcode", aprsPasscode);
  preferences->putInt("aprs_ssid", aprsSsid);
  preferences->putBool("aprs_beacon", aprsBeaconEnabled);
  preferences->putString("aprs_symbol", aprsSymbolTwoChar);
  preferences->putString("aprs_comment", aprsUserComment);
  preferences->putString("aprs_alert", aprsAlertCsv);
  preferences->putBool("aprs_alert_en", aprsAlertEnabled);
  preferences->putInt(NVS_KEY_APRS_ALERT_MIN_SEC, aprsAlertMinSeconds);
  preferences->putInt(NVS_KEY_APRS_ALERT_SCREEN_SEC, aprsAlertScreenSeconds);
  preferences->putBool("aprs_alert_near_en", aprsAlertNearbyEnabled);
  preferences->putBool(NVS_KEY_APRS_ALERT_WX_ENABLED, aprsAlertWxEnabled);
  preferences->putFloat(NVS_KEY_APRS_ALERT_DISTANCE_KM, aprsAlertDistanceKm);
  preferences->putBool(NVS_KEY_ENABLE_LED_ALERT, enableLedAlert);
  preferences->putInt(NVS_KEY_LED_ALERT_DURATION_MS, ledAlertDurationMs);
  preferences->putInt(NVS_KEY_LED_ALERT_BLINK_MS, ledAlertBlinkMs);
  preferences->putInt(NVS_KEY_APRS_INTERVAL_MIN, aprsIntervalMinutes);
  // Ograniczenie promienia do 1-50 km przed zapisem
  int radiusToSave = aprsFilterRadius;
  if (radiusToSave < 1) radiusToSave = 1;
  if (radiusToSave > 50) radiusToSave = 50;
  preferences->putInt("aprs_radius", radiusToSave);
  // Uwaga: APRS używa współrzędnych z sekcji "Moja Stacja" (userLat, userLon) - nie zapisujemy osobnych pól
  
  // Konfiguracja filtrów CC-Cluster
  preferences->putBool("cluster_noann", clusterNoAnnouncements);
  preferences->putBool("cluster_nowwv", clusterNoWWV);
  preferences->putBool("cluster_nowcy", clusterNoWCY);
  preferences->putBool("cluster_usefilters", clusterUseFilters);
  preferences->putString("cluster_filters", clusterFilterCommands);
  
  preferences->end();
  
  Serial.println("Konfiguracja zapisana");
}

// ========== WEB SERVER ==========

String getMainHTML();
String getConfigHTML();

// Zmienna przechowująca czas startu systemu (do obliczania uptime)
static unsigned long bootTimeMs = 0;

// Funkcja formatująca uptime w czytelny sposób (dni, godziny, minuty, sekundy)
String formatUptime(unsigned long ms) {
  unsigned long totalSeconds = ms / 1000;
  unsigned long days = totalSeconds / 86400;
  unsigned long hours = (totalSeconds % 86400) / 3600;
  unsigned long minutes = (totalSeconds % 3600) / 60;
  unsigned long seconds = totalSeconds % 60;

  String result;
  if (days > 0) {
    result += String(days) + "d ";
  }
  if (hours > 0 || days > 0) {
    result += String(hours) + "h ";
  }
  if (minutes > 0 || hours > 0 || days > 0) {
    result += String(minutes) + "m ";
  }
  result += String(seconds) + "s";
  return result;
}

String getManualPL() {
  return String(
    "ESP32-HAM-CLOCK v1.2 (04.03.2026)\n"
    "Autor: Konrad Wisniewski SP3KON (z użyciem AI)\n"
    "Kontakt: sp3kon@gmail.com\n\n"
    "Wgrywanie przez przeglądarkę (ESP Web Tools)\n"
    "- Strona: https://jason2866.github.io/WebSerial_ESPTool/\n"
    "- Wymagany Chrome lub Edge (WebSerial).\n"
    "- Pliki znajdują się w folderze: build\\esp32.esp32.esp32\\\n"
    "- Dotyczy: CYD ESP32-2432S028R (4MB flash, schemat Default 4MB with spiffs).\n\n"
    "Wgrywanie:\n"
    "1. bootloader.bin    0x1000\n"
    "2. partitions.bin    0x8000\n"
    "3. firmware.bin      0x10000\n"
    "4. littlefs.bin      0x290000\n\n"
    "Po starcie urządzenie tworzy AP: SSID ESP32-HAM-CLOCK, hasło 1234567890\n"
    "(jeśli brak konfiguracji WiFi).\n\n"
    "Konfiguracja WWW:\n"
    "- Wejdź na /config\n"
    "- WiFi: dwa zestawy SSID/hasło (podstawowe i zapasowe)\n"
    "- DX Cluster: host/port + opcje filtrów\n"
    "- POTA: External POTA API Link\n"
    "- HAMALERT: telnet host, port, login i hasło\n"
    "- QRZ.com: username i password\n"
    "- OpenWeather: klucz API\n"
    "- TFT: jasność, język, rozmiar tabel, AUTO-SWITCH\n\n"
    "Więcej informacji: https://github.com/SP3KON/ESP32-HAM-CLOCK\n"
  );
}

void setupWebServer() {
  // UtwÄ‚łrz serwer jeÄąâ€şli jeszcze nie istnieje
  if (server == nullptr) {
    server = new WebServer(80);
  }
  
  // Strona główna - używa pliku z LittleFS jeśli istnieje
  server->on("/", HTTP_GET, []() {
    if (littleFsReady && LittleFS.exists("/index.html")) {
      File f = LittleFS.open("/index.html", "r");
      server->streamFile(f, "text/html; charset=utf-8");
      f.close();
    } else {
      server->send(200, "text/html; charset=utf-8", getMainHTML());
    }
  });

  // Strona główna (alias /index.html)
  server->on("/index.html", HTTP_GET, []() {
    if (littleFsReady && LittleFS.exists("/index.html")) {
      File f = LittleFS.open("/index.html", "r");
      server->streamFile(f, "text/html; charset=utf-8");
      f.close();
    } else {
      server->send(200, "text/html; charset=utf-8", getMainHTML());
    }
  });

  // Strona gÄąâ€šÄ‚łwna (EN)
  server->on("/indexEN.html", HTTP_GET, []() {
    if (littleFsReady && LittleFS.exists("/indexEN.html")) {
      File f = LittleFS.open("/indexEN.html", "r");
      server->streamFile(f, "text/html; charset=utf-8");
      f.close();
    } else if (littleFsReady && LittleFS.exists("/index.html")) {
      File f = LittleFS.open("/index.html", "r");
      server->streamFile(f, "text/html; charset=utf-8");
      f.close();
    } else {
      server->send(200, "text/html; charset=utf-8", getMainHTML());
    }
  });

  // Instrukcja (PL) - przekierowanie na nową wersję HTML
  server->on("/instrukcja.txt", HTTP_GET, []() {
    server->send(301, "text/html", "<html><head><meta http-equiv='refresh' content='0; url=/instruction'></head></html>");
  });

  // Manual (EN)
  server->on("/manual.txt", HTTP_GET, []() {
    if (littleFsReady && LittleFS.exists("/manual.txt")) {
      File f = LittleFS.open("/manual.txt", "r");
      server->streamFile(f, "text/plain; charset=utf-8");
      f.close();
    } else {
      server->send(404, "text/plain", "manual.txt missing in LittleFS");
    }
  });

  // Instrukcja montażu i wgrania (HTML)
  server->on("/instruction", HTTP_GET, []() {
    String html = "<!DOCTYPE html><html><head>";
    html += "<meta charset='UTF-8'>";
    html += "<meta name='viewport' content='width=device-width, initial-scale=1.0'>";
    html += "<title>ESP32-HAM-CLOCK - Instrukcja</title>";
    html += "<style>";
    html += "body{font-family:Arial,sans-serif;margin:20px;background:#f0f0f0;color:#333;line-height:1.6;}";
    html += "h1{color:#0066cc;border-bottom:2px solid #0066cc;padding-bottom:10px;}";
    html += "h2{color:#0099cc;margin-top:30px;border-left:4px solid #0099cc;padding-left:10px;}";
    html += "h3{color:#666;margin-top:20px;}";
    html += "pre{background:#1a1a1a;color:#00ff00;padding:15px;border-radius:5px;overflow-x:auto;font-size:12px;}";
    html += "code{background:#e0e0e0;padding:2px 6px;border-radius:3px;font-family:monospace;}";
    html += "table{border-collapse:collapse;width:100%;margin:15px 0;background:white;}";
    html += "th,td{border:1px solid #ddd;padding:12px;text-align:left;}";
    html += "th{background:#0066cc;color:white;}";
    html += "tr:nth-child(even){background:#f9f9f9;}";
    html += ".note{background:#fff3cd;border-left:4px solid #ffc107;padding:10px;margin:15px 0;}";
    html += ".warning{background:#f8d7da;border-left:4px solid #dc3545;padding:10px;margin:15px 0;}";
    html += ".success{background:#d4edda;border-left:4px solid #28a745;padding:10px;margin:15px 0;}";
    html += "a{color:#0066cc;text-decoration:none;}";
    html += "a:hover{text-decoration:underline;}";
    html += ".back-btn{display:inline-block;background:#0066cc;color:white;padding:10px 20px;border-radius:5px;margin:20px 0;text-decoration:none;}";
    html += ".back-btn:hover{background:#0055aa;text-decoration:none;}";
    html += "</style></head><body>";

    html += "<h1>📻 ESP32-HAM-CLOCK - Instrukcja Montażu i Wgrania</h1>";
    html += "<a href='/' class='back-btn'>← Powrót do głównej</a>";

    // Sekcja montażu
    html += "<h2>🔧 Montaż - Schemat połączeń</h2>";

    html += "<h3>Wymagane komponenty</h3>";
    html += "<table>";
    html += "<tr><th>Element</th><th>Opis</th><th>Alternatywa</th></tr>";
    html += "<tr><td>ESP32</td><td>DevKit v1 (38 pinów)</td><td>WROOM-32 + płytka</td></tr>";
    html += "<tr><td>Wyświetlacz</td><td>TFT 3.5\" ILI9488 480x320</td><td>ILI9341 2.8\"</td></tr>";
    html += "<tr><td>Zasilanie</td><td>Moduł 18650 z ochroną DW01A</td><td>3xAA lub USB</td></tr>";
    html += "<tr><td>Przyciski</td><td>2x tact switch (BOOT, RST)</td><td>-</td></tr>";
    html += "<tr><td>Rezystory</td><td>2x 100kΩ (dzielnik napięcia)</td><td>-</td></tr>";
    html += "</table>";

