Tom50505050/esp32-ham-clock/src/main.cpp
    html += "<h3>Schemat połączeń ESP32 z TFT ILI9488</h3>";
    html += "<pre>";
    html += "ESP32 DevKit v1         TFT ILI9488 (3.5\" 480x320)\n";
    html += "═══════════════════════════════════════════════════════\n";
    html += "GPIO 18 (SCK)    ──────→  SCK / SCL        [ żółty ]\n";
    html += "GPIO 23 (MOSI)   ──────→  SDI / MOSI       [ zielony ]\n";
    html += "GPIO 19 (MISO)   ──────→  SDO / MISO       [ niebieski ] (opcjonalnie)\n";
    html += "GPIO 15 (CS)     ──────→  CS               [ pomarańczowy ]\n";
    html += "GPIO 2  (DC/RS)  ──────→  DC / RS           [ biały ]\n";
    html += "\nZASILANIE:\n";
    html += "3.3V             ──────→  VCC              [ czerwony ]\n";
    html += "GND              ──────→  GND              [ czarny ]\n";
    html += "3.3V             ──────→  LED (podświetlenie) [ przez rezystor 100Ω ]\n";
    html += "</pre>";

    html += "<h3>Pomiar napięcia baterii (dzielnik)</h3>";
    html += "<pre>";
    html += "Bateria 18650 (+) ────┬─── [R1 100kΩ] ───┬───→ GPIO 34 (ADC)\n";
    html += "                      │                 │\n";
    html += "                     GND              [R2 100kΩ] ───┬─── GND\n";
    html += "                                                   │\n";
    html += "                                              Kondensator 100nF\n";
    html += "</pre>";
    html += "<div class='note'><strong>Formuła:</strong> Vbat = Vadc × 2 (przy R1 = R2 = 100kΩ)</div>";

    html += "<h3>Podłączenie dotyku XPT2046 (opcjonalnie)</h3>";
    html += "<pre>";
    html += "ESP32                   XPT2046 (dotyk)\n";
    html += "══════════════════════════════════════════\n";
    html += "GPIO 4   ──────→  T_IRQ\n";
    html += "GPIO 12  ──────→  T_DO\n";
    html += "GPIO 13  ──────→  T_DIN\n";
    html += "GPIO 14  ──────→  T_CS\n";
    html += "GPIO 25  ──────→  T_CLK\n";
    html += "</pre>";

    // Sekcja wgrania
    html += "<h2>💾 Wgrywanie Firmware</h2>";

    html += "<h3>Pliki w folderze <code>pliki.bin/</code></h3>";
    html += "<table>";
    html += "<tr><th>Plik</th><th>Adres</th><th>Opis</th></tr>";
    html += "<tr><td><code>bootloader.bin</code></td><td><code>0x1000</code></td><td>Bootloader ESP32</td></tr>";
    html += "<tr><td><code>partitions.bin</code></td><td><code>0x8000</code></td><td>Tablica partycji</td></tr>";
    html += "<tr><td><code>firmware.bin</code></td><td><code>0x10000</code></td><td>Główny program</td></tr>";
    html += "<tr><td><code>littlefs.bin</code></td><td><code>0x290000</code></td><td>System plików (ikony, fonty)</td></tr>";
    html += "</table>";

    html += "<h3>Sposób 1: WebSerial ESPTool (przeglądarka) - NAJPROSTSZY</h3>";
    html += "<div class='success'>✅ <strong>Najprostsza metoda - bez instalowania żadnych programów!</strong></div>";
    html += "<ol>";
    html += "<li>Otwórz stronę: <a href='https://jason2866.github.io/WebSerial_ESPTool/' target='_blank'>https://jason2866.github.io/WebSerial_ESPTool/</a></li>";
    html += "<li>Podłącz ESP32 przez USB</li>";
    html += "<li>Kliknij <strong>Connect</strong> i wybierz port COM</li>";
    html += "<li>Przytrzymaj <strong>BOOT</strong>, naciśnij <strong>RST</strong>, puść <strong>BOOT</strong></li>";
    html += "<li>Wybierz pliki do wgrania (bootloader.bin, partitions.bin, firmware.bin, littlefs.bin)</li>";
    html += "<li>Kliknij <strong>Program</strong> i czekaj (~2-3 minuty)</li>";
    html += "<li>Po zakończeniu naciśnij <strong>RST</strong> na ESP32</li>";
    html += "</ol>";

    html += "<h3>Sposób 2: ESP Flash Download Tool (Windows)</h3>";
    html += "<ol>";
    html += "<li>Pobierz <strong>ESP Flash Download Tool</strong> z: https://www.espressif.com/en/support/download/other-tools</li>";
    html += "<li>Wybierz chip: <strong>ESP32</strong>, COM port i BAUD: <strong>921600</strong></li>";
    html += "<li>Dodaj pliki z adresami:<br>";
    html += "<code>bootloader.bin @ 0x1000</code><br>";
    html += "<code>partitions.bin @ 0x8000</code><br>";
    html += "<code>firmware.bin @ 0x10000</code><br>";
    html += "<code>littlefs.bin @ 0x290000</code></li>";
    html += "<li>Zaznacz checkbox przy każdym pliku</li>";
    html += "<li>Kliknij <strong>START</strong> (przytrzymaj BOOT i naciśnij RST)</li>";
    html += "</ol>";

    html += "<h3>Sposób 3: esptool.py (Windows/Linux/Mac)</h3>";
    html += "<pre>";
    html += "pip install esptool\n\n";
    html += "esptool.py --chip esp32 --port COM7 --baud 921600 write_flash \\\n";
    html += "  0x1000 bootloader.bin \\\n";
    html += "  0x8000 partitions.bin \\\n";
    html += "  0x10000 firmware.bin \\\n";
    html += "  0x290000 littlefs.bin\n";
    html += "</pre>";

    html += "<h3>Sposób 4: PlatformIO (VS Code)</h3>";
    html += "<pre>pio run --target upload</pre>";

    // Troubleshooting
    html += "<h2>🔧 Troubleshooting</h2>";

    html += "<div class='warning'>⚠️ <strong>\"Failed to connect to ESP32\"</strong><br>";
    html += "Przytrzymaj przycisk <strong>BOOT</strong> (GPIO0), naciśnij i puść <strong>RST</strong> (EN), puść <strong>BOOT</strong>. ESP32 wejdzie w tryb bootloadera.</div>";

    html += "<div class='warning'>⚠️ <strong>Biały ekran TFT</strong><br>";
    html += "Sprawdź połączenie zasilania i podświetlenia LED. Upewnij się że LED jest podłączony do 3.3V (lub 5V przez rezystor 100Ω).</div>";

    html += "<div class='warning'>⚠️ <strong>Brak obrazu na TFT</strong><br>";
    html += "Sprawdź połączenie SPI: SCK (GPIO18), MOSI (GPIO23), CS (GPIO15), DC (GPIO2). Upewnij się że masz wspólne GND.</div>";

    html += "<div class='note'>💡 <strong>Nie działa touch (XPT2046)</strong><br>";
    html += "XPT2046 używa osobnego SPI. Sprawdź połączenia: T_CLK (GPIO25), T_CS (GPIO14), T_DIN (GPIO13), T_DO (GPIO12), T_IRQ (GPIO4).</div>";

    // Stopka
    html += "<hr style='margin:40px 0;'>";
    html += "<p style='text-align:center;color:#666;'>";
    html += "<strong>ESP32-HAM-CLOCK</strong> | Wersja 1.2b | Autor: SP3KON<br>";
    html += "Modyfikacje: SP9TNV | Licencja: MIT<br>";
    html += "<a href='mailto:sp3kon@gmail.com'>sp3kon@gmail.com</a>";
    html += "</p>";

    html += "<a href='/' class='back-btn'>← Powrót do głównej</a>";
    html += "</body></html>";

    server->send(200, "text/html; charset=utf-8", html);
  });

  // Strona konfiguracji
  server->on("/config", HTTP_GET, []() {
    if (littleFsReady && LittleFS.exists("/index.html")) {
      File f = LittleFS.open("/index.html", "r");
      server->streamFile(f, "text/html; charset=utf-8");
      f.close();
    } else {
      server->send(200, "text/html; charset=utf-8", getConfigHTML());
    }
  });
  
