Tom50505050/esp32-ham-clock/src/main.cpp
  // API - pobierz wszystkie spoty (maksymalnie 50)
  server->on("/api/spots", HTTP_GET, []() {
    // ZwiĂ„â„˘kszony bufor JSON dla 50 spotÄ‚łw (kaÄąÄ˝dy spot ~150-200 bajtÄ‚łw)
    StaticJsonDocument<12000> doc;  // 50 spotÄ‚łw * ~200 bajtÄ‚łw = ~10KB + margines
    JsonArray spotsArray = doc.createNestedArray("spots");
    
    // ZwrÄ‚łĂ„â€ˇ wszystkie spoty (maksymalnie 50)
    for (int i = 0; i < spotCount; i++) {
      JsonObject spotObj = spotsArray.createNestedObject();
      spotObj["time"] = spots[i].time;
      spotObj["callsign"] = spots[i].callsign;
      spotObj["frequency"] = spots[i].frequency;
      spotObj["distance"] = spots[i].distance;
      spotObj["country"] = spots[i].country;
      spotObj["band"] = spots[i].band;
      spotObj["mode"] = spots[i].mode;
      spotObj["spotter"] = spots[i].spotter;
      spotObj["comment"] = spots[i].comment;
    }
    
    String json;
    serializeJson(doc, json);
    server->send(200, "application/json", json);
  });
  
  // API - pobierz stacje APRS
  server->on("/api/aprs", HTTP_GET, []() {
    // Bufor JSON dla 20 stacji APRS (kaÄąÄ˝da stacja ~200-250 bajtÄ‚łw)
    StaticJsonDocument<6000> doc;  // 20 stacji * ~250 bajtÄ‚łw = ~5KB + margines
    JsonArray aprsArray = doc.createNestedArray("stations");
    
    // ZwrÄ‚łĂ„â€ˇ wszystkie stacje APRS (maksymalnie 20)
    for (int i = 0; i < aprsStationCount; i++) {
      JsonObject stationObj = aprsArray.createNestedObject();
      stationObj["time"] = aprsStations[i].time;
      stationObj["callsign"] = aprsStations[i].callsign;
      stationObj["symbol"] = getAPRSSymbolShort(aprsStations[i]);
      stationObj["lat"] = aprsStations[i].lat;
      stationObj["lon"] = aprsStations[i].lon;
      stationObj["comment"] = aprsStations[i].comment;
      stationObj["distance"] = aprsStations[i].distance;
      stationObj["hasLatLon"] = aprsStations[i].hasLatLon;
      stationObj["freq_mhz"] = aprsStations[i].freqMHz;
    }
    
    String json;
    serializeJson(doc, json);
    server->send(200, "application/json", json);
  });

  // API - POTA (bufor z backendu, z krajami z QRZ jeśli dostępne)
  server->on("/api/pota", HTTP_GET, []() {
    StaticJsonDocument<12000> doc; // do 30 spotów * ~300-350 bajtów
    JsonArray spotsArray = doc.createNestedArray("spots");
    const int apiSpotLimit = 30;
    const int potaApiCount = (potaSpotCount < apiSpotLimit) ? potaSpotCount : apiSpotLimit;
    for (int i = 0; i < potaApiCount; i++) {
      JsonObject spotObj = spotsArray.createNestedObject();
      spotObj["time"] = potaSpots[i].time;
      spotObj["spotTime"] = potaSpots[i].time; // zgodność z POTA API
      spotObj["callsign"] = potaSpots[i].callsign;
      spotObj["frequency"] = potaSpots[i].frequency;
      spotObj["mode"] = potaSpots[i].mode;
      spotObj["country"] = potaSpots[i].country;
      spotObj["spotter"] = potaSpots[i].spotter;
      spotObj["comment"] = potaSpots[i].comment;
      spotObj["band"] = potaSpots[i].band;
    }
    doc["count"] = potaApiCount;
    doc["total"] = potaSpotCount;
    String json;
    serializeJson(doc, json);
    server->send(200, "application/json", json);
  });

  // API - HAMALERT (ostatnie spoty z telnetu)
  server->on("/api/hamalert", HTTP_GET, []() {
    StaticJsonDocument<12000> doc; // do 30 spotów
    JsonArray spotsArray = doc.createNestedArray("spots");
    const int apiSpotLimit = 30;
    const int hamalertApiCount = (hamalertSpotCount < apiSpotLimit) ? hamalertSpotCount : apiSpotLimit;
    for (int i = 0; i < hamalertApiCount; i++) {
      JsonObject spotObj = spotsArray.createNestedObject();
      spotObj["time"] = hamalertSpots[i].time;
      spotObj["spotTime"] = hamalertSpots[i].time;
      spotObj["callsign"] = hamalertSpots[i].callsign;
      spotObj["frequency"] = hamalertSpots[i].frequency;
      spotObj["mode"] = hamalertSpots[i].mode;
      spotObj["country"] = hamalertSpots[i].country;
      spotObj["spotter"] = hamalertSpots[i].spotter;
      spotObj["comment"] = hamalertSpots[i].comment;
      spotObj["band"] = hamalertSpots[i].band;
    }
    doc["count"] = hamalertApiCount;
    doc["total"] = hamalertSpotCount;
    String json;
    serializeJson(doc, json);
    server->send(200, "application/json", json);
  });
  
  // API - pobierz spoty PSK Reporter
  server->on("/api/psk", HTTP_GET, []() {
    StaticJsonDocument<10000> doc;
    JsonArray spotsArray = doc.createNestedArray("spots");
    
    for (int i = 0; i < pskSpotCount; i++) {
      JsonObject spotObj = spotsArray.createNestedObject();
      spotObj["callsign"] = pskSpots[i].callsign;
      spotObj["lat"] = pskSpots[i].lat;
      spotObj["lon"] = pskSpots[i].lon;
      spotObj["band"] = pskSpots[i].band;
      spotObj["mode"] = pskSpots[i].mode;
      spotObj["snr"] = pskSpots[i].snr;
    }
    
    doc["count"] = pskSpotCount;
    doc["lastFetchMs"] = lastPskFetchMs;
    
    String json;
    serializeJson(doc, json);
    server->send(200, "application/json", json);
  });
  
  // API - zapisz konfiguracjĂ„â„˘
  server->on("/api/save", HTTP_POST, []() {
    if (server->hasArg("plain")) {
      String body = server->arg("plain");
      
        StaticJsonDocument<8192> doc;  // Bufor dla pełnego payloadu konfiguracji z WWW
      DeserializationError err = deserializeJson(doc, body);
      if (err) {
        server->send(400, "application/json", "{\"status\":\"error\",\"message\":\"json_parse\"}");
        return;
      }
      
      wifiSSID = doc["wifi_ssid"].as<String>();
      wifiPassword = doc["wifi_pass"].as<String>();
      if (doc["wifi_ssid2"].is<String>()) {
        wifiSSID2 = doc["wifi_ssid2"].as<String>();
      }
      if (doc["wifi_pass2"].is<String>()) {
        wifiPassword2 = doc["wifi_pass2"].as<String>();
      }
      clusterHost = doc["cluster_host"].as<String>();
      if (doc["pota_host"].is<String>()) {
        potaClusterHost = doc["pota_host"].as<String>();
      }
      if (doc["pota_filter"].is<String>()) {
        potaFilterCommand = doc["pota_filter"].as<String>();
      }
      if (doc["pota_api_url"].is<String>()) {
        potaApiUrl = doc["pota_api_url"].as<String>();
      }
      if (doc["hamalert_host"].is<String>()) {
        hamalertHost = doc["hamalert_host"].as<String>();
      }
      if (doc["hamalert_port"].is<int>()) {
        hamalertPort = doc["hamalert_port"].as<int>();
      }
      if (doc["hamalert_login"].is<String>()) {
        hamalertLogin = doc["hamalert_login"].as<String>();
      }
      if (doc["hamalert_password"].is<String>()) {
        hamalertPassword = doc["hamalert_password"].as<String>();
      }
      userCallsign = doc["user_callsign"].as<String>();
      userLocator = doc["user_locator"].as<String>();
      if (doc["timezone"].is<int>()) {
        timezoneHours = doc["timezone"].as<int>();
        if (timezoneHours < -12) timezoneHours = -12;
        if (timezoneHours > 14) timezoneHours = 14;
      }
      
      // WspÄ‚łÄąâ€šrzĂ„â„˘dne geograficzne (LAT/LON)
      bool latProvided = false;
      bool lonProvided = false;
      if (doc["user_lat"].is<float>() || doc["user_lat"].is<double>()) {
        userLat = doc["user_lat"].as<double>();
        latProvided = true;
      }
      if (doc["user_lon"].is<float>() || doc["user_lon"].is<double>()) {
        userLon = doc["user_lon"].as<double>();
        lonProvided = true;
      }
      // JeÄąâ€şli podano obie wspÄ‚łÄąâ€šrzĂ„â„˘dne, ustaw flagĂ„â„˘ jako waÄąÄ˝ne
      // Uwaga: sprawdzamy czy wartoÄąâ€şci sĂ„â€¦ w prawidÄąâ€šowym zakresie (nie tylko != 0)
      if (latProvided && lonProvided && 
          userLat >= -90.0 && userLat <= 90.0 && 
          userLon >= -180.0 && userLon <= 180.0) {
        userLatLonValid = true;
      } else if (latProvided || lonProvided) {
        // JeÄąâ€şli podano tylko jednĂ„â€¦ wspÄ‚łÄąâ€šrzĂ„â„˘dnĂ„â€¦, uznaj za nieprawidÄąâ€šowe
        userLatLonValid = false;
      }
      
      if (doc["qrz_user"].is<String>()) {
        qrzUsername = doc["qrz_user"].as<String>();
      }
      if (doc["qrz_pass"].is<String>()) {
        qrzPassword = doc["qrz_pass"].as<String>();
      }
      if (doc["weather_key"].is<String>()) {
        weatherApiKey = doc["weather_key"].as<String>();
      }
      if (doc["openwebrx_url"].is<String>()) {
        openWebRxUrl = doc["openwebrx_url"].as<String>();
      }
      if (doc["tft_backlight"].is<int>()) {
        backlightPercent = doc["tft_backlight"].as<int>();
        if (backlightPercent < MIN_BACKLIGHT_PERCENT) backlightPercent = MIN_BACKLIGHT_PERCENT;
        if (backlightPercent > 100) backlightPercent = 100;
      }
      if (doc["tft_invert"].is<bool>()) {
        tftInvertColors = sanitizeTftInvertSetting(doc["tft_invert"].as<bool>());
      }
      if (doc["tft_lang"].is<String>()) {
        tftLanguage = tftLangFromCode(doc["tft_lang"].as<String>());
      } else if (doc["tft_lang"].is<int>()) {
        int lang = doc["tft_lang"].as<int>();
        tftLanguage = (lang == TFT_LANG_EN) ? TFT_LANG_EN : TFT_LANG_PL;
      }
      if (doc["table_size"].is<String>()) {
        dxTableSizeMode = dxTableSizeFromCode(doc["table_size"].as<String>());
      } else if (doc["table_size"].is<int>()) {
        int sizeMode = doc["table_size"].as<int>();
        dxTableSizeMode = (sizeMode == DX_TABLE_SIZE_ENLARGED) ? DX_TABLE_SIZE_ENLARGED : DX_TABLE_SIZE_NORMAL;
      }
      if (doc["menu_hue"].is<int>()) {
        int hue = doc["menu_hue"].as<int>();
        if (hue < 0) hue = 0;
        if (hue > 255) hue = 255;
        menuThemeHue = (uint8_t)hue;
        applyMenuThemeFromHue();
      }
      
