Tom50505050/esp32-ham-clock/src/main.cpp
      // Konfiguracja filtrÄ‚łw CC-Cluster
      if (doc["cluster_noann"].is<bool>()) {
        clusterNoAnnouncements = doc["cluster_noann"].as<bool>();
      }
      if (doc["cluster_nowwv"].is<bool>()) {
        clusterNoWWV = doc["cluster_nowwv"].as<bool>();
      }
      if (doc["cluster_nowcy"].is<bool>()) {
        clusterNoWCY = doc["cluster_nowcy"].as<bool>();
      }
      if (doc["cluster_usefilters"].is<bool>()) {
        clusterUseFilters = doc["cluster_usefilters"].as<bool>();
      }
      if (doc["cluster_filters"].is<String>()) {
        clusterFilterCommands = doc["cluster_filters"].as<String>();
      }
      
      // Konfiguracja APRS-IS
      if (doc["aprs_host"].is<String>()) {
        aprsIsHost = doc["aprs_host"].as<String>();
      }
      if (doc["aprs_port"].is<int>()) {
        aprsIsPort = doc["aprs_port"].as<int>();
      }
      if (doc["aprs_callsign"].is<String>()) {
        aprsCallsign = doc["aprs_callsign"].as<String>();
      }
      if (doc["aprs_passcode"].is<int>()) {
        aprsPasscode = doc["aprs_passcode"].as<int>();
      }
      if (doc["aprs_ssid"].is<int>()) {
        applyAprsSsid(doc["aprs_ssid"].as<int>());
      }
      if (doc["aprs_beacon"].is<bool>()) {
        aprsBeaconEnabled = doc["aprs_beacon"].as<bool>();
      }
      if (doc["aprs_symbol"].is<String>()) {
        applyAprsSymbol(doc["aprs_symbol"].as<String>());
      }
      if (doc["aprs_comment"].is<String>()) {
        aprsUserComment = sanitizeAprsComment(doc["aprs_comment"].as<String>());
      }
      bool aprsAlertConfigChanged = false;
      if (doc["aprs_alert"].is<String>()) {
        aprsAlertCsv = sanitizeAprsAlertList(doc["aprs_alert"].as<String>());
        aprsAlertConfigChanged = true;
      }
      if (doc["aprs_alert_enabled"].is<bool>()) {
        aprsAlertEnabled = doc["aprs_alert_enabled"].as<bool>();
      }
      if (doc["aprs_alert_nearby_enabled"].is<bool>()) {
        aprsAlertNearbyEnabled = doc["aprs_alert_nearby_enabled"].as<bool>();
      }
      if (doc["aprs_alert_wx_enabled"].is<bool>()) {
        aprsAlertWxEnabled = doc["aprs_alert_wx_enabled"].as<bool>();
        aprsAlertConfigChanged = true;
      }
      if (doc.containsKey("aprs_alert_min_sec")) {
        int alertMinSecCandidate = aprsAlertMinSeconds;
        if (doc["aprs_alert_min_sec"].is<int>()) {
          alertMinSecCandidate = doc["aprs_alert_min_sec"].as<int>();
        } else if (doc["aprs_alert_min_sec"].is<long>()) {
          alertMinSecCandidate = (int)doc["aprs_alert_min_sec"].as<long>();
        } else if (doc["aprs_alert_min_sec"].is<float>() || doc["aprs_alert_min_sec"].is<double>()) {
          alertMinSecCandidate = (int)doc["aprs_alert_min_sec"].as<double>();
        } else if (doc["aprs_alert_min_sec"].is<String>()) {
          String alertMinStr = doc["aprs_alert_min_sec"].as<String>();
          alertMinStr.trim();
          alertMinSecCandidate = alertMinStr.toInt();
        }
        applyAprsAlertMinSeconds(alertMinSecCandidate);
        aprsAlertConfigChanged = true;
      }
      if (doc.containsKey("aprs_alert_screen_sec")) {
        int alertScreenSecCandidate = aprsAlertScreenSeconds;
        if (doc["aprs_alert_screen_sec"].is<int>()) {
          alertScreenSecCandidate = doc["aprs_alert_screen_sec"].as<int>();
        } else if (doc["aprs_alert_screen_sec"].is<long>()) {
          alertScreenSecCandidate = (int)doc["aprs_alert_screen_sec"].as<long>();
        } else if (doc["aprs_alert_screen_sec"].is<float>() || doc["aprs_alert_screen_sec"].is<double>()) {
          alertScreenSecCandidate = (int)doc["aprs_alert_screen_sec"].as<double>();
        } else if (doc["aprs_alert_screen_sec"].is<String>()) {
          String alertScreenSecStr = doc["aprs_alert_screen_sec"].as<String>();
          alertScreenSecStr.trim();
          alertScreenSecCandidate = alertScreenSecStr.toInt();
        }
        applyAprsAlertScreenSeconds(alertScreenSecCandidate);
      }
      if (doc.containsKey("aprs_alert_distance_km")) {
        float alertDistanceCandidate = aprsAlertDistanceKm;
        if (doc["aprs_alert_distance_km"].is<float>() || doc["aprs_alert_distance_km"].is<double>()) {
          alertDistanceCandidate = (float)doc["aprs_alert_distance_km"].as<double>();
        } else if (doc["aprs_alert_distance_km"].is<int>()) {
          alertDistanceCandidate = (float)doc["aprs_alert_distance_km"].as<int>();
        } else if (doc["aprs_alert_distance_km"].is<long>()) {
          alertDistanceCandidate = (float)doc["aprs_alert_distance_km"].as<long>();
        } else if (doc["aprs_alert_distance_km"].is<String>()) {
          String alertDistanceStr = doc["aprs_alert_distance_km"].as<String>();
          alertDistanceStr.trim();
          alertDistanceStr.replace(',', '.');
          alertDistanceCandidate = alertDistanceStr.toFloat();
        }
        applyAprsAlertDistanceKm(alertDistanceCandidate);
      }
      if (doc["enable_led_alert"].is<bool>()) {
        enableLedAlert = doc["enable_led_alert"].as<bool>();
      }
      if (doc.containsKey("led_alert_duration_ms")) {
        int ledDurationCandidate = ledAlertDurationMs;
        if (doc["led_alert_duration_ms"].is<int>()) {
          ledDurationCandidate = doc["led_alert_duration_ms"].as<int>();
        } else if (doc["led_alert_duration_ms"].is<long>()) {
          ledDurationCandidate = (int)doc["led_alert_duration_ms"].as<long>();
        } else if (doc["led_alert_duration_ms"].is<float>() || doc["led_alert_duration_ms"].is<double>()) {
          ledDurationCandidate = (int)doc["led_alert_duration_ms"].as<double>();
        } else if (doc["led_alert_duration_ms"].is<String>()) {
          String ledDurationStr = doc["led_alert_duration_ms"].as<String>();
          ledDurationStr.trim();
          ledDurationCandidate = ledDurationStr.toInt();
        }
        applyLedAlertDurationMs(ledDurationCandidate);
      }
      if (doc.containsKey("led_alert_blink_ms")) {
        int ledBlinkCandidate = ledAlertBlinkMs;
        if (doc["led_alert_blink_ms"].is<int>()) {
          ledBlinkCandidate = doc["led_alert_blink_ms"].as<int>();
        } else if (doc["led_alert_blink_ms"].is<long>()) {
          ledBlinkCandidate = (int)doc["led_alert_blink_ms"].as<long>();
        } else if (doc["led_alert_blink_ms"].is<float>() || doc["led_alert_blink_ms"].is<double>()) {
          ledBlinkCandidate = (int)doc["led_alert_blink_ms"].as<double>();
        } else if (doc["led_alert_blink_ms"].is<String>()) {
          String ledBlinkStr = doc["led_alert_blink_ms"].as<String>();
          ledBlinkStr.trim();
          ledBlinkCandidate = ledBlinkStr.toInt();
        }
        applyLedAlertBlinkMs(ledBlinkCandidate);
      }
      if (doc.containsKey("aprs_interval_min")) {
        int intervalCandidate = aprsIntervalMinutes;
        if (doc["aprs_interval_min"].is<int>()) {
          intervalCandidate = doc["aprs_interval_min"].as<int>();
        } else if (doc["aprs_interval_min"].is<long>()) {
          intervalCandidate = (int)doc["aprs_interval_min"].as<long>();
        } else if (doc["aprs_interval_min"].is<float>() || doc["aprs_interval_min"].is<double>()) {
          intervalCandidate = (int)doc["aprs_interval_min"].as<double>();
        } else if (doc["aprs_interval_min"].is<String>()) {
          String intervalStr = doc["aprs_interval_min"].as<String>();
          intervalStr.trim();
          intervalCandidate = intervalStr.toInt();
        }
        applyAprsIntervalMinutes(intervalCandidate);
      }
      if (aprsAlertConfigChanged) {
        resetAprsAlertCooldownState();
      }
      if (doc["aprs_radius"].is<int>()) {
        aprsFilterRadius = doc["aprs_radius"].as<int>();
        // Ograniczenie promienia do 1-50 km
        if (aprsFilterRadius < 1) aprsFilterRadius = 1;
        if (aprsFilterRadius > 50) aprsFilterRadius = 50;
      }
      // Uwaga: APRS uÄąÄ˝ywa wspÄ‚łÄąâ€šrzĂ„â„˘dnych z sekcji "Moja Stacja" (userLat, userLon) - nie ma osobnych pÄ‚łl
      
      // Konfiguracja trybu kalibracji dotyku (ręczne nadpisanie)
      if (doc["touch_swap_mode"].is<String>()) {
        String mode = doc["touch_swap_mode"].as<String>();
        // Resetuj wszystkie flagi
        touchSwapXY = false;
        touchInvertX = false;
        touchInvertY = false;
        // Ustaw odpowiednią flagę lub kombinację
        if (mode == "xy") {
          touchSwapXY = true;
        } else if (mode == "x") {
          touchInvertX = true;
        } else if (mode == "y") {
          touchInvertY = true;
        } else if (mode == "both") {
          touchInvertX = true;
          touchInvertY = true;
        } else if (mode == "rot90cw") {
          // Obrót 90Â° w prawo (clockwise)
          touchSwapXY = true;
          touchInvertX = true;
        } else if (mode == "rot90ccw") {
          // Obrót 90Â° w lewo (counter-clockwise)
          touchSwapXY = true;
          touchInvertY = true;
        } else if (mode == "xy_both") {
          touchSwapXY = true;
          touchInvertX = true;
          touchInvertY = true;
        }
        // "none" pozostawia wszystkie false
        Serial.print("Touch swap mode set to: ");
        Serial.println(mode);
      }
      
      // Touch rotation (0-3)
      if (doc["touch_rotation"].is<int>()) {
        int rot = doc["touch_rotation"].as<int>();
        if (rot >= 0 && rot <= 3) {
          touchRotation = (uint8_t)rot;
          Serial.print("Touch rotation set to: ");
          Serial.println(touchRotation);
        }
      }

      // TFT rotation (0-3)
      if (doc["tft_rotation"].is<int>()) {
        int rot = doc["tft_rotation"].as<int>();
        if (rot >= 0 && rot <= 3) {
          tftRotation = (uint8_t)rot;
          touchRotation = tftRotation; // Synchronizuj rotację dotyku z TFT
          Serial.print("TFT rotation set to: ");
          Serial.print(tftRotation);
          Serial.print(", touch rotation synchronized to: ");
          Serial.println(touchRotation);
        }
      }

      // Indywidualne parametry kalibracji dotyku (xmin, xmax, ymin, ymax)
      if (doc["touch_xmin"].is<int>()) {
        int val = doc["touch_xmin"].as<int>();
        if (val >= 0 && val <= 4095) touchXMin = val;
      }
      if (doc["touch_xmax"].is<int>()) {
        int val = doc["touch_xmax"].as<int>();
        if (val >= 0 && val <= 4095) touchXMax = val;
      }
      if (doc["touch_ymin"].is<int>()) {
        int val = doc["touch_ymin"].as<int>();
        if (val >= 0 && val <= 4095) touchYMin = val;
      }
      if (doc["touch_ymax"].is<int>()) {
        int val = doc["touch_ymax"].as<int>();
        if (val >= 0 && val <= 4095) touchYMax = val;
      }
      // Individual touch flags (override touch_swap_mode if provided)
      if (doc["touch_swap"].is<bool>()) {
        touchSwapXY = doc["touch_swap"].as<bool>();
      }
      if (doc["touch_invx"].is<bool>()) {
        touchInvertX = doc["touch_invx"].as<bool>();
      }
      if (doc["touch_invy"].is<bool>()) {
        touchInvertY = doc["touch_invy"].as<bool>();
      }

