Tom50505050/esp32-ham-clock/src/main.cpp
      // Ustawienia PSKReporter
      if (doc["psk_receiver"].is<String>()) {
        pskReceiverCallsign = doc["psk_receiver"].as<String>();
        pskReceiverCallsign.trim();
        pskReceiverCallsign.toUpperCase();
      }
      if (doc["psk_maxspots"].is<int>()) {
        pskMaxSpots = doc["psk_maxspots"].as<int>();
        if (pskMaxSpots < 10) pskMaxSpots = 10;
        if (pskMaxSpots > 100) pskMaxSpots = 100;
      }
      if (doc["psk_hours"].is<int>()) {
        pskHoursWindow = doc["psk_hours"].as<int>();
        if (pskHoursWindow < 1) pskHoursWindow = 1;
        if (pskHoursWindow > 24) pskHoursWindow = 24;
      }
      if (doc["psk_band"].is<String>()) {
        pskFilterBand = doc["psk_band"].as<String>();
      }
      if (doc["psk_mode"].is<String>()) {
        pskFilterMode = doc["psk_mode"].as<String>();
        pskFilterMode.toUpperCase();
      }
      if (doc["psk_url"].is<String>()) {
        pskCustomUrl = doc["psk_url"].as<String>();
        pskCustomUrl.trim();
      }
      // HTTP Monitoring
      if (doc["psk_monitor_callsign"].is<String>()) {
        pskMonitorCallsign = doc["psk_monitor_callsign"].as<String>();
        pskMonitorCallsign.trim();
        pskMonitorCallsign.toUpperCase();
      }
      if (doc["psk_report_days"].is<int>()) {
        pskReportDays = doc["psk_report_days"].as<int>();
        if (pskReportDays < 0) pskReportDays = 0;
        if (pskReportDays > 62) pskReportDays = 62;
      }
      if (doc["psk_auto_refresh"].is<int>()) {
        pskAutoRefreshMinutes = doc["psk_auto_refresh"].as<int>();
        if (pskAutoRefreshMinutes < 0) pskAutoRefreshMinutes = 0;
        if (pskAutoRefreshMinutes > 60) pskAutoRefreshMinutes = 60;
      }

      // Sanitizacja (najczĂ„â„˘stsza przyczyna: spacje na koÄąâ€žcu SSID/hasÄąâ€ša)
      wifiSSID.trim();
      wifiPassword.trim();
      wifiSSID2.trim();
      wifiPassword2.trim();
      clusterHost.trim();
      potaClusterHost.trim();
      potaFilterCommand.trim();
      potaApiUrl.trim();
      hamalertHost.trim();
      hamalertLogin.trim();
      hamalertPassword.trim();
      userCallsign.trim();
      userLocator.trim();
      clusterFilterCommands.trim();
      weatherApiKey.trim();
      openWebRxUrl.trim();
      aprsIsHost.trim();
      aprsCallsign.trim();
      // KiwiSDR URL - może być puste (użytkownik nie musi ustawiać)

      if (potaApiUrl.length() == 0) {
        potaApiUrl = DEFAULT_POTA_API_URL;
      }
      if (hamalertHost.length() == 0) {
        hamalertHost = DEFAULT_HAMALERT_HOST;
      }
      if (hamalertPort <= 0 || hamalertPort > 65535) {
        hamalertPort = DEFAULT_HAMALERT_PORT;
      }

      // Kolejność ekranów konfigurowana z WWW
      if (doc["screen_order"].is<JsonArray>()) {
        JsonArray arr = doc["screen_order"].as<JsonArray>();
        int idx = 0;
        for (JsonVariant v : arr) {
          if (idx >= SCREEN_ORDER_COUNT) break;
          if (v.is<const char*>()) {
            String code = v.as<const char*>();
            ScreenType parsed = screenCodeToType(code);
            // Unknown code should not silently clear slot to OFF.
            if (parsed == SCREEN_OFF) {
              String tmp = code;
              tmp.toLowerCase();
              tmp.trim();
              if (tmp != "off") {
                parsed = DEFAULT_SCREEN_ORDER[idx];
              }
            }
            screenOrder[idx] = parsed;
          } else if (v.is<int>()) {
            int raw = v.as<int>();
            ScreenType parsed = normalizeScreenType(raw);
            if (parsed == SCREEN_OFF && raw != 0) {
              parsed = DEFAULT_SCREEN_ORDER[idx];
            }
            screenOrder[idx] = parsed;
          }
          idx++;
        }
        // Jeśli JSON był krótszy, pozostałe uzupełnij wartościami domyślnymi,
        // aby nie gubić ekranów (np. APRS RADAR) przy starszym/okrojonym payloadzie.
        for (; idx < SCREEN_ORDER_COUNT; idx++) {
          screenOrder[idx] = DEFAULT_SCREEN_ORDER[idx];
        }
      }
      ensureScreenOrderValid();

      if (doc["tft_auto_switch"].is<bool>()) {
        tftAutoSwitchEnabled = doc["tft_auto_switch"].as<bool>();
      }
      if (doc.containsKey("tft_switch_time_sec")) {
        int switchTimeCandidate = tftAutoSwitchTimeSec;
        if (doc["tft_switch_time_sec"].is<int>()) {
          switchTimeCandidate = doc["tft_switch_time_sec"].as<int>();
        } else if (doc["tft_switch_time_sec"].is<long>()) {
          switchTimeCandidate = (int)doc["tft_switch_time_sec"].as<long>();
        } else if (doc["tft_switch_time_sec"].is<float>() || doc["tft_switch_time_sec"].is<double>()) {
          switchTimeCandidate = (int)doc["tft_switch_time_sec"].as<double>();
        } else if (doc["tft_switch_time_sec"].is<String>()) {
          String switchTimeStr = doc["tft_switch_time_sec"].as<String>();
          switchTimeStr.trim();
          switchTimeCandidate = switchTimeStr.toInt();
        }
        applyTftAutoSwitchTimeSec(switchTimeCandidate);
      }
      resetTftAutoSwitchTimer();

      // Ustawienia wygaszacza ekranu (Matrix)
      if (doc["screen_saver_enabled"].is<bool>()) {
        screenSaverEnabled = doc["screen_saver_enabled"].as<bool>();
      }
      if (doc.containsKey("screen_saver_timeout_min")) {
        int timeoutCandidate = screenSaverTimeoutMin;
        if (doc["screen_saver_timeout_min"].is<int>()) {
          timeoutCandidate = doc["screen_saver_timeout_min"].as<int>();
        } else if (doc["screen_saver_timeout_min"].is<long>()) {
          timeoutCandidate = (int)doc["screen_saver_timeout_min"].as<long>();
        } else if (doc["screen_saver_timeout_min"].is<float>() || doc["screen_saver_timeout_min"].is<double>()) {
          timeoutCandidate = (int)doc["screen_saver_timeout_min"].as<double>();
        } else if (doc["screen_saver_timeout_min"].is<String>()) {
          String timeoutStr = doc["screen_saver_timeout_min"].as<String>();
          timeoutStr.trim();
          timeoutCandidate = timeoutStr.toInt();
        }
        // Zastosuj limity bez wywoływania savePreferences()
        if (timeoutCandidate < 1) timeoutCandidate = 1;
        if (timeoutCandidate > 60) timeoutCandidate = 60;
        screenSaverTimeoutMin = timeoutCandidate;
      }

      // Port bywa null, jeśli w JS wyszedł NaN
      if (doc["cluster_port"].is<int>()) {
        clusterPort = doc["cluster_port"].as<int>();
      } else {
        clusterPort = DEFAULT_CLUSTER_PORT;
      }
      if (doc["pota_port"].is<int>()) {
        potaClusterPort = doc["pota_port"].as<int>();
      } else {
        potaClusterPort = DEFAULT_POTA_CLUSTER_PORT;
      }

      if (wifiSSID.length() == 0 && wifiSSID2.length() == 0) {
        server->send(400, "application/json", "{\"status\":\"error\",\"message\":\"empty_ssid\"}");
        return;
      }

      // Aktualizuj współrzędne z locatora TYLKO jeśli nie podano bezpośrednio współrzędnych
      // Priorytet: jeÄąâ€şli userLatLonValid == true (podano bezpoÄąâ€şrednio LAT/LON), nie nadpisuj z locatora
      if (!userLatLonValid && userLocator.length() >= 4) {
        updateUserLatLonFromLocator();
      }
      savePreferences();
      setBacklightPercent(backlightPercent);
      if (tftInitialized) {
        applyTftInversion();
      }
      
      server->send(200, "application/json", "{\"status\":\"ok\",\"action\":\"restart\"}");
      
      // W trybie AP (wifiConnected=false) bez restartu nigdy nie przejdziemy na STA.
      // Restart jest najpewniejszy i upraszcza flow.
      Serial.println("Zapisano konfiguracjĂ„â„˘. Restart za chwilĂ„â„˘...");
      requestRestart(1500);
    } else {
      server->send(400, "application/json", "{\"status\":\"error\"}");
    }
  });
  
  // API - resetuj kalibrację dotyku do wartości domyślnych
  server->on("/api/reset_touch", HTTP_POST, []() {
    touchXMin = TOUCH_X_MIN;
    touchXMax = TOUCH_X_MAX;
    touchYMin = TOUCH_Y_MIN;
    touchYMax = TOUCH_Y_MAX;
    touchSwapXY = TOUCH_SWAP_XY;
    touchInvertX = TOUCH_INVERT_X;
    touchInvertY = TOUCH_INVERT_Y;
    touchRotation = 1;
    applyTouchRotation();
    
    savePreferences();
    
    Serial.println("Touch calibration reset to defaults");
    server->send(200, "application/json", "{\"status\":\"ok\"}");
  });

  // API - resetuj rotację TFT do wartości domyślnych
  server->on("/api/reset_tft_rotation", HTTP_POST, []() {
    tftRotation = 1;
    applyTftRotation();
    savePreferences();

    Serial.println("TFT rotation reset to default");
    server->send(200, "application/json", "{\"status\":\"ok\",\"action\":\"restart\"}");
    requestRestart(1500);
  });
  
  // API - pobierz konfigurację
  server->on("/api/config", HTTP_GET, []() {
    StaticJsonDocument<4096> doc;
    doc["wifi_ssid"] = wifiSSID;
    doc["wifi_pass"] = wifiPassword;
    doc["wifi_ssid2"] = wifiSSID2;
    doc["wifi_pass2"] = wifiPassword2;
    doc["cluster_host"] = clusterHost;
    doc["cluster_port"] = clusterPort;
    doc["pota_host"] = potaClusterHost;
    doc["pota_port"] = potaClusterPort;
    doc["pota_filter"] = potaFilterCommand;
    doc["pota_api_url"] = potaApiUrl;
    doc["hamalert_host"] = hamalertHost;
    doc["hamalert_port"] = hamalertPort;
    doc["hamalert_login"] = hamalertLogin;
    doc["hamalert_password"] = hamalertPassword;
    doc["user_callsign"] = userCallsign;
    doc["user_locator"] = userLocator;
    doc["timezone"] = timezoneHours;
    doc["user_lat"] = userLat;
    doc["user_lon"] = userLon;
    doc["user_lat_lon_valid"] = userLatLonValid;
    doc["qrz_user"] = qrzUsername;
    doc["qrz_pass"] = qrzPassword;
    doc["weather_key"] = weatherApiKey;
    doc["openwebrx_url"] = openWebRxUrl;
    doc["tft_backlight"] = backlightPercent;
    doc["tft_invert"] = sanitizeTftInvertSetting(tftInvertColors);
    doc["tft_rotation"] = tftRotation;
    doc["tft_lang"] = tftLangToCode(tftLanguage);
    doc["table_size"] = dxTableSizeToCode(dxTableSizeMode);
    doc["tft_auto_switch"] = tftAutoSwitchEnabled;
    doc["tft_switch_time_sec"] = tftAutoSwitchTimeSec;
    doc["menu_hue"] = menuThemeHue;
    doc["qrz_status"] = qrzStatus;
    doc["cluster_noann"] = clusterNoAnnouncements;
    doc["cluster_nowwv"] = clusterNoWWV;
    doc["cluster_nowcy"] = clusterNoWCY;
    doc["cluster_usefilters"] = clusterUseFilters;
    doc["cluster_filters"] = clusterFilterCommands;
    doc["aprs_host"] = aprsIsHost;
    doc["aprs_port"] = aprsIsPort;
    doc["aprs_callsign"] = aprsCallsign;
    doc["aprs_passcode"] = aprsPasscode;
    doc["aprs_ssid"] = aprsSsid;
    doc["aprs_radius"] = aprsFilterRadius;
    doc["aprs_beacon"] = aprsBeaconEnabled;
    doc["aprs_symbol"] = aprsSymbolTwoChar;
    doc["aprs_comment"] = aprsUserComment;
    doc["aprs_alert"] = aprsAlertCsv;
    doc["aprs_alert_enabled"] = aprsAlertEnabled;
    doc["aprs_alert_nearby_enabled"] = aprsAlertNearbyEnabled;
    doc["aprs_alert_wx_enabled"] = aprsAlertWxEnabled;
    doc["aprs_alert_min_sec"] = aprsAlertMinSeconds;
    doc["aprs_alert_screen_sec"] = aprsAlertScreenSeconds;
    doc["aprs_alert_distance_km"] = aprsAlertDistanceKm;
    doc["enable_led_alert"] = enableLedAlert;
    doc["led_alert_duration_ms"] = ledAlertDurationMs;
    doc["led_alert_blink_ms"] = ledAlertBlinkMs;
    doc["aprs_interval_min"] = aprsIntervalMinutes;
    
    // Ustawienia wygaszacza ekranu (Matrix)
    doc["screen_saver_enabled"] = screenSaverEnabled;
    doc["screen_saver_timeout_min"] = screenSaverTimeoutMin;
    
