Tom50505050/esp32-ham-clock/src/main.cpp
    // Touch calibration mode - priorytet: pełna kombinacja > rotacje > swap > both > single invert
    String touchMode = "none";
    if (touchSwapXY && touchInvertX && touchInvertY) {
      touchMode = "xy_both";
    } else if (touchSwapXY && touchInvertX) {
      touchMode = "rot90cw";
    } else if (touchSwapXY && touchInvertY) {
      touchMode = "rot90ccw";
    } else if (touchSwapXY) {
      touchMode = "xy";
    } else if (touchInvertX && touchInvertY) {
      touchMode = "both";
    } else if (touchInvertX) {
      touchMode = "x";
    } else if (touchInvertY) {
      touchMode = "y";
    }
    doc["touch_swap_mode"] = touchMode;
    doc["touch_rotation"] = touchRotation;
    // Indywidualne parametry kalibracji dotyku
    doc["touch_xmin"] = touchXMin;
    doc["touch_xmax"] = touchXMax;
    doc["touch_ymin"] = touchYMin;
    doc["touch_ymax"] = touchYMax;
    doc["touch_swap"] = touchSwapXY;
    doc["touch_invx"] = touchInvertX;
    doc["touch_invy"] = touchInvertY;

    // Informacje systemowe
    doc["fw_version"] = FIRMWARE_VERSION;
    doc["uptime"] = formatUptime(millis() - bootTimeMs);
    doc["sys_ip"] = wifiConnected ? WiFi.localIP().toString() : (WiFi.getMode() & WIFI_AP ? WiFi.softAPIP().toString() : "disconnected");
    doc["sys_ssid"] = wifiConnected ? WiFi.SSID() : "";
    doc["sys_rssi"] = wifiConnected ? WiFi.RSSI() : 0;
    doc["sys_mac"] = WiFi.macAddress();
    doc["sys_heap"] = ESP.getFreeHeap();
    doc["sys_heap_max"] = ESP.getMaxAllocHeap();
    doc["sys_chip"] = ESP.getChipModel();
    doc["sys_cpu"] = ESP.getCpuFreqMHz();
    doc["sys_temp"] = temperatureRead();  // temperatura w °C
    #ifdef ENABLE_BATTERY_MONITORING
    doc["sys_vcc"] = readBatteryVoltage();  // napięcie baterii
    #else
    doc["sys_vcc"] = 0;
    #endif
    // LittleFS info
    if (littleFsReady) {
      doc["sys_littlefs_total"] = LittleFS.totalBytes();
      doc["sys_littlefs_free"] = LittleFS.totalBytes() - LittleFS.usedBytes();
    } else {
      doc["sys_littlefs_total"] = 0;
      doc["sys_littlefs_free"] = 0;
    }

    // Ustawienia PSKReporter
    doc["psk_receiver"] = pskReceiverCallsign;
    doc["psk_maxspots"] = pskMaxSpots;
    doc["psk_hours"] = pskHoursWindow;
    doc["psk_band"] = pskFilterBand;
    doc["psk_mode"] = pskFilterMode;
    doc["psk_url"] = pskCustomUrl;
    // HTTP Monitoring
    doc["psk_monitor_callsign"] = pskMonitorCallsign;
    doc["psk_report_days"] = pskReportDays;
    doc["psk_auto_refresh"] = pskAutoRefreshMinutes;

    JsonArray orderArr = doc.createNestedArray("screen_order");
    for (int i = 0; i < SCREEN_ORDER_COUNT; i++) {
      orderArr.add(screenTypeToCodeStr(screenOrder[i]));
    }
    
    
    String json;
    serializeJson(doc, json);
    server->send(200, "application/json", json);
  });
  
  server->begin();
  Serial.println("Serwer WWW uruchomiony");
}

// ========== HTML PAGES ==========

String getMainHTML() {
  return R"rawliteral(
<!DOCTYPE html>
<html lang="pl">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <title>ESP32 HAM CLOCK</title>
  <style>
    :root {
      --bg: #0f172a;
      --panel: #111827;
      --panel-2: #1f2937;
      --text: #e5e7eb;
      --muted: #94a3b8;
      --accent: #f59e0b;
      --good: #22c55e;
      --border: #334155;
    }
    * { box-sizing: border-box; }
    body {
      margin: 0;
      font-family: Arial, sans-serif;
      background: linear-gradient(180deg, #020617 0%, var(--bg) 100%);
      color: var(--text);
    }
    .wrap {
      max-width: 1080px;
      margin: 0 auto;
      padding: 20px;
    }
    .hero, .panel {
      background: rgba(17,24,39,0.92);
      border: 1px solid var(--border);
      border-radius: 16px;
      padding: 18px;
      margin-bottom: 16px;
      box-shadow: 0 12px 28px rgba(0,0,0,0.24);
    }
    h1, h2 {
      margin: 0 0 12px 0;
    }
    p {
      color: var(--muted);
      margin: 0;
    }
    .row {
      display: grid;
      grid-template-columns: repeat(auto-fit, minmax(220px, 1fr));
      gap: 12px;
      margin-top: 16px;
    }
    .card {
      background: var(--panel-2);
      border: 1px solid var(--border);
      border-radius: 12px;
      padding: 14px;
    }
    .label {
      font-size: 12px;
      text-transform: uppercase;
      letter-spacing: 0.08em;
      color: var(--muted);
      margin-bottom: 6px;
    }
    .value {
      font-size: 20px;
      font-weight: 700;
      word-break: break-word;
    }
    .toolbar {
      display: flex;
      gap: 10px;
      flex-wrap: wrap;
      margin-top: 16px;
    }
    button, a.btn {
      background: var(--accent);
      color: #111827;
      border: none;
      border-radius: 999px;
      padding: 10px 14px;
      font-weight: 700;
      cursor: pointer;
      text-decoration: none;
      display: inline-block;
    }
    button.secondary {
      background: transparent;
      color: var(--text);
      border: 1px solid var(--border);
    }
    input, select {
      width: 100%;
      background: #020617;
      color: var(--text);
      border: 1px solid var(--border);
      border-radius: 10px;
      padding: 10px 12px;
      font-size: 14px;
    }
    .field {
      display: flex;
      flex-direction: column;
      gap: 6px;
    }
    .field label {
      color: var(--muted);
      font-size: 12px;
      text-transform: uppercase;
      letter-spacing: 0.08em;
    }
    .check {
      display: flex;
      align-items: center;
      gap: 10px;
      padding: 10px 12px;
      background: var(--panel-2);
      border: 1px solid var(--border);
      border-radius: 10px;
    }
    .check input {
      width: auto;
      transform: scale(1.2);
    }
    .sectionTitle {
      margin: 18px 0 10px 0;
      font-size: 15px;
      font-weight: 700;
    }
    details {
      margin-top: 16px;
      border: 1px solid var(--border);
      border-radius: 12px;
      padding: 12px;
      background: rgba(2,6,23,0.55);
    }
    summary {
      cursor: pointer;
      font-weight: 700;
    }
    textarea {
      width: 100%;
      min-height: 320px;
      background: #020617;
      color: var(--text);
      border: 1px solid var(--border);
      border-radius: 12px;
      padding: 12px;
      font-family: Consolas, monospace;
      font-size: 13px;
      resize: vertical;
    }
    table {
      width: 100%;
      border-collapse: collapse;
      margin-top: 12px;
    }
    th, td {
      padding: 10px 8px;
      border-bottom: 1px solid var(--border);
      text-align: left;
      font-size: 14px;
    }
    th {
      color: var(--muted);
      font-weight: 600;
    }
    .ok {
      color: var(--good);
      font-weight: 700;
    }
    .hint {
      margin-top: 10px;
      font-size: 13px;
      color: var(--muted);
    }
    @media (max-width: 640px) {
      .wrap { padding: 12px; }
      .value { font-size: 18px; }
      th, td { font-size: 13px; }
    }
  </style>
</head>
<body>
  <div class="wrap">
    <section class="hero">
      <h1>ESP32 HAM CLOCK</h1>
      <p>Wbudowany panel WWW. LittleFS nie ma index.html, ale urzadzenie dalej dziala i mozna korzystac z API oraz podstawowego podgladu.</p>
      <div class="toolbar">
        <button onclick="loadAll()" style="color:#ff0000;">Odswiez</button>
        <a class="btn" href="/api/config" style="color:#ff0000;">API config</a>
        <a class="btn" href="/api/spots" style="color:#ff0000;">API spots</a>
        <a class="btn" href="/api/psk" style="color:#ff0000;">PSKReporter</a>
        <a class="btn" href="/instruction" style="background:#28a745;color:#ff0000;">📖 Instrukcja</a>
      </div>
    </section>

    <section class="panel">
      <h2>Status</h2>
      <div class="row">
        <div class="card">
          <div class="label">WiFi SSID</div>
          <div id="ssid" class="value">-</div>
        </div>
        <div class="card">
          <div class="label">Callsign</div>
          <div id="callsign" class="value">-</div>
        </div>
        <div class="card">
          <div class="label">APRS Host</div>
          <div id="aprs" class="value">-</div>
        </div>
        <div class="card">
          <div class="label">Cluster Filter</div>
          <div id="filter" class="value">-</div>
        </div>
      </div>
      <div class="hint">Jesli chcesz pelny frontend z LittleFS, mozna go dodac pozniej. Ten ekran jest awaryjnym panelem wbudowanym w firmware.</div>
    </section>

    <section class="panel">
      <h2>System</h2>
      <div class="row">
        <div class="card">
          <div class="label">Autor</div>
          <div class="value">SP3KON (oryginał)</div>
        </div>
        <div class="card">
          <div class="label">Modyfikacje</div>
          <div class="value">SP9TNV</div>
        </div>
        <div class="card">
          <div class="label">Wersja</div>
          <div class="value">1.2b</div>
        </div>
        <div class="card">
          <div class="label">Licencja</div>
          <div class="value">MIT License</div>
        </div>
      </div>
      <div class="hint">
        Projekt objęty licencją MIT. Możesz używać, modyfikować i rozpowszechniać kod pod warunkiem zachowania informacji o autorze oryginalnym (SP3KON).
      </div>
    </section>

    <section class="panel">
      <h2>Ostatnie spoty</h2>
      <div id="spotsState" class="hint">Ladowanie...</div>
      <table>
        <thead>
          <tr>
            <th>Czas</th>
            <th>Call</th>
            <th>Freq</th>
            <th>Mode</th>
            <th>Kraj</th>
          </tr>
        </thead>
        <tbody id="spotsBody"></tbody>
      </table>
    </section>

    <section class="panel">
      <h2>Konfiguracja</h2>
      <p>Graficzny formularz dla najwazniejszych ustawien. JSON zostal nizej jako tryb zaawansowany.</p>
      <div class="toolbar">
        <button onclick="saveGraphicConfig()">Zapisz konfiguracje</button>
        <button class="secondary" onclick="syncJsonFromForm()">Przepisz do JSON</button>
      </div>
      <div id="saveState" class="hint">Najpierw kliknij Odswiez albo poczekaj na zaladowanie konfiguracji.</div>

      <div class="sectionTitle">WiFi i operator</div>
      <div class="row">
        <div class="field">
          <label for="wifi_ssid">WiFi SSID</label>
          <input id="wifi_ssid" type="text">
        </div>
        <div class="field">
          <label for="wifi_pass">WiFi haslo</label>
          <input id="wifi_pass" type="password">
        </div>
        <div class="field">
          <label for="user_callsign">Twoj znak</label>
          <input id="user_callsign" type="text">
        </div>
        <div class="field">
          <label for="user_locator">Locator</label>
          <input id="user_locator" type="text">
        </div>
        <div class="field">
          <label for="timezone">Strefa czasowa</label>
          <input id="timezone" type="number" min="-12" max="14" step="1">
        </div>
        <div class="field">
          <label for="openwebrx_url">OpenWebRX URL</label>
          <input id="openwebrx_url" type="text">
        </div>
      </div>

      <div class="sectionTitle">DX / POTA / HamAlert</div>
      <div class="row">
        <div class="field">
          <label for="cluster_host">DX cluster host</label>
          <input id="cluster_host" type="text">
        </div>
        <div class="field">
          <label for="cluster_port">DX cluster port</label>
          <input id="cluster_port" type="number">
        </div>
        <div class="field">
          <label for="pota_api_url">POTA API URL</label>
          <input id="pota_api_url" type="text">
        </div>
        <div class="field">
          <label for="hamalert_host">HamAlert host</label>
          <input id="hamalert_host" type="text">
        </div>
        <div class="field">
          <label for="hamalert_login">HamAlert login</label>
          <input id="hamalert_login" type="text">
        </div>
        <div class="field">
          <label for="hamalert_password">HamAlert haslo</label>
          <input id="hamalert_password" type="password">
        </div>
      </div>

