Tom50505050/esp32-ham-clock/src/main.cpp
      <div class="sectionTitle">APRS</div>
      <div class="row">
        <div class="field">
          <label for="aprs_host">APRS host</label>
          <input id="aprs_host" type="text">
        </div>
        <div class="field">
          <label for="aprs_port">APRS port</label>
          <input id="aprs_port" type="number">
        </div>
        <div class="field">
          <label for="aprs_callsign">APRS callsign</label>
          <input id="aprs_callsign" type="text">
        </div>
        <div class="field">
          <label for="aprs_passcode">APRS passcode</label>
          <input id="aprs_passcode" type="number">
        </div>
        <div class="field">
          <label for="aprs_ssid">APRS SSID</label>
          <input id="aprs_ssid" type="number">
        </div>
        <div class="field">
          <label for="aprs_radius">APRS radius km</label>
          <input id="aprs_radius" type="number">
        </div>
        <div class="field">
          <label for="aprs_symbol">APRS symbol</label>
          <input id="aprs_symbol" type="text">
        </div>
        <div class="field">
          <label for="aprs_comment">APRS komentarz</label>
          <input id="aprs_comment" type="text">
        </div>
      </div>
      <div class="row">
        <label class="check"><input id="aprs_beacon" type="checkbox"> Beacon APRS wlaczony</label>
        <label class="check"><input id="aprs_alert_enabled" type="checkbox"> Alerty APRS wlaczone</label>
        <label class="check"><input id="aprs_alert_nearby_enabled" type="checkbox"> Alerty nearby</label>
        <label class="check"><input id="aprs_alert_wx_enabled" type="checkbox"> Alerty WX</label>
      </div>

      <div class="sectionTitle">Ekran i filtry</div>
      <div class="row">
        <div class="field">
          <label for="tft_backlight">Podswietlenie TFT</label>
          <input id="tft_backlight" type="number" min="10" max="100">
        </div>
        <div class="field">
          <label for="tft_rotation">Rotacja TFT</label>
          <select id="tft_rotation">
            <option value="0">0</option>
            <option value="1">1</option>
            <option value="2">2</option>
            <option value="3">3</option>
          </select>
        </div>
        <div class="field">
          <label for="tft_lang">Jezyk TFT</label>
          <select id="tft_lang">
            <option value="pl">pl</option>
            <option value="en">en</option>
          </select>
        </div>
        <div class="field">
          <label for="cluster_filters">Filtry cluster</label>
          <input id="cluster_filters" type="text">
        </div>
      </div>
      <div class="row">
        <label class="check"><input id="tft_invert" type="checkbox"> Odwrocone kolory TFT</label>
        <label class="check"><input id="cluster_usefilters" type="checkbox"> Uzyj filtrow cluster</label>
        <label class="check"><input id="cluster_noann" type="checkbox"> Ukryj ANN</label>
        <label class="check"><input id="cluster_nowwv" type="checkbox"> Ukryj WWV</label>
        <label class="check"><input id="cluster_nowcy" type="checkbox"> Ukryj WCY</label>
      </div>

      <details>
        <summary>Zaawansowany JSON</summary>
        <div class="hint">Mozesz nadal edytowac pelny JSON recznie, jesli chcesz zmienic pola nieobecne w formularzu.</div>
        <div class="toolbar">
          <button onclick="saveConfig()">Zapisz JSON</button>
        </div>
        <textarea id="configEditor" spellcheck="false"></textarea>
      </details>
    </section>
  </div>

  <script>
    let currentConfig = {};

    function byId(id) {
      return document.getElementById(id);
    }

    function setValue(id, value) {
      byId(id).value = value ?? '';
    }

    function setChecked(id, value) {
      byId(id).checked = !!value;
    }

    function getInt(id, fallback) {
      const value = parseInt(byId(id).value, 10);
      return Number.isNaN(value) ? fallback : value;
    }

    function getString(id, fallback = '') {
      const value = byId(id).value;
      return value == null ? fallback : value;
    }

    function fillGraphicForm(cfg) {
      setValue('wifi_ssid', cfg.wifi_ssid);
      setValue('wifi_pass', cfg.wifi_pass);
      setValue('user_callsign', cfg.user_callsign);
      setValue('user_locator', cfg.user_locator);
      setValue('timezone', cfg.timezone);
      setValue('openwebrx_url', cfg.openwebrx_url);
      setValue('cluster_host', cfg.cluster_host);
      setValue('cluster_port', cfg.cluster_port);
      setValue('pota_api_url', cfg.pota_api_url);
      setValue('hamalert_host', cfg.hamalert_host);
      setValue('hamalert_login', cfg.hamalert_login);
      setValue('hamalert_password', cfg.hamalert_password);
      setValue('aprs_host', cfg.aprs_host);
      setValue('aprs_port', cfg.aprs_port);
      setValue('aprs_callsign', cfg.aprs_callsign);
      setValue('aprs_passcode', cfg.aprs_passcode);
      setValue('aprs_ssid', cfg.aprs_ssid);
      setValue('aprs_radius', cfg.aprs_radius);
      setValue('aprs_symbol', cfg.aprs_symbol);
      setValue('aprs_comment', cfg.aprs_comment);
      setValue('tft_backlight', cfg.tft_backlight);
      setValue('tft_rotation', cfg.tft_rotation);
      setValue('tft_lang', cfg.tft_lang);
      setValue('cluster_filters', cfg.cluster_filters);
      setChecked('aprs_beacon', cfg.aprs_beacon);
      setChecked('aprs_alert_enabled', cfg.aprs_alert_enabled);
      setChecked('aprs_alert_nearby_enabled', cfg.aprs_alert_nearby_enabled);
      setChecked('aprs_alert_wx_enabled', cfg.aprs_alert_wx_enabled);
      setChecked('tft_invert', cfg.tft_invert);
      setChecked('cluster_usefilters', cfg.cluster_usefilters);
      setChecked('cluster_noann', cfg.cluster_noann);
      setChecked('cluster_nowwv', cfg.cluster_nowwv);
      setChecked('cluster_nowcy', cfg.cluster_nowcy);
    }

    function buildConfigFromForm() {
      return {
        ...currentConfig,
        wifi_ssid: getString('wifi_ssid'),
        wifi_pass: getString('wifi_pass'),
        user_callsign: getString('user_callsign'),
        user_locator: getString('user_locator'),
        timezone: getInt('timezone', currentConfig.timezone ?? 0),
        openwebrx_url: getString('openwebrx_url'),
        cluster_host: getString('cluster_host'),
        cluster_port: getInt('cluster_port', currentConfig.cluster_port ?? 7300),
        pota_api_url: getString('pota_api_url'),
        hamalert_host: getString('hamalert_host'),
        hamalert_login: getString('hamalert_login'),
        hamalert_password: getString('hamalert_password'),
        aprs_host: getString('aprs_host'),
        aprs_port: getInt('aprs_port', currentConfig.aprs_port ?? 14580),
        aprs_callsign: getString('aprs_callsign'),
        aprs_passcode: getInt('aprs_passcode', currentConfig.aprs_passcode ?? 0),
        aprs_ssid: getInt('aprs_ssid', currentConfig.aprs_ssid ?? 0),
        aprs_radius: getInt('aprs_radius', currentConfig.aprs_radius ?? 50),
        aprs_symbol: getString('aprs_symbol', '/-'),
        aprs_comment: getString('aprs_comment'),
        aprs_beacon: byId('aprs_beacon').checked,
        aprs_alert_enabled: byId('aprs_alert_enabled').checked,
        aprs_alert_nearby_enabled: byId('aprs_alert_nearby_enabled').checked,
        aprs_alert_wx_enabled: byId('aprs_alert_wx_enabled').checked,
        tft_backlight: getInt('tft_backlight', currentConfig.tft_backlight ?? 100),
        tft_rotation: getInt('tft_rotation', currentConfig.tft_rotation ?? 1),
        tft_lang: getString('tft_lang', 'pl'),
        tft_invert: byId('tft_invert').checked,
        cluster_filters: getString('cluster_filters'),
        cluster_usefilters: byId('cluster_usefilters').checked,
        cluster_noann: byId('cluster_noann').checked,
        cluster_nowwv: byId('cluster_nowwv').checked,
        cluster_nowcy: byId('cluster_nowcy').checked
      };
    }

    async function loadConfig() {
      const res = await fetch('/api/config');
      const cfg = await res.json();
      currentConfig = cfg;
      document.getElementById('ssid').textContent = cfg.wifi_ssid || '-';
      document.getElementById('callsign').textContent = cfg.aprs_callsign || '-';
      document.getElementById('aprs').textContent = (cfg.aprs_host || '-') + ':' + (cfg.aprs_port || '-');
      document.getElementById('filter').textContent = cfg.cluster_filters || '(brak)';
      fillGraphicForm(cfg);
      document.getElementById('configEditor').value = JSON.stringify(cfg, null, 2);
      document.getElementById('saveState').textContent = 'Konfiguracja zaladowana. Mozesz ja edytowac i zapisac.';
    }

    function formatTimeToLocal(timeStr) {
      if (!timeStr || timeStr === '-') return '-';
      // Parsuj czas HH:MM lub HH:MM:SS
      const match = timeStr.match(/(\d{1,2}):(\d{2})(?::\d{2})?/);
      if (!match) return timeStr;
      
