Tom50505050/esp32-ham-clock/src/main.cpp
      let hour = parseInt(match[1], 10);
      const minute = match[2];
      
      // Pobierz offset strefy czasowej z konfiguracji
      const tzOffset = currentConfig.timezone || 1;
      
      // Dodaj offset (prost konwersja, bez DST)
      let localHour = hour + tzOffset;
      
      // Obsługa przejścia przez północ
      if (localHour < 0) localHour += 24;
      else if (localHour >= 24) localHour -= 24;
      
      return (localHour < 10 ? '0' : '') + localHour + ':' + minute;
    }

    async function loadSpots() {
      const res = await fetch('/api/spots');
      const data = await res.json();
      const spots = Array.isArray(data) ? data : (Array.isArray(data.spots) ? data.spots : []);
      const body = document.getElementById('spotsBody');
      const state = document.getElementById('spotsState');
      body.innerHTML = '';

      if (!Array.isArray(spots) || spots.length === 0) {
        state.textContent = 'Brak spotow.';
        return;
      }

      state.innerHTML = '<span class="ok">OK</span> Zaladowano ' + spots.length + ' rekordow.';
      spots.slice(0, 20).forEach((spot) => {
        const tr = document.createElement('tr');
        tr.innerHTML =
          '<td>' + formatTimeToLocal(spot.time || '-') + '</td>' +
          '<td>' + (spot.callsign || '-') + '</td>' +
          '<td>' + (spot.frequency || '-') + '</td>' +
          '<td>' + (spot.mode || '-') + '</td>' +
          '<td>' + (spot.country || '-') + '</td>';
        body.appendChild(tr);
      });
    }

    async function loadAll() {
      try {
        await loadConfig();
        await loadSpots();
      } catch (err) {
        document.getElementById('spotsState').textContent = 'Blad odczytu API: ' + err;
      }
    }

    function syncJsonFromForm() {
      const payload = buildConfigFromForm();
      byId('configEditor').value = JSON.stringify(payload, null, 2);
      byId('saveState').textContent = 'JSON zaktualizowany na podstawie formularza.';
    }

    async function saveConfig() {
      const editor = document.getElementById('configEditor');
      const saveState = document.getElementById('saveState');
      let parsed;

      try {
        parsed = JSON.parse(editor.value);
      } catch (err) {
        saveState.textContent = 'Blad JSON: ' + err;
        return;
      }

      saveState.textContent = 'Zapisywanie...';

      try {
        const res = await fetch('/api/save', {
          method: 'POST',
          headers: { 'Content-Type': 'application/json' },
          body: JSON.stringify(parsed)
        });
        const text = await res.text();
        saveState.textContent = 'Zapisano. Odpowiedz: ' + text;
        await loadConfig();
      } catch (err) {
        saveState.textContent = 'Blad zapisu: ' + err;
      }
    }

    async function saveGraphicConfig() {
      byId('configEditor').value = JSON.stringify(buildConfigFromForm(), null, 2);
      await saveConfig();
    }

    loadAll();
  </script>
</body>
</html>
)rawliteral";
}
String getConfigHTML() {
  return getMainHTML(); // UÄąÄ˝ywa tego samego HTML z JavaScript
}

#ifdef ENABLE_TFT_DISPLAY
TaskHandle_t uiTaskHandle = nullptr;

void uiTaskLoop(void *parameter) {
  (void)parameter;
  for (;;) {
    unsigned long now = millis();

    if (tftInitialized) {
      bool pendingScreen1 = false;
      bool pendingScreen2 = false;
      bool pendingScreen6 = false;
      bool pendingScreen7 = false;
      bool pendingAnyScreen = false;
      uint8_t pendingAnyScreenId = SCREEN_HAM_CLOCK;
      portENTER_CRITICAL(&uiPendingRedrawMux);
      pendingScreen1 = uiPendingScreen1Redraw;
      pendingScreen2 = uiPendingScreen2Redraw;
      pendingScreen6 = uiPendingScreen6Redraw;
      pendingScreen7 = uiPendingScreen7Redraw;
      pendingAnyScreen = uiPendingAnyScreenRedraw;
      pendingAnyScreenId = uiPendingAnyScreenId;
      uiPendingScreen1Redraw = false;
      uiPendingScreen2Redraw = false;
      uiPendingScreen6Redraw = false;
      uiPendingScreen7Redraw = false;
      uiPendingAnyScreenRedraw = false;
      portEXIT_CRITICAL(&uiPendingRedrawMux);

      if (pendingAnyScreen && currentScreen == (ScreenType)pendingAnyScreenId && !inMenu && !aprsAlertScreenActive && !qrzPopupActive) {
        drawScreen((ScreenType)pendingAnyScreenId);
      }

      // Dodatkowe sprawdzenia dla konkretnych ekranów tylko gdy pendingAnyScreen nie było true
      if (!pendingAnyScreen) {
        if (pendingScreen1 && currentScreen == SCREEN_HAM_CLOCK && !inMenu && !aprsAlertScreenActive) {
          drawScreen(SCREEN_HAM_CLOCK);
        }
        if (pendingScreen2 && currentScreen == SCREEN_DX_CLUSTER && !inMenu && !aprsAlertScreenActive && !qrzPopupActive) {
          drawScreen(SCREEN_DX_CLUSTER);
        }
        if (pendingScreen7 && currentScreen == SCREEN_POTA_CLUSTER && !inMenu && !aprsAlertScreenActive && !qrzPopupActive) {
          drawScreen(SCREEN_POTA_CLUSTER);
        }
        if (pendingScreen6 && (currentScreen == SCREEN_APRS_IS || currentScreen == SCREEN_APRS_RADAR) && !inMenu && !aprsAlertScreenActive && !qrzPopupActive) {
          drawScreen(currentScreen);
        }
      }

      if (aprsAlertDrawPending) {
        APRSStation pendingStation;
        portENTER_CRITICAL(&aprsAlertPendingMux);
        pendingStation = aprsAlertPendingStation;
        aprsAlertDrawPending = false;
        portEXIT_CRITICAL(&aprsAlertPendingMux);
        ALERT_Screen(pendingStation);
      }
      updateAlertScreenTimeout();
      handleTouchNavigation();
      
      // Rysuj wygaszacz gdy jest aktywny
      if (screenSaverActive && !screenSaverMenuActive) {
        drawScreenSaver();
      }
    }

    // Sprawdzanie wygaszacza ekranu - co sekundę
    static unsigned long lastScreenSaverCheckMs = 0;
    if (now - lastScreenSaverCheckMs >= 1000) {
      checkScreenSaverTimeout();
      lastScreenSaverCheckMs = now;
    }

    if (tftAutoSwitchEnabled && tftInitialized && !inMenu && !aprsAlertScreenActive && !touchCalActive && !brightnessMenuActive && !qrzPopupActive) {
      unsigned long nowSwitch = millis();
      if (tftAutoSwitchLastMs == 0 || tftAutoSwitchLastScreen != currentScreen) {
        tftAutoSwitchLastMs = nowSwitch;
        tftAutoSwitchLastScreen = currentScreen;
      } else {
        unsigned long intervalMs = (unsigned long)tftAutoSwitchTimeSec * 1000UL;
        if (intervalMs > 0 && (nowSwitch - tftAutoSwitchLastMs) >= intervalMs) {
          ScreenType nextScreen = getNextScreenId(currentScreen);
          if (nextScreen != SCREEN_OFF && nextScreen != currentScreen) {
            currentScreen = nextScreen;
            drawScreen(currentScreen);
          }
          tftAutoSwitchLastMs = nowSwitch;
          tftAutoSwitchLastScreen = currentScreen;
        }
      }
    }

    if (!restartRequested) {
      if (tftInitialized && currentScreen == SCREEN_HAM_CLOCK && !inMenu && !aprsAlertScreenActive) {
        if (now - lastScreen1UpdateMs > 1000) {
          updateScreen1Clock();
          updateScreen1HeaderClock();
          lastScreen1UpdateMs = now;
        }
        updateScreen1Header();
        updateScreen1Date();
      }

      if (tftInitialized && currentScreen == SCREEN_DX_CLUSTER && !inMenu && !aprsAlertScreenActive && !qrzPopupActive) {
        if (now - lastScreenUpdate > 100) {
          updateScreen2Data();
          lastScreenUpdate = now;
        }
        // Aktualizacja zegara co sekundę - WYŁĄCZONA
        // static unsigned long lastDxClockUpdate = 0;
        // if (now - lastDxClockUpdate >= 1000) {
        //   updateDxClusterClock();
        //   lastDxClockUpdate = now;
        // }
      }

