Tom50505050/esp32-ham-clock/src/main.cpp
      if (tftInitialized && currentScreen == SCREEN_POTA_CLUSTER && !inMenu && !aprsAlertScreenActive && !qrzPopupActive) {
        if (now - lastScreen7UpdateMs > 200) {
          updateScreen7Data();
          lastScreen7UpdateMs = now;
        }
        // Aktualizacja zegara co sekundę
        static unsigned long lastPotaClockUpdate = 0;
        if (now - lastPotaClockUpdate >= 1000) {
          updatePotaClusterClock();
          lastPotaClockUpdate = now;
        }
      }

      if (tftInitialized && currentScreen == SCREEN_HAMALERT_CLUSTER && !inMenu && !aprsAlertScreenActive && !qrzPopupActive) {
        if (now - lastScreen8UpdateMs > 200) {
          updateScreen8Data();
          lastScreen8UpdateMs = now;
        }
        // Aktualizacja zegara co sekundę
        static unsigned long lastHamalertClockUpdate = 0;
        if (now - lastHamalertClockUpdate >= 1000) {
          updateHamalertClock();
          lastHamalertClockUpdate = now;
        }
      }

      if (tftInitialized && (currentScreen == SCREEN_APRS_IS || currentScreen == SCREEN_APRS_RADAR) && !inMenu && !aprsAlertScreenActive) {
        if (now - lastScreenUpdate > 100) {
          updateScreen6Data();
          lastScreenUpdate = now;
        }
      }

      if (tftInitialized && currentScreen == SCREEN_SUN_SPOTS && !inMenu && !aprsAlertScreenActive) {
        if (now - lastScreen3UpdateMs > 1000) {
          updateScreen3Data();
          lastScreen3UpdateMs = now;
        }
      }

      if (tftInitialized && currentScreen == SCREEN_BAND_INFO && !inMenu && !aprsAlertScreenActive) {
        if (now - lastScreen4UpdateMs > 1000) {
          updateScreen4Data();
          lastScreen4UpdateMs = now;
        }
        // Aktualizacja zegara co sekundę
        static unsigned long lastBandInfoClockUpdate = 0;
        if (now - lastBandInfoClockUpdate >= 1000) {
          updateBandInfoClock();
          lastBandInfoClockUpdate = now;
        }
      }

      if (tftInitialized &&
          (currentScreen == SCREEN_WEATHER_DSP || currentScreen == SCREEN_WEATHER_FORECAST) &&
          !inMenu && !aprsAlertScreenActive) {
        if (now - lastScreen5UpdateMs > 1000) {
          updateScreen5Data();
          lastScreen5UpdateMs = now;
        }
        // Aktualizacja zegara co sekundę
        static unsigned long lastWeatherClockUpdate = 0;
        if (now - lastWeatherClockUpdate >= 1000) {
          if (currentScreen == SCREEN_WEATHER_DSP) {
            updateWeatherClock();
          } else {
            updateWeatherForecastClock();
          }
          lastWeatherClockUpdate = now;
        }
      }

      if (tftInitialized && currentScreen == SCREEN_MATRIX_CLOCK && !inMenu && !aprsAlertScreenActive) {
        updateScreen10();
      }

      if (tftInitialized && currentScreen == SCREEN_UNLIS_HUNTER && !inMenu && !aprsAlertScreenActive) {
        updateUnlisHunter();
      }
    }

    vTaskDelay(pdMS_TO_TICKS(10));
  }
}
#endif

// ========== FUNKCJE PSK REPORTER MAP ==========

// Konwersja współrzędnych geograficznych na piksele ekranu
static void latLonToScreen(float lat, float lon, int &x, int &y) {
  // Mapa: MAP_LAT_MIN do MAP_LAT_MAX -> MAP_DISPLAY_Y do MAP_DISPLAY_Y + MAP_DISPLAY_H
  x = MAP_DISPLAY_X + (int)((lon - MAP_LON_MIN) / (MAP_LON_MAX - MAP_LON_MIN) * MAP_DISPLAY_W);
  y = MAP_DISPLAY_Y + (int)((MAP_LAT_MAX - lat) / (MAP_LAT_MAX - MAP_LAT_MIN) * MAP_DISPLAY_H);
}

// Pobieranie danych z PSK Reporter
bool fetchPskReporterData() {
  if (!wifiConnected) return false;

  HTTPClient http;
  // Użyj własnego URL jeśli ustawiony, w przeciwnym razie domyślny
  String baseUrl = pskCustomUrl.length() > 0 ? pskCustomUrl : "https://retrieve.pskreporter.info/query?";
  String url = baseUrl;
  // Upewnij się że URL kończy się ? lub &
  if (!url.endsWith("?") && !url.endsWith("&")) {
    url += url.indexOf("?") >= 0 ? "&" : "?";
  }
  // Użyj konfigurowalnego okna czasowego (w godzinach) lub raportu z dni wstecz
  int secondsWindow;
  if (pskReportDays > 0) {
    // Raport od X dni wstecz
    secondsWindow = pskReportDays * 24 * 3600;
  } else {
    // Standardowe okno czasowe w godzinach
    secondsWindow = pskHoursWindow * 3600;
  }
  url += "flowStartSeconds=-" + String(secondsWindow) + "&";
  url += "maxrows=" + String(pskMaxSpots) + "&";
  // Opcjonalnie dodaj filtr znaku odbiornika
  if (pskReceiverCallsign.length() > 0) {
    url += "receiverCallsign=" + pskReceiverCallsign + "&";
  }
  // Opcjonalnie dodaj filtr znaku nadawcy (monitorowanie)
  if (pskMonitorCallsign.length() > 0) {
    url += "transmitterCallsign=" + pskMonitorCallsign + "&";
  }
  url += "frags=1&";
  url += "json=1";

  Serial.print("[PSK] URL: ");
  Serial.println(url);

  http.setTimeout(10000);
  http.begin(url);
  int httpCode = http.GET();

  if (httpCode != 200) {
    Serial.print("[PSK] HTTP error: ");
    Serial.println(httpCode);
    http.end();
    return false;
  }

  String payload = http.getString();
  http.end();

  DynamicJsonDocument doc(8192);
  DeserializationError error = deserializeJson(doc, payload);

  if (error) {
    Serial.print("[PSK] JSON parse error: ");
    Serial.println(error.c_str());
    return false;
  }

  pskSpotCount = 0;

  JsonArray reports = doc["receptions"].as<JsonArray>();
  if (reports.isNull()) {
    reports = doc["rx"].as<JsonArray>();
  }

  if (!reports.isNull()) {
    for (JsonObject report : reports) {
      if (pskSpotCount >= PSK_MAX_SPOTS) break;

      const char* callsign = report["callsign"];
      const char* locator = report["locator"];
      const char* mode = report["mode"];
      int snr = report["snr"] | 0;
      int frequency = report["frequency"] | 0;

      if (callsign && locator) {
        // Określ pasmo z częstotliwości
        int freq_khz = frequency / 1000;
        int band = 0;
        if (freq_khz >= 3500 && freq_khz <= 4000) band = 80;
        else if (freq_khz >= 7000 && freq_khz <= 7300) band = 40;
        else if (freq_khz >= 14000 && freq_khz <= 14350) band = 20;
        else if (freq_khz >= 21000 && freq_khz <= 21450) band = 15;
        else if (freq_khz >= 28000 && freq_khz <= 29700) band = 10;
        else if (freq_khz >= 50000 && freq_khz <= 54000) band = 6;

        // Filtruj po pasmie jeśli ustawiony
        if (pskFilterBand.length() > 0) {
          int filterBand = pskFilterBand.toInt();
          if (band != filterBand) continue; // Pomiń ten spot
        }

        // Filtruj po trybie jeśli ustawiony
        String modeStr = mode ? String(mode) : String("FT8");
        if (pskFilterMode.length() > 0) {
          if (!modeStr.equalsIgnoreCase(pskFilterMode)) continue; // Pomiń ten spot
        }

        double lat, lon;
        locatorToLatLon(String(locator), lat, lon);

