Tom50505050/esp32-ham-clock/src/main.cpp
        pskSpots[pskSpotCount].callsign = String(callsign);
        pskSpots[pskSpotCount].lat = (float)lat;
        pskSpots[pskSpotCount].lon = (float)lon;
        pskSpots[pskSpotCount].mode = modeStr;
        pskSpots[pskSpotCount].snr = snr;
        pskSpots[pskSpotCount].timestamp = millis();
        pskSpots[pskSpotCount].band = band;

        pskSpotCount++;
      }
    }
  }

  Serial.print("[PSK] Pobrano ");
  Serial.print(pskSpotCount);
  Serial.println(" spotów");

  return pskSpotCount > 0;
}

// Kolory dla pasm
static uint16_t getPskBandColor(int band) {
  switch (band) {
    case 80: return TFT_RED;
    case 40: return TFT_ORANGE;
    case 20: return TFT_GREEN;
    case 15: return TFT_CYAN;
    case 10: return TFT_BLUE;
    case 6:  return TFT_MAGENTA;
    default: return TFT_WHITE;
  }
}

// Rysowanie nagłówka
static void drawPskMapHeader() {
  tft.fillRect(0, 0, 480, 30, TFT_RADIO_ORANGE);
  tft.setTextSize(2);
  tft.setTextColor(TFT_BLACK);
  // Wyśrodkuj napis (szerokość ekranu 480, tekst ~170px, środek ~155)
  tft.setCursor(155, 8);
  tft.print("PSK Reporter Map");
  tft.setTextSize(1);
  tft.setCursor(350, 8);
  tft.print("Spots: ");
  tft.print(pskSpotCount);
  time_t now;
  time(&now);
  struct tm *timeinfo = localtime(&now);
  char timeBuffer[9];
  sprintf(timeBuffer, "%02d:%02d:%02d", timeinfo->tm_hour, timeinfo->tm_min, timeinfo->tm_sec);
  tft.setCursor(440, 8);
  tft.print(timeBuffer);
}

// Rysowanie przycisku menu w lewym górnym rogu
static void drawPskMenuButton() {
  // Przycisk menu 30x26 w lewym górnym rogu (pomarańczowy jak nagłówek)
  tft.fillRect(2, 2, 30, 26, TFT_RADIO_ORANGE);
  tft.drawRect(2, 2, 30, 26, TFT_BLACK);
  // Trzy poziome kreski (hamburger menu)
  tft.fillRect(6, 8, 22, 3, TFT_BLACK);
  tft.fillRect(6, 13, 22, 3, TFT_BLACK);
  tft.fillRect(6, 18, 22, 3, TFT_BLACK);
}

// Rysowanie klawiatury ekranowej
static void drawPskKeyboard() {
  // Tło klawiatury
  tft.fillRect(30, 140, 420, 170, 0x18E3);
  tft.drawRect(30, 140, 420, 170, TFT_WHITE);
  
  // Wyświetl bufor
  tft.fillRect(40, 145, 300, 25, TFT_BLACK);
  tft.setTextSize(2);
  tft.setTextColor(TFT_YELLOW);
  tft.setCursor(45, 150);
  tft.print(pskKeyboardBuffer);
  tft.print("_");
  
  // Przyciski liter A-Z (3 wiersze)
  const char* rows[] = {"QWERTYUIOP", "ASDFGHJKL", "ZXCVBNM"};
  int startX[] = {40, 55, 85};
  int startY = 175;
  int keyW = 32, keyH = 22, gap = 4;
  
  for (int r = 0; r < 3; r++) {
    for (int i = 0; i < strlen(rows[r]); i++) {
      int x = startX[r] + i * (keyW + gap);
      int y = startY + r * (keyH + gap);
      tft.fillRect(x, y, keyW, keyH, TFT_DARKGREY);
      tft.drawRect(x, y, keyW, keyH, TFT_WHITE);
      tft.setTextSize(1);
      tft.setTextColor(TFT_WHITE);
      tft.setCursor(x + 12, y + 6);
      tft.print(rows[r][i]);
    }
  }
  
  // Cyfry 0-9 (góra)
  for (int i = 0; i < 10; i++) {
    int x = 40 + i * (keyW + gap);
    int y = 175;
    tft.fillRect(x, y, keyW, keyH, TFT_BLUE);
    tft.drawRect(x, y, keyW, keyH, TFT_WHITE);
    tft.setCursor(x + 12, y + 6);
    tft.print(i);
  }
  
  // Przyciski specjalne
  // Backspace
  tft.fillRect(350, 175, 50, keyH, TFT_RED);
  tft.drawRect(350, 175, 50, keyH, TFT_WHITE);
  tft.setCursor(355, 182);
  tft.print("<-");
  
  // Spacja
  tft.fillRect(350, 202, 80, keyH, TFT_DARKGREY);
  tft.drawRect(350, 202, 80, keyH, TFT_WHITE);
  tft.setCursor(370, 209);
  tft.print("_");
  
  // OK
  tft.fillRect(350, 230, 50, 30, TFT_GREEN);
  tft.drawRect(350, 230, 50, 30, TFT_WHITE);
  tft.setTextColor(TFT_BLACK);
  tft.setCursor(360, 240);
  tft.print("OK");
  
  // Anuluj
  tft.fillRect(410, 230, 50, 30, TFT_RED);
  tft.drawRect(410, 230, 50, 30, TFT_WHITE);
  tft.setTextColor(TFT_WHITE);
  tft.setCursor(415, 240);
  tft.print("X");
  
  // Slash / (dla znaków)
  tft.fillRect(350, 265, 32, keyH, TFT_BLUE);
  tft.drawRect(350, 265, 32, keyH, TFT_WHITE);
  tft.setCursor(360, 272);
  tft.print("/");
  
  // Minus - (dla znaków)
  tft.fillRect(390, 265, 32, keyH, TFT_BLUE);
  tft.drawRect(390, 265, 32, keyH, TFT_WHITE);
  tft.setCursor(400, 272);
  tft.print("-");
}

// Rysowanie wyboru pasm
static void drawPskBandSelector() {
  // Tło
  tft.fillRect(40, 80, 400, 160, 0x18E3);
  tft.drawRect(40, 80, 400, 160, TFT_WHITE);
  
  tft.setTextSize(2);
  tft.setTextColor(TFT_WHITE);
  tft.setCursor(140, 90);
  tft.print("Wybierz pasma:");
  
  const char* bands[] = {"160m", "80m", "40m", "30m", "20m", "17m", "15m", "12m", "10m", "6m", "ALL"};
  int bandCount = 11;
  int tileW = 60, tileH = 30, gap = 8;
  int startX = 60, startY = 120;
  int cols = 5;
  
  for (int i = 0; i < bandCount; i++) {
    int col = i % cols;
    int row = i / cols;
    int x = startX + col * (tileW + gap);
    int y = startY + row * (tileH + gap);
    
    bool selected = (pskTempBand == bands[i]) || 
                    (pskTempBand == "" && strcmp(bands[i], "ALL") == 0);
    
    tft.fillRect(x, y, tileW, tileH, selected ? TFT_GREEN : TFT_DARKGREY);
    tft.drawRect(x, y, tileW, tileH, TFT_WHITE);
    tft.setTextSize(1);
    tft.setTextColor(selected ? TFT_BLACK : TFT_WHITE);
    tft.setCursor(x + 15, y + 10);
    tft.print(bands[i]);
  }
  
  // Przycisk zamknij
  tft.fillRect(200, 200, 80, 30, TFT_RED);
  tft.drawRect(200, 200, 80, 30, TFT_WHITE);
  tft.setTextColor(TFT_WHITE);
  tft.setCursor(215, 210);
  tft.print("ZAMKNIJ");
}

// Rysowanie wyboru trybów
static void drawPskModeSelector() {
  // Tło
  tft.fillRect(40, 80, 400, 160, 0x18E3);
  tft.drawRect(40, 80, 400, 160, TFT_WHITE);
  
  tft.setTextSize(2);
  tft.setTextColor(TFT_WHITE);
  tft.setCursor(140, 90);
  tft.print("Wybierz tryb:");
  
  const char* modes[] = {"FT8", "FT4", "JS8", "PSK31", "PSK63", "RTTY", "CW", "SSB", "ALL"};
  int modeCount = 9;
  int tileW = 70, tileH = 30, gap = 10;
  int startX = 60, startY = 120;
  int cols = 4;
  
  for (int i = 0; i < modeCount; i++) {
    int col = i % cols;
    int row = i / cols;
    int x = startX + col * (tileW + gap);
    int y = startY + row * (tileH + gap);
    
    bool selected = (pskTempMode == modes[i]) || 
                    (pskTempMode == "" && strcmp(modes[i], "ALL") == 0);
    
    tft.fillRect(x, y, tileW, tileH, selected ? TFT_GREEN : TFT_DARKGREY);
    tft.drawRect(x, y, tileW, tileH, TFT_WHITE);
    tft.setTextSize(1);
    tft.setTextColor(selected ? TFT_BLACK : TFT_WHITE);
    tft.setCursor(x + 20, y + 10);
    tft.print(modes[i]);
  }
  
  // Przycisk zamknij
  tft.fillRect(200, 200, 80, 30, TFT_RED);
  tft.drawRect(200, 200, 80, 30, TFT_WHITE);
  tft.setTextColor(TFT_WHITE);
  tft.setCursor(215, 210);
  tft.print("ZAMKNIJ");
}

// Rysowanie menu ustawień PSK
static void drawPskSettingsMenu() {
  // Tło menu - półprzezroczyste ciemne
  tft.fillRect(40, 40, 400, 200, 0x18E3); // Ciemny szary
  tft.drawRect(40, 40, 400, 200, TFT_WHITE);
  
  // Tytuł
  tft.setTextSize(2);
  tft.setTextColor(TFT_WHITE);
  tft.setCursor(140, 50);
  tft.print("PSK Reporter - Filtry");
  
