Tom50505050/esp32-ham-clock/src/main.cpp
  // Linia podziału
  tft.drawLine(50, 70, 430, 70, TFT_WHITE);
  
  // Pola edycji
  tft.setTextSize(1);
  
  // Znak (receiver)
  tft.setTextColor(pskActiveField == PSK_FIELD_CALL ? TFT_YELLOW : TFT_WHITE);
  tft.setCursor(60, 90);
  tft.print("Znak:");
  tft.fillRect(120, 85, 100, 20, pskActiveField == PSK_FIELD_CALL ? TFT_DARKGREY : TFT_BLACK);
  tft.setCursor(125, 90);
  tft.print(pskTempReceiver.length() > 0 ? pskTempReceiver.c_str() : "(wszystkie)");
  
  // Pasmo
  tft.setTextColor(pskActiveField == PSK_FIELD_BAND ? TFT_YELLOW : TFT_WHITE);
  tft.setCursor(250, 90);
  tft.print("Pasmo:");
  tft.fillRect(300, 85, 80, 20, pskActiveField == PSK_FIELD_BAND ? TFT_DARKGREY : TFT_BLACK);
  tft.setCursor(305, 90);
  tft.print(pskTempBand.length() > 0 ? pskTempBand.c_str() : "(wszystkie)");
  
  // Tryb
  tft.setTextColor(pskActiveField == PSK_FIELD_MODE ? TFT_YELLOW : TFT_WHITE);
  tft.setCursor(60, 120);
  tft.print("Tryb:");
  tft.fillRect(120, 115, 100, 20, pskActiveField == PSK_FIELD_MODE ? TFT_DARKGREY : TFT_BLACK);
  tft.setCursor(125, 120);
  tft.print(pskTempMode.length() > 0 ? pskTempMode.c_str() : "(wszystkie)");
  
  // Max spotów
  tft.setTextColor(pskActiveField == PSK_FIELD_MAXSPOTS ? TFT_YELLOW : TFT_WHITE);
  tft.setCursor(250, 120);
  tft.print("Max:");
  tft.fillRect(300, 115, 50, 20, pskActiveField == PSK_FIELD_MAXSPOTS ? TFT_DARKGREY : TFT_BLACK);
  tft.setCursor(305, 120);
  tft.print(pskTempMaxSpots);
  
  // Przyciski
  // Zapisz
  tft.fillRect(100, 180, 80, 30, TFT_GREEN);
  tft.drawRect(100, 180, 80, 30, TFT_WHITE);
  tft.setTextColor(TFT_BLACK);
  tft.setCursor(115, 190);
  tft.print("ZAPISZ");
  
  // Anuluj
  tft.fillRect(300, 180, 80, 30, TFT_RED);
  tft.drawRect(300, 180, 80, 30, TFT_WHITE);
  tft.setTextColor(TFT_WHITE);
  tft.setCursor(310, 190);
  tft.print("ANULUJ");
  
  // Podpowiedź
  tft.setTextColor(TFT_CYAN);
  tft.setCursor(60, 155);
  tft.print("Dotknij pola aby edytowac, ZAPISZ aby zastosowac");
  
  // Jeśli aktywna klawiatura - narysuj ją
  if (pskActiveField == PSK_FIELD_KEYBOARD) {
    drawPskKeyboard();
  }
  // Jeśli wybor pasma - narysuj selektor
  else if (pskActiveField == PSK_FIELD_BAND_SELECT) {
    drawPskBandSelector();
  }
  // Jeśli wybor trybu - narysuj selektor
  else if (pskActiveField == PSK_FIELD_MODE_SELECT) {
    drawPskModeSelector();
  }
}

// Rysowanie legendy
static void drawPskMapLegend() {
  int y = 290, x = 10, boxSize = 8, gap = 45;
  tft.setTextSize(1);
  const char* bands[] = {"80m", "40m", "20m", "15m", "10m", "6m"};
  uint16_t colors[] = {TFT_RED, TFT_ORANGE, TFT_GREEN, TFT_CYAN, TFT_BLUE, TFT_MAGENTA};
  for (int i = 0; i < 6; i++) {
    tft.fillRect(x + i*gap, y, boxSize, boxSize, colors[i]);
    tft.setTextColor(TFT_WHITE);
    tft.setCursor(x + i*gap + 12, y);
    tft.print(bands[i]);
  }
  tft.setTextColor(TFT_YELLOW);
  tft.setCursor(300, y);
  tft.print("Tap: Refresh");
}

// Główna funkcja rysująca
void drawPskMap() {
  Serial.printf("[PSK] drawPskMap start, pskMapMenuOpen=%d\n", pskMapMenuOpen);
  if (!tftInitialized) return;
  tft.fillScreen(TFT_BLACK);
  Serial.println("[PSK] Screen cleared");
  drawPskMapHeader();
  bool mapLoaded = false;
  if (littleFsReady) {
    mapLoaded = drawBmpFromFS(PSK_MAP_BMP_PATH, MAP_DISPLAY_X, MAP_DISPLAY_Y);
  }
  if (!mapLoaded) {
    tft.fillRect(MAP_DISPLAY_X, MAP_DISPLAY_Y, MAP_DISPLAY_W, MAP_DISPLAY_H, 0x0011);
    tft.fillRect(220, 80, 80, 100, 0x2222);
    tft.fillRect(200, 140, 100, 80, 0x2222);
    tft.fillRect(300, 60, 120, 80, 0x2222);
    tft.fillRect(60, 50, 100, 90, 0x2222);
    tft.fillRect(80, 150, 70, 90, 0x2222);
    tft.fillRect(380, 160, 60, 40, 0x2222);
  }
  unsigned long now = millis();
  // Auto-odświeżanie PSKReporter (jeśli włączone)
  if (pskAutoRefreshMinutes > 0) {
    unsigned long refreshIntervalMs = (unsigned long)pskAutoRefreshMinutes * 60 * 1000;
    if (now - lastPskFetchMs > refreshIntervalMs) {
      fetchPskReporterData();
      lastPskFetchMs = now;
    }
  }
  for (int i = 0; i < pskSpotCount; i++) {
    if (pskSpots[i].lat >= MAP_LAT_MIN && pskSpots[i].lat <= MAP_LAT_MAX &&
        pskSpots[i].lon >= MAP_LON_MIN && pskSpots[i].lon <= MAP_LON_MAX) {
      int x, y;
      latLonToScreen(pskSpots[i].lat, pskSpots[i].lon, x, y);
      uint16_t color = getPskBandColor(pskSpots[i].band);
      tft.fillCircle(x, y, 3, color);
      tft.drawCircle(x, y, 3, TFT_BLACK);
    }
  }
  drawPskMapLegend();
  drawSwitchScreenFooter();
  // Przycisk menu w lewym górnym rogu
  drawPskMenuButton();
  // Jeśli menu otwarte, narysuj je na wierzchu
  if (pskMapMenuOpen) {
    Serial.println("[PSK] Drawing settings menu");
    drawPskSettingsMenu();
  }
  Serial.println("[PSK] drawPskMap end");
}

// Obsługa dotyku klawiatury
static void handlePskKeyboardTouch(uint16_t x, uint16_t y) {
  int keyW = 32, keyH = 22, gap = 4;
  
  // OK (350,230,50,30)
  if (x >= 350 && x < 400 && y >= 230 && y < 260) {
    if (pskKeyboardTarget == 1) {
      pskTempReceiver = pskKeyboardBuffer;
    } else if (pskKeyboardTarget == 2) {
      pskTempMaxSpots = pskKeyboardBuffer.toInt();
      if (pskTempMaxSpots < 10) pskTempMaxSpots = 10;
      if (pskTempMaxSpots > 200) pskTempMaxSpots = 200;
    }
    pskActiveField = PSK_FIELD_NONE;
    pskKeyboardBuffer = "";
    drawPskSettingsMenu();
    return;
  }
  
  // Anuluj (410,230,50,30)
  if (x >= 410 && x < 460 && y >= 230 && y < 260) {
    pskActiveField = PSK_FIELD_NONE;
    pskKeyboardBuffer = "";
    drawPskSettingsMenu();
    return;
  }
  
  // Backspace (350,175,50,22)
  if (x >= 350 && x < 400 && y >= 175 && y < 197) {
    if (pskKeyboardBuffer.length() > 0) {
      pskKeyboardBuffer.remove(pskKeyboardBuffer.length() - 1);
      drawPskKeyboard();
    }
    return;
  }
  
  // Spacja (350,202,80,22)
  if (x >= 350 && x < 430 && y >= 202 && y < 224) {
    if (pskKeyboardBuffer.length() < 20) {
      pskKeyboardBuffer += " ";
      drawPskKeyboard();
    }
    return;
  }
  
  // Slash / (350,265,32,22)
  if (x >= 350 && x < 382 && y >= 265 && y < 287) {
    if (pskKeyboardBuffer.length() < 20) {
      pskKeyboardBuffer += "/";
      drawPskKeyboard();
    }
    return;
  }
  
