Tom50505050/esp32-ham-clock/src/main.cpp
  // Minus - (390,265,32,22)
  if (x >= 390 && x < 422 && y >= 265 && y < 287) {
    if (pskKeyboardBuffer.length() < 20) {
      pskKeyboardBuffer += "-";
      drawPskKeyboard();
    }
    return;
  }
  
  // Cyfry 0-9 (wiersz 175)
  for (int i = 0; i < 10; i++) {
    int keyX = 40 + i * (keyW + gap);
    if (x >= keyX && x < keyX + keyW && y >= 175 && y < 197) {
      if (pskKeyboardBuffer.length() < 20) {
        pskKeyboardBuffer += String(i);
        drawPskKeyboard();
      }
      return;
    }
  }
  
  // Litery QWERTYUIOP (wiersz 175, x od 40)
  const char* row1 = "QWERTYUIOP";
  int startX1 = 40;
  for (int i = 0; i < 10; i++) {
    int keyX = startX1 + i * (keyW + gap);
    if (x >= keyX && x < keyX + keyW && y >= 175 && y < 197) {
      if (pskKeyboardBuffer.length() < 20) {
        pskKeyboardBuffer += row1[i];
        drawPskKeyboard();
      }
      return;
    }
  }
  
  // Litery ASDFGHJKL (wiersz 201, x od 55)
  const char* row2 = "ASDFGHJKL";
  int startX2 = 55;
  for (int i = 0; i < 9; i++) {
    int keyX = startX2 + i * (keyW + gap);
    if (x >= keyX && x < keyX + keyW && y >= 201 && y < 223) {
      if (pskKeyboardBuffer.length() < 20) {
        pskKeyboardBuffer += row2[i];
        drawPskKeyboard();
      }
      return;
    }
  }
  
  // Litery ZXCVBNM (wiersz 227, x od 85)
  const char* row3 = "ZXCVBNM";
  int startX3 = 85;
  for (int i = 0; i < 7; i++) {
    int keyX = startX3 + i * (keyW + gap);
    if (x >= keyX && x < keyX + keyW && y >= 227 && y < 249) {
      if (pskKeyboardBuffer.length() < 20) {
        pskKeyboardBuffer += row3[i];
        drawPskKeyboard();
      }
      return;
    }
  }
}

// Obsługa dotyku selektora pasm
static void handlePskBandSelectorTouch(uint16_t x, uint16_t y) {
  const char* bands[] = {"160m", "80m", "40m", "30m", "20m", "17m", "15m", "12m", "10m", "6m", "ALL"};
  int bandCount = 11;
  int tileW = 60, tileH = 30, gap = 8;
  int startX = 60, startY = 120;
  int cols = 5;
  
  // Sprawdź przyciski pasm
  for (int i = 0; i < bandCount; i++) {
    int col = i % cols;
    int row = i / cols;
    int bx = startX + col * (tileW + gap);
    int by = startY + row * (tileH + gap);
    
    if (x >= bx && x < bx + tileW && y >= by && y < by + tileH) {
      if (strcmp(bands[i], "ALL") == 0) {
        pskTempBand = "";
      } else {
        pskTempBand = bands[i];
      }
      pskActiveField = PSK_FIELD_NONE;
      drawPskSettingsMenu();
      return;
    }
  }
  
  // Zamknij (200,200,80,30)
  if (x >= 200 && x < 280 && y >= 200 && y < 230) {
    pskActiveField = PSK_FIELD_NONE;
    drawPskSettingsMenu();
  }
}

// Obsługa dotyku selektora trybów
static void handlePskModeSelectorTouch(uint16_t x, uint16_t y) {
  const char* modes[] = {"FT8", "FT4", "JS8", "PSK31", "PSK63", "RTTY", "CW", "SSB", "ALL"};
  int modeCount = 9;
  int tileW = 70, tileH = 30, gap = 10;
  int startX = 60, startY = 120;
  int cols = 4;
  
  // Sprawdź przyciski trybów
  for (int i = 0; i < modeCount; i++) {
    int col = i % cols;
    int row = i / cols;
    int mx = startX + col * (tileW + gap);
    int my = startY + row * (tileH + gap);
    
    if (x >= mx && x < mx + tileW && y >= my && y < my + tileH) {
      if (strcmp(modes[i], "ALL") == 0) {
        pskTempMode = "";
      } else {
        pskTempMode = modes[i];
      }
      pskActiveField = PSK_FIELD_BAND_SELECT; // Otwórz wybór pasma po wyborze trybu
      drawPskSettingsMenu();
      return;
    }
  }
  
  // Zamknij (200,200,80,30)
  if (x >= 200 && x < 280 && y >= 200 && y < 230) {
    pskActiveField = PSK_FIELD_NONE;
    drawPskSettingsMenu();
  }
}

// Obsługa dotyku - główna funkcja
void handlePskMapTouch(uint16_t x, uint16_t y) {
  // Obsługa menu jeśli otwarte
  if (pskMapMenuOpen) {
    // Jeśli aktywna klawiatura
    if (pskActiveField == PSK_FIELD_KEYBOARD) {
      handlePskKeyboardTouch(x, y);
      return;
    }
    // Jeśli aktywny selektor pasm
    if (pskActiveField == PSK_FIELD_BAND_SELECT) {
      handlePskBandSelectorTouch(x, y);
      return;
    }
    // Jeśli aktywny selektor trybów
    if (pskActiveField == PSK_FIELD_MODE_SELECT) {
      handlePskModeSelectorTouch(x, y);
      return;
    }
    
    // Sprawdź czy dotknięto przycisk ZAPISZ (100,180,80,30)
    Serial.printf("[PSK] Checking ZAPISZ button at x=%d, y=%d, pskMapMenuOpen=%d\n", x, y, pskMapMenuOpen);
    if (x >= 100 && x < 180 && y >= 180 && y < 210) {
      Serial.println("[PSK] ZAPISZ button pressed!");
      // Zapisz ustawienia
      pskReceiverCallsign = pskTempReceiver;
      pskFilterBand = pskTempBand;
      pskFilterMode = pskTempMode;
      pskMaxSpots = pskTempMaxSpots;
      Serial.printf("[PSK] Settings: receiver=%s, band=%s, mode=%s, max=%d\n", 
                    pskReceiverCallsign.c_str(), pskFilterBand.c_str(), 
                    pskFilterMode.c_str(), pskMaxSpots);
      // Zapisz do NVS
      preferences->putString("psk_receiver", pskReceiverCallsign);
      preferences->putString("psk_band", pskFilterBand);
      preferences->putString("psk_mode", pskFilterMode);
      preferences->putInt("psk_maxspots", pskMaxSpots);
      pskMapMenuOpen = false;
      pskActiveField = PSK_FIELD_NONE;
      Serial.printf("[PSK] pskMapMenuOpen set to: %d\n", pskMapMenuOpen);
      Serial.println("[PSK] Closing menu and redrawing map...");
      // Przeładuj dane z nowymi filtrami
      lastPskFetchMs = 0;
      fetchPskReporterData();
      Serial.printf("[PSK] Before drawPskMap, pskMapMenuOpen=%d\n", pskMapMenuOpen);
      drawPskMap();
      Serial.printf("[PSK] After drawPskMap, pskMapMenuOpen=%d\n", pskMapMenuOpen);
      Serial.println("[PSK] Map redrawn, menu should be closed");
      // Wyświetl potwierdzenie zapisu
      tft.fillRect(140, 130, 200, 40, TFT_GREEN);
      tft.drawRect(140, 130, 200, 40, TFT_WHITE);
      tft.setTextColor(TFT_BLACK);
      tft.setTextSize(2);
      tft.setCursor(170, 143);
      tft.print("ZAPISANO!");
      delay(1000);
      drawPskMap();  // Odśwież ponownie aby usunąć napis
      return;
    }
    // Sprawdź czy dotknięto przycisk ANULUJ (300,180,80,30)
    if (x >= 300 && x < 380 && y >= 180 && y < 210) {
      pskMapMenuOpen = false;
      pskActiveField = PSK_FIELD_NONE;
      drawPskMap();
      return;
    }
    // Sprawdź czy dotknięto pole ZNAK (120,85,100,20) - otwórz klawiaturę
    if (x >= 120 && x < 220 && y >= 85 && y < 105) {
      pskKeyboardTarget = 1; // 1 = znak
      pskKeyboardBuffer = pskTempReceiver;
      pskActiveField = PSK_FIELD_KEYBOARD;
      drawPskSettingsMenu();
      return;
    }
    // Sprawdź czy dotknięto pole PASMO (300,85,80,20) - otwórz selektor pasm
    if (x >= 300 && x < 380 && y >= 85 && y < 105) {
      pskActiveField = PSK_FIELD_BAND_SELECT;
      drawPskSettingsMenu();
      return;
    }
    // Sprawdź czy dotknięto pole TRYB (120,115,100,20) - otwórz selektor trybów
    if (x >= 120 && x < 220 && y >= 115 && y < 135) {
      pskActiveField = PSK_FIELD_MODE_SELECT;
      drawPskSettingsMenu();
      return;
    }
    // Sprawdź czy dotknięto pole MAX (300,115,50,20) - otwórz klawiaturę
    if (x >= 300 && x < 350 && y >= 115 && y < 135) {
      pskKeyboardTarget = 2; // 2 = max
      pskKeyboardBuffer = String(pskTempMaxSpots);
      pskActiveField = PSK_FIELD_KEYBOARD;
      drawPskSettingsMenu();
      return;
    }
    // Jeśli dotknięto poza polem menu, zamknij menu
    if (!(x >= 40 && x < 440 && y >= 40 && y < 240)) {
      pskMapMenuOpen = false;
      pskActiveField = PSK_FIELD_NONE;
      drawPskMap();
    }
    return;
  }
  
