Tom50505050/esp32-ham-clock/src/main.cpp
  // Sprawdź czy dotknięto przycisk menu (2,2,30,26)
  if (x >= 2 && x < 32 && y >= 2 && y < 28) {
    Serial.println("[PSK] Menu button pressed - opening menu");
    pskMapMenuOpen = true;
    pskActiveField = PSK_FIELD_NONE;
    // Skopiuj aktualne ustawienia do tymczasowych
    pskTempReceiver = pskReceiverCallsign;
    pskTempBand = pskFilterBand;
    pskTempMode = pskFilterMode;
    pskTempMaxSpots = pskMaxSpots;
    drawPskMap();
    return;
  }
  
  if (x >= MAP_DISPLAY_X && x < MAP_DISPLAY_X + MAP_DISPLAY_W &&
      y >= MAP_DISPLAY_Y && y < MAP_DISPLAY_Y + MAP_DISPLAY_H) {
    lastPskFetchMs = 0;
    drawPskMap();
    return;
  }
  const uint16_t cornerY = 240, cornerX = 80;
  if (y >= cornerY && x < cornerX) {
    currentScreen = getNextScreenId(currentScreen);
    drawScreen(currentScreen);
    resetTftAutoSwitchTimer();
  } else if (y >= cornerY && x >= (480 - cornerX)) {
    currentScreen = getPrevScreenId(currentScreen);
    drawScreen(currentScreen);
    resetTftAutoSwitchTimer();
  }
}

// ========== SETUP & LOOP ==========

void setup() {
  // Disable brownout detector to prevent resets due to voltage drops
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0);
  
  // Zapisz czas startu systemu
  bootTimeMs = millis();
  
  // Wyczyść cache QRZ przy starcie (aby wymusić pobranie nowych danych z lat/lon)
  for (int i = 0; i < QRZ_CACHE_SIZE; i++) {
    qrzCache[i].callsign = "";
    qrzCache[i].fetchedAtMs = 0;
  }
  Serial.println("[SETUP] QRZ cache cleared");

  // Ten log idzie "kanałem" (zwykle tym samym co bootlog),
  // który pozwala sprawdzić czy aplikacja w ogóle startuje.
  esp_rom_printf("\nAPP: setup() start\n");

  Serial.begin(115200);
  // Na ESP32-C3 (zwłaszcza z USB CDC) warto chwilę poczekać na monitor portu
  unsigned long serialWaitStart = millis();
  while (!Serial && (millis() - serialWaitStart) < 2000) {
    delay(10);
  }
  delay(200);
  esp_rom_printf("APP: Serial.begin done\n");

  // Daj chwilĂ„â„˘ na ustabilizowanie WiFi/PHY po resecie (zwÄąâ€šaszcza na "Super Mini")
  delay(300);

  if (dxSpotsMutex == nullptr) {
    dxSpotsMutex = xSemaphoreCreateMutex();
  }

  initStatusRgbLed();
  updateStatusRgbLed();

  // Inicjalizacja pomiaru napięcia baterii (TP4056 + 18650)
#ifdef BATTERY_MONITORING_ENABLED
  pinMode(BATTERY_ADC_PIN, INPUT);
  analogSetAttenuation(ADC_11db);  // Pełny zakres 0-3.3V
  analogReadResolution(BATTERY_ADC_RESOLUTION);
  // Pobierz pierwszy odczyt dla wstępnej kalibracji
  delay(10);
  batteryVoltage = readBatteryVoltage();
  batteryPercentage = calculateBatteryPercentage(batteryVoltage);
  batteryCharging = (batteryVoltage > 4.25f);
  Serial.printf("[BATTERY] Init: %.2fV (%d%%) %s\n", 
                batteryVoltage, batteryPercentage, 
                batteryCharging ? "[CHARGING]" : "");
#endif
  
  // WyÄąâ€şwietlacz TFT (ESP32-2432S028) Ă˘â‚¬â€ś inicjalizacja NA POCZĂ„â€žTKU (jak w projekcie referencyjnym)
  // TFT powinien byĂ„â€ˇ inicjalizowany zaraz po Serial.begin(), przed innymi peryferiami
#ifdef ENABLE_TFT_DISPLAY
  initTFT();
  yield();
#endif

  // Inicjalizacja LittleFS z wieloma próbami i diagnostyką
  Serial.println("[LittleFS] Starting initialization...");
  int littleFsAttempts = 0;
  while (!littleFsReady && littleFsAttempts < 3) {
    littleFsAttempts++;
    Serial.printf("[LittleFS] Attempt %d/3...\n", littleFsAttempts);
    if(LittleFS.begin(true)){
      Serial.println("[LittleFS] Mounted successfully!");
      littleFsReady = true;
    } else {
      Serial.printf("[LittleFS] Mount attempt %d FAILED\n", littleFsAttempts);
      delay(200);
    }
  }
  
  if (!littleFsReady) {
    Serial.println("[LittleFS] ERROR: All mount attempts failed!");
    Serial.println("[LittleFS] Check partition scheme in Arduino IDE:");
    Serial.println("  Tools -> Partition Scheme -> should include SPIFFS or LittleFS");
    bootLogLine("LittleFS: BRAK - sprawdz schemat partycji!");
  } else {
    // Sprawdź co jest w LittleFS
    Serial.println("[LittleFS] Checking files:");
    if (LittleFS.exists("/littlefs_data/splash.bmp")) {
      Serial.println("  /littlefs_data/splash.bmp - OK");
    } else {
      Serial.println("  /littlefs_data/splash.bmp - NOT FOUND");
    }
    bootLogLine("LittleFS: OK");
  }

  bootLogLine("");
  bootLogLine("ESP32 DX Cluster Receiver");
  bootLogLine("==============================");
  
  // DIAGNOSTYKA: Sprawdź czy ENABLE_TFT_DISPLAY jest zdefiniowane
#ifdef ENABLE_TFT_DISPLAY
  bootLogLine("ENABLE_TFT_DISPLAY - init TFT");
#else
  bootLogLine("UWAGA: ENABLE_TFT_DISPLAY NIE jest zdefiniowane - TFT dont work!");
  bootLogLine("Upewnij sie, że kompilujesz dla środowiska 'esp32-2432s028'");
#endif
  yield();

  bootLogLine("Config load...");
  loadPreferences();
  
  // TYMCZASOWA NAPRAWA KONFIGURACJI
  if (clusterHost == "Multiplay_C984" || clusterHost.length() == 0) {
    clusterHost = "dxspots.com";
    bootLogLine("FIX: clusterHost reset to dxspots.com");
  }
  if (hamalertHost == "Multiplay_C984" || hamalertHost.length() == 0) {
    hamalertHost = "hamalert.org";
    bootLogLine("FIX: hamalertHost reset to hamalert.org");
  }
  if (hamalertLogin == "Multiplay_C984" || hamalertLogin.length() == 0) {
    hamalertLogin = "";
    bootLogLine("FIX: hamalertLogin reset to empty");
  }
  if (hamalertPassword == "TWOJE_HASLO" || hamalertPassword.length() == 0) {
    hamalertPassword = "";
    bootLogLine("FIX: hamalertPassword reset to empty");
  }
  if (aprsIsHost == "Multiplay_C984" || aprsIsHost.length() == 0) {
    aprsIsHost = "rotate.aprs2.net";
    bootLogLine("FIX: aprsIsHost reset to rotate.aprs2.net");
  }
  if (wifiSSID == "Multiplay_C984") {
    wifiSSID = "Multiplay_C984";  // To jest OK - Twoja sieć
  }
  savePreferences();
  bootLogLine("Config fixed and saved!");
  telnetBuffer.reserve(384);
  pendingTelnetLine.reserve(384);
  potaTelnetBuffer.reserve(384);
  pendingPotaLine.reserve(384);
  aprsBuffer.reserve(384);
  qrzStatus.reserve(64);
  clusterFilterCommands.reserve(128);
  weatherData.description.reserve(96);
  weatherData.cityName.reserve(48);
  weatherData.forecast3hDesc.reserve(64);
  weatherData.forecastNextDayDesc.reserve(64);
  weatherData.lastError.reserve(64);
  weatherData.iconCode.reserve(8);
  propagationData.lastError.reserve(48);
  yield();
#ifdef ENABLE_TFT_DISPLAY
  applyTftRotation();
  applyTouchRotation();
  setBacklightPercent(backlightPercent);
#endif
  
