Tom50505050/esp32-ham-clock/src/main.cpp
  bootLogLine("WIFI starting...");
  if (wifiSSID.length() > 0) {
    bootLogLine("Connecting WiFi: " + wifiSSID);
    if (connectToWiFi()) {
      bootLogLine("WiFi connected!");
      yield();
      updateNTPTime();
      yield();
      connectToCluster();
      connectToPotaCluster();
    } else {
      bootLogLine("WiFi error, starting AP mode...");
      startAPMode();
    }
  } else {
    bootLogLine("No WiFi configuration, starting AP mode...");
    startAPMode();
  }
  yield();
  
  bootLogLine("Starting web server...");
  setupWebServer();
  yield();
  
  bootLogLine("System ready!");
  String ipStr = wifiConnected ? WiFi.localIP().toString() : WiFi.softAPIP().toString();
  bootLogLine("IP: " + ipStr);
  
  // Aktualizuj wyświetlacz TFT (ekran startowy)
#ifdef ENABLE_TFT_DISPLAY
  // Standardowe ekrany powitalne
  drawWelcomeScreenYellow();
  delay(2000);
  drawWelcomeScreenGreen();
  delay(3000);
  
  // Ekran splash SP9TNV z opcją pominięcia - wyświetla się PO ekranach powitalnych
  drawSplashScreen();
  
  // Pokaż ikonę baterii od razu na ekranie splash
#ifdef BATTERY_MONITORING_ENABLED
  drawBatteryQuickUpdate(true);
#endif
  
  // Czekaj na dotyk lub timeout 10 sekund
  unsigned long splashStart = millis();
  bool splashSkipped = false;
  unsigned long lastBatteryUpdate = 0;
  while (!splashSkipped && (millis() - splashStart) < 10000) {
    uint16_t tx, ty;
    if (readTouchPoint(tx, ty)) {
      splashSkipped = true;
    }
    // Odświeżaj ikonę baterii co 1 sekundę podczas czekania
    unsigned long now = millis();
    if (now - lastBatteryUpdate >= 1000) {
      lastBatteryUpdate = now;
      updateBatteryStatus();
      drawBatteryQuickUpdate(true);
    }
    delay(50);
  }
  bootSequenceActive = false;
  drawScreen(currentScreen);
  resetTftAutoSwitchTimer();
  if (currentScreen == SCREEN_HAM_CLOCK) {
    updateScreen1();
  }

  if (uiTaskHandle == nullptr) {
    xTaskCreatePinnedToCore(
      uiTaskLoop,
      "UI_Task",
      8192,
      nullptr,
      2,
      &uiTaskHandle,
      1
    );
  }
#endif
}

void loop() {
  static unsigned long loopCounter = 0;
  static unsigned long lastLoopPrint = 0;
  loopCounter++;
  
  unsigned long now = millis();
  
  // Feed watchdog
  yield();

  // Odroczony restart (ÄąÄ˝eby odpowiedÄąĹź HTTP zdĂ„â€¦ÄąÄ˝yÄąâ€ša wyjÄąâ€şĂ„â€ˇ)
  if (restartRequested && (long)(millis() - restartAtMs) >= 0) {
    LOGV_PRINTLN("[LOOP] Restart requested - restarting...");
    delay(50);
    ESP.restart();
  }
  
  // ObsÄąâ€šuga serwera WWW
  if (server != nullptr) {
    server->handleClient();
  }
  
  // Aktualizuj czas NTP
  updateNTPTime();
  
  // ObsÄąâ€šuga WiFi
  if (!wifiConnected && WiFi.status() == WL_CONNECTED) {
    wifiConnected = true;
    Serial.print("STA połączoneâ€¦czone. IP: ");
    Serial.println(WiFi.localIP());
    // Jeżeli wcześniej był uruchomiony AP do konfiguracji, wyłącz go po udanym połączeniu STA,
    // żeby nie robić wrażenia "zwiechy" (klient AP traci link przy przełączeniu kanału).
    if (WiFi.getMode() & WIFI_AP) {
      Serial.println("Wyłączam AP (portal) po połączeniu STA. Użyj IP z sieci domowej.");
      WiFi.softAPdisconnect(true);
      WiFi.mode(WIFI_STA);
    }
    

    updateNTPTime();
    connectToCluster();
    connectToPotaCluster();
    connectToAPRS(); // Połącz również z APRS-IS
  } else if (wifiConnected && WiFi.status() != WL_CONNECTED) {
    LOGV_PRINTLN("[LOOP] WiFi status zmieniony: połączony -> rozłączony");
    wifiConnected = false;
    telnetConnected = false;
    potaTelnetConnected = false;
    aprsConnected = false;
    LOGV_PRINTLN("[LOOP] STA rozłączone (wracam do trybu offline/AP jeśli aktywne).");
  }

  updateStatusRgbLed();

  // Obsługa wygaszacza ekranu (Matrix)
  checkScreenSaverTimeout();

  // Jeśli jesteśmy offline, zostajemy w AP (portal) â€” stabilnie.
  
  // Obsługa Telnet
  if (wifiConnected) {
    if (!telnetConnected) {
      LOGV_PRINTLN("[LOOP] WiFi OK, próba połączenia z Cluster...");
      connectToCluster();
    } else {
      handleTelnetData();
    }
  }

  // Obsługa POTA Telnet
  if (wifiConnected) {
    // Połączenie z POTA Cluster (Telnet)
    if (!potaTelnetConnected) {
      connectToPotaCluster();
    } else {
      handlePotaTelnetData();
    }
    
    // Tryb HTTP API zamiast Telnetu (źródło: https://api.pota.app/v1/spots)
    if (lastPotaApiFetchMs == 0 || now - lastPotaApiFetchMs > POTA_API_FETCH_INTERVAL_MS) {
      if (fetchPotaApi()) {
        lastPotaApiFetchMs = now;
      } else {
        // nawet przy błędzie aktualizuj czas, by nie spamować API
        lastPotaApiFetchMs = now;
      }
    }

    // HAMALERT przez Telnet: set/json + sh/dx 30
    if (lastHamalertFetchMs == 0 || now - lastHamalertFetchMs > HAMALERT_FETCH_INTERVAL_MS) {
      fetchHamalertTelnet();
      lastHamalertFetchMs = now;
    }
  }

  // ObsÄąâ€šuga APRS-IS
  if (wifiConnected) {
    if (!aprsConnected) {
      LOGV_PRINTLN("[LOOP] WiFi OK, prÄ‚łba poÄąâ€šĂ„â€¦czenia z APRS-IS...");
      connectToAPRS();
    } else {
      handleAPRSData();
      unsigned long nowAprs = millis();

      if (aprsBeaconEnabled && aprsLoginSent && userLatLonValid) {
        if (nextAPRSPositionDueMs == 0) {
          nextAPRSPositionDueMs = nowAprs + APRS_POSITION_FIRST_DELAY_MS;
        } else if ((long)(nowAprs - nextAPRSPositionDueMs) >= 0) {
          sendAprsPosition();
          nextAPRSPositionDueMs = nowAprs + aprsPositionIntervalMs;
        }
      } else {
        nextAPRSPositionDueMs = 0; // Reset harmonogramu gdy beacon jest wyłączony lub brak loginu/koordynat
        aprsBeaconTxCount = 0;
      }
      
      // Watchdog APRS: jeÄąâ€şli brak danych przez dÄąâ€šuÄąÄ˝szy czas, zrÄ‚łb reconnect
      unsigned long inactivityTime = nowAprs - lastAPRSRxMs;
      if (inactivityTime > APRS_INACTIVITY_RECONNECT_MS) {
        LOGV_PRINT("[LOOP] WARNING: Brak danych z APRS-IS przez ");
        LOGV_PRINT(inactivityTime / 1000);
        LOGV_PRINTLN(" sekund -> reconnect");
        aprsClient.stop();
        aprsConnected = false;
        aprsLoginSent = false;
        // connectToAPRS() odpali siĂ„â„˘ w kolejnych iteracjach
      }
    }
  }

  // Aktualizuj dane propagacyjne (hamqsl solarxml)
  if (wifiConnected) {
    unsigned long now = millis();
    unsigned long interval = lastPropagationFetchOk ? PROPAGATION_FETCH_INTERVAL_MS
                                                   : PROPAGATION_FETCH_RETRY_MS;
    if (lastPropagationFetchMs == 0 || now - lastPropagationFetchMs > interval) {
      lastPropagationFetchOk = fetchPropagationData();
      lastPropagationFetchMs = now;

