Tom50505050/esp32-ham-clock/src/main.cpp
    }
  }

  // Obsługa kolejki QRZ/Callook (asynchronicznie)
  if (wifiConnected && qrzQueueLen > 0) {
    unsigned long now = millis();
    unsigned long qrzInterval = getQrzLookupIntervalMs();
    if (now - lastQrzLookupMs >= qrzInterval) {
      for (int i = 0; i < qrzQueueLen; i++) {
        if (now < qrzQueue[i].nextTryMs) {
          continue;
        }
        String grid;
        String country;
        String name;
        String email;
        String qth;
        double lat = 0.0;
        double lon = 0.0;
        bool hasLatLon = false;
        bool ok = fetchCallookCallsignInfo(qrzQueue[i].callsign, grid, country, name, email, qth, lat, lon, hasLatLon);
        lastQrzLookupMs = now;
        if (ok) {
          updateSpotsWithQrz(qrzQueue[i].callsign, grid, country, name, lat, lon, hasLatLon);
          removeQrzQueueAt(i);
        } else {
          qrzQueue[i].attempts++;
          if (qrzQueue[i].attempts >= QRZ_RETRY_LIMIT) {
            removeQrzQueueAt(i);
          } else {
            qrzQueue[i].nextTryMs = now + QRZ_RETRY_DELAY_MS;
          }
        }
        break; // jedna prÄ‚łba na iteracjĂ„â„˘
      }
    }
  }

  // Aktualizuj pogodĂ„â„˘ (OpenWeather)
  if (wifiConnected) {
    unsigned long now = millis();
    unsigned long interval = lastWeatherFetchOk ? WEATHER_FETCH_INTERVAL_MS
                                               : WEATHER_FETCH_RETRY_MS;
    if (lastWeatherFetchMs == 0 || now - lastWeatherFetchMs > interval) {
      lastWeatherFetchOk = fetchWeatherData();
      lastWeatherFetchMs = now;

    }
  }

  // Przetwarzaj maks. 1 liniĂ„â„˘ telnet na iteracjĂ„â„˘ (ÄąÄ˝eby nie zamroziĂ„â€ˇ WWW/UI)
  if (pendingTelnetLine.length() > 0) {
    LOGV_PRINT("[LOOP] Przetwarzanie linii telnet, len=");
    LOGV_PRINTLN(pendingTelnetLine.length());
    LOGV_PRINT("[LOOP] Linia: ");
    if (pendingTelnetLine.length() > 80) {
      LOGV_PRINTLN(pendingTelnetLine.substring(0, 80) + "...");
    } else {
      LOGV_PRINTLN(pendingTelnetLine);
    }
    
    String line = pendingTelnetLine;
    pendingTelnetLine = ""; // WyczyÄąâ€şĂ„â€ˇ PRZED parsowaniem (ÄąÄ˝eby nie gromadziĂ„â€ˇ)
    yield(); // Feed watchdog przed dÄąâ€šugĂ„â€¦ operacjĂ„â€¦
    
    DXSpot spot;
    unsigned long parseStart = millis();
    if (parseDXSpot(line, spot)) {
      unsigned long parseTime = millis() - parseStart;
      if (parseTime > 50) {
        LOGV_PRINT("[LOOP] WARNING: parseDXSpot zajĂ„â„˘Äąâ€šo ");
        LOGV_PRINT(parseTime);
        LOGV_PRINTLN("ms");
      }
      addSpot(spot);
      // Aktualizuj wyÄąâ€şwietlacz TFT z nowymi spotami (tylko jeÄąâ€şli jesteÄąâ€şmy na ekranie 2)

    }
  }

  if (pendingPotaLine.length() > 0) {
    String line = pendingPotaLine;
    pendingPotaLine = "";
    
    Serial.print("[POTA DEBUG] Otrzymano linie: ");
    Serial.println(line);

    DXSpot spot;
    if (parsePotaSpot(line, spot)) {
      Serial.print("[POTA DEBUG] Parsowanie OK, mode=");
      Serial.print(spot.mode);
      Serial.print(", callsign=");
      Serial.println(spot.callsign);
      
      if (spot.mode == "SSB") {
        applyQrzCacheToSpot(spot, QRZ_CACHE_TTL_MS);
        addPotaSpot(spot);
        Serial.println("[POTA DEBUG] Spot dodany!");
        
        bool qrzConfigured = (qrzUsername.length() > 0 && qrzPassword.length() > 0);
        if (qrzConfigured && spot.country.length() == 0 && spot.callsign.length() > 0) {
          String call = spot.callsign;
          call.toUpperCase();
          enqueueQrzLookup(call);
        }
      } else {
        Serial.print("[POTA DEBUG] Odrzucono - nie SSB: ");
        Serial.println(spot.mode);
      }
    } else {
      Serial.println("[POTA DEBUG] Parsowanie nieudane");
    }
  }

  // Watchdog telnet: jeÄąâ€şli brak danych z clustra przez dÄąâ€šuÄąÄ˝szy czas, zrÄ‚łb reconnect
  if (telnetConnected && telnetClient.connected()) {
    unsigned long now = millis();
    unsigned long inactivityTime = now - lastTelnetRxMs;
    if (inactivityTime > TELNET_INACTIVITY_RECONNECT_MS) {
      LOGV_PRINT("[LOOP] WARNING: Brak danych z DX Cluster przez ");
      LOGV_PRINT(inactivityTime / 1000);
      LOGV_PRINTLN(" sekund -> reconnect");
      telnetClient.stop();
      telnetConnected = false;
      clusterLoginSent = false;
      clusterLoginScheduled = false;
      // connectToCluster() odpali siĂ„â„˘ w kolejnych iteracjach
    } else if (inactivityTime > 320000) { // OstrzeÄąÄ˝enie po 4 minutach
      LOGV_PRINT("[LOOP] WARNING: Brak danych z Cluster przez ");
      LOGV_PRINT(inactivityTime / 1000);
      LOGV_PRINTLN(" sekund (blisko timeout)");
    }
  }

  if (potaTelnetConnected && potaTelnetClient.connected()) {
    unsigned long now = millis();
    unsigned long inactivityTime = now - lastPotaRxMs;
    if (inactivityTime > POTA_TELNET_INACTIVITY_RECONNECT_MS) {
      LOGV_PRINT("[LOOP] WARNING: Brak danych z POTA Cluster przez ");
      LOGV_PRINT(inactivityTime / 1000);
      LOGV_PRINTLN(" sekund -> reconnect");
      potaTelnetClient.stop();
      potaTelnetConnected = false;
      potaLoginSent = false;
      potaLoginScheduled = false;
    }
  }

  // WyÄąâ€şlij znak (login) jeÄąâ€şli zaplanowany
  if (telnetConnected && telnetClient.connected() && clusterLoginScheduled) {
    if ((long)(millis() - clusterSendLoginAtMs) >= 0) {
      LOGV_PRINTLN("[LOOP] WysyÄąâ€šanie loginu do Cluster...");
      clusterLoginScheduled = false;
      if (!clusterLoginSent) {
        String login = userCallsign;
        login.trim();
        if (login.length() == 0) {
          login = DEFAULT_CALLSIGN;
        }
        
        // JeÄąâ€şli mamy lokator, dodaj go do loginu w formacie: callsign/locator
        // Format zgodny z CC-Cluster (dxspots.com) i wiĂ„â„˘kszoÄąâ€şciĂ„â€¦ DX ClusterÄ‚łw
        if (userLocator.length() >= 4) {
          login += "/";
          login += userLocator;
          Serial.print("[CLUSTER] Login -> ");
          Serial.print(login);
          Serial.print(" (callsign/locator)");
          if (userCallsign.length() == 0) {
            Serial.print(" - domyÄąâ€şlny znak, ustaw swÄ‚łj w Config");
          }
          Serial.println();
        } else {
          Serial.print("[CLUSTER] Login -> ");
          Serial.print(login);
          if (userCallsign.length() == 0) {
            Serial.print(" (domyÄąâ€şlny, ustaw swÄ‚łj znak w Config)");
          } else {
            Serial.print(" (bez lokatora - ustaw w Config dla lepszej funkcjonalnoÄąâ€şci)");
          }
          Serial.println();
        }
        
        telnetClient.print(login);
        telnetClient.print("\r\n");
        clusterLoginSent = true;
        lastClusterKeepAliveMs = millis();
        Serial.println("[CLUSTER] Login wysÄąâ€šany");
        
