Tom50505050/esp32-ham-clock/src/main.cpp
        // Po zalogowaniu wyÄąâ€şlij komendy konfiguracyjne CC-Cluster (z opÄ‚łÄąĹźnieniem)
        // Daj czas clusterowi na przetworzenie loginu
        delay(500);
        sendClusterConfigCommands();
      }
    }
  }

  if (potaTelnetConnected && potaTelnetClient.connected() && potaLoginScheduled) {
    if ((long)(millis() - potaSendLoginAtMs) >= 0) {
      potaLoginScheduled = false;
      if (!potaLoginSent) {
        String login = userCallsign;
        login.trim();
        if (login.length() == 0) {
          login = DEFAULT_CALLSIGN;
        }
        if (userLocator.length() >= 4) {
          login += "/";
          login += userLocator;
        }
        potaTelnetClient.print(login);
        potaTelnetClient.print("\r\n");
        potaLoginSent = true;
        lastPotaKeepAliveMs = millis();
      }
    }
  }

  // Keepalive: niektÄ‚łre klastry zrywajĂ„â€¦ idle telnet, wiĂ„â„˘c co ~30s wysyÄąâ€šamy CRLF
  if (telnetConnected && telnetClient.connected()) {
    unsigned long now = millis();
    if (now - lastClusterKeepAliveMs > 30000) {
      LOGV_PRINTLN("[LOOP] WysyÄąâ€šanie keepalive do Cluster");
      telnetClient.print("\r\n");
      lastClusterKeepAliveMs = now;
    }
  }

  if (potaTelnetConnected && potaTelnetClient.connected()) {
    unsigned long now = millis();
    if (now - lastPotaKeepAliveMs > 30000) {
      potaTelnetClient.print("\r\n");
      lastPotaKeepAliveMs = now;
    }
  }
  
  // Aktualizacja pomiaru baterii (TP4056 + 18650)
#ifdef BATTERY_MONITORING_ENABLED
  if (updateBatteryStatus()) {
    // Debug co 30 sekund - stan baterii
    Serial.printf("[BATTERY] %.2fV (%d%%) %s\n", 
                  batteryVoltage, batteryPercentage,
                  batteryCharging ? "[CHARGING]" : "");
    
    // Szybka aktualizacja ikony baterii (bez odświeżania całego nagłówka)
    // drawBatteryQuickUpdate() jest lekka i nie powoduje watchdog resetu
    drawBatteryQuickUpdate();
    
    // Ostrzeżenie przy niskim poziomie baterii (< 10%)
    if (batteryPercentage < 10 && !batteryLowWarningShown) {
      Serial.println("[BATTERY] UWAGA: Niski poziom baterii! Podłącz ładowarkę.");
      batteryLowWarningShown = true;
    }
    // Reset flagi ostrzeżenia gdy bateria się naładuje
    if (batteryPercentage > 20 && batteryLowWarningShown) {
      batteryLowWarningShown = false;
    }
  }
#endif

  // Feed watchdog przed delay
  yield();
  delay(10); // Małe opóźnienie dla stabilności
  
}
